Description: Uploads a package to Jamf Pro
Identifier: com.github.eth-its-recipes.jamf.MicrosoftOffice2019Serializer-eawag
ParentRecipe: com.github.eth-its-recipes.pkg.MicrosoftOfficeSerializer-eawag
MinimumVersion: "2.3"

Input:
  LIMITATION: "2019"
  NAME: Microsoft Office Serializer
  PKG_CATEGORY: eawag
  UPDATE_PREDICATE: "pkg_uploaded != True"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%PKG_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%PKG_CATEGORY%"

  - Processor: com.github.grahampugh.recipes.commonprocessors/WritePkgResultToJson

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"

  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult
