Comment: |
  This is a template recipe and cannot be used without a child recipe or RecipeOverride.
  UNTESTED_RECIPE_IDENTIFIER must be supplied.
  NAME needs to be provided in the child recipe. 
  If the app name does not match NAME.app, JSS_INVENTORY_NAME should also be overridden.
  If the icon does not match NAME.png, SELFSERVICE_ICON should also be overridden.
   may require additional information.

Description: Creates trigger policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.template-trigger-plus-update-prod
MinimumVersion: "2.3"

Input:
  TEST_USERS_GROUP_NAME: "%NAME% test users"
  TEST_USERS_GROUP_TEMPLATE: SmartGroup-test-users.xml
  USERS_GROUP_NAME: "%NAME% users"
  USERS_GROUP_TEMPLATE: SmartGroup-users.xml
  AUTOUPDATE_EXCLUDED_GROUP_NAME: "%NAME% auto-update excluded"
  AUTOUPDATE_EXCLUDED_GROUP_TEMPLATE: SmartGroup-autoupdate-excluded.xml
  PROD_VERSION_INSTALLED_GROUP_NAME: "%NAME% current version installed"
  PROD_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed.xml
  UNTESTED_VERSION_INSTALLED_GROUP_NAME: "%NAME% test version installed"
  INSTALLED_GROUP_NAME: "%NAME% installed"
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed.xml
  TRIGGER_POLICY_NAME: "%NAME%"
  TRIGGER_POLICY_CATEGORY: Triggered Installers
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-nonotification.xml
  TRIGGER_NAME: "%NAME%-install"
  TRIGGER_POLICY_RUN_COMMAND: "echo 'Installation of %NAME% complete'"
  AUTOUPDATE_POLICY_NAME: "Auto-update %NAME%"
  AUTOUPDATE_POLICY_TEMPLATE: Policy-prod-preset-autoupdate.xml
  AUTOUPDATE_POLICY_CATEGORY: Preset auto-updaters
  AUTOUPDATE_POLICY_FREQUENCY: Once every day
  UPDATE_POLICY_NAME: "Update %NAME%"
  UPDATE_POLICY_TEMPLATE: Policy-prod-selfservice-update.xml
  UPDATE_POLICY_CATEGORY: Updates
  SELFSERVICE_POLICY_NAME: "%NAME%"
  SELFSERVICE_POLICY_CATEGORY: Connect & Remote
  INSTALL_BUTTON_TEXT: "Install %version%"
  UPDATE_BUTTON_TEXT: "Update to %version%"
  SELFSERVICE_ICON: "%NAME%.png"
  UPDATE_SELFSERVICE_DISPLAY_NAME: "Update %NAME%"
  UPDATE_SELFSERVICE_DESCRIPTION: "%NAME% will be updated to version %version%."
  PROD_PREDICATE: "ready_to_stage == False"

Process:
  - Processor: com.github.grahampugh.recipes.preprocessors/LastRecipeRunChecker
    Arguments:
      recipeoverride_identifier: "%UNTESTED_RECIPE_IDENTIFIER%"

  - Processor: com.github.eth-its-recipes.processors/JamfUploadSharepointStageCheck

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%PROD_PREDICATE%"

  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%TRIGGER_POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%UPDATE_POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%AUTOUPDATE_POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%TEST_USERS_GROUP_NAME%"
      computergroup_template: "%TEST_USERS_GROUP_TEMPLATE%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%USERS_GROUP_NAME%"
      computergroup_template: "%USERS_GROUP_TEMPLATE%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%INSTALLED_GROUP_NAME%"
      computergroup_template: "%INSTALLED_GROUP_TEMPLATE%"
      replace_group: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%AUTOUPDATE_EXCLUDED_GROUP_NAME%"
      computergroup_template: "%AUTOUPDATE_EXCLUDED_GROUP_TEMPLATE%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%PROD_VERSION_INSTALLED_GROUP_NAME%"
      computergroup_template: "%PROD_VERSION_INSTALLED_GROUP_TEMPLATE%"
      replace_group: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%TRIGGER_POLICY_TEMPLATE%"
      policy_name: "%TRIGGER_POLICY_NAME%"
      replace_policy: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Comment: Auto-update policy
    Arguments:
      policy_template: "%AUTOUPDATE_POLICY_TEMPLATE%"
      policy_name: "%AUTOUPDATE_POLICY_NAME%"
      icon: ""
      replace_policy: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Comment: Self Service update policy
    Arguments:
      policy_template: "%UPDATE_POLICY_TEMPLATE%"
      policy_name: "%UPDATE_POLICY_NAME%"
      icon: "%SELFSERVICE_ICON%"
      replace_policy: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyDeleter
    Comment: Delete the untested policy
    Arguments:
      policy_name: "%LAST_RUN_POLICY_NAME%"
