Comment: |
  This is a template recipe and cannot be used without a child recipe or RecipeOverride.
  UNTESTED_RECIPE_IDENTIFIER must be supplied
  NAME, SELFSERVICE_DESCRIPTION and SELFSERVICE_POLICY_CATEGORY need to be provided in the child recipe. 
  If the app name does not match NAME.app, JSS_INVENTORY_NAME should also be overridden.
  If the icon does not match NAME.png, SELFSERVICE_ICON should also be overridden.
   may require additional information.

Description: Creates all production policies for a particular title - used for products that will auto-update by default.
Identifier: com.github.eth-its-recipes.jamf.template-preset-try-prod
MinimumVersion: "2.3"

Input:
  SELFSERVICE_DESCRIPTION: "%LAST_RUN_SELFSERVICE_DESCRIPTION%"
  JSS_INVENTORY_NAME: "%NAME%.app"
  TEST_USERS_GROUP_NAME: "%NAME% test users"
  TEST_USERS_GROUP_TEMPLATE: SmartGroup-test-users.xml
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% test version installed"
  USERS_GROUP_NAME: "%NAME% users"
  USERS_GROUP_TEMPLATE: SmartGroup-users.xml
  AUTOINSTALL_ALL_SOFTWARE_GROUP_NAME: Software Gets Auto-installed
  AUTOINSTALL_ALL_SOFTWARE_GROUP_TEMPLATE: SmartGroup-autoinstall-all-software.xml
  AUTOINSTALL_GROUP_NAME: "%NAME% auto-install"
  AUTOINSTALL_GROUP_TEMPLATE: SmartGroup-autoinstall.xml
  AUTOUPDATE_EXCLUDED_GROUP_NAME: "%NAME% auto-update excluded"
  AUTOUPDATE_EXCLUDED_GROUP_TEMPLATE: SmartGroup-autoupdate-excluded.xml
  PROD_VERSION_INSTALLED_GROUP_NAME: "%NAME% current version installed"
  PROD_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed.xml
  INSTALLED_GROUP_NAME: "%NAME% installed"
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed.xml
  TRIGGER_POLICY_NAME: "Install %NAME%"
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly.xml
  TRIGGER_POLICY_CATEGORY: Triggered Installers
  TRIGGER_POLICY_RUN_COMMAND: "echo 'Installation of %NAME% complete'"
  AUTOINSTALL_POLICY_NAME: "Auto-install %NAME%"
  AUTOINSTALL_POLICY_TEMPLATE: Policy-prod-autoinstall.xml
  AUTOINSTALL_POLICY_CATEGORY: Auto-installers
  AUTOINSTALL_POLICY_FREQUENCY: Once every day
  AUTOUPDATE_POLICY_NAME: "Auto-update %NAME%"
  AUTOUPDATE_POLICY_TEMPLATE: Policy-prod-preset-try-autoupdate.xml
  AUTOUPDATE_POLICY_CATEGORY: Preset auto-updaters
  AUTOUPDATE_POLICY_FREQUENCY: Once every day
  UPDATE_POLICY_NAME: "Update %NAME%"
  UPDATE_POLICY_TEMPLATE: Policy-prod-selfservice-try-update.xml
  UPDATE_POLICY_CATEGORY: Updates
  SELFSERVICE_POLICY_NAME: "%NAME%"
  SELFSERVICE_POLICY_TEMPLATE: Policy-prod-selfservice-install.xml
  INSTALL_BUTTON_TEXT: "Install %version%"
  UPDATE_BUTTON_TEXT: "Update to %version%"
  TRIGGER_NAME: "%NAME%-install"
  SELFSERVICE_DISPLAY_NAME: "%NAME%"
  SELFSERVICE_ICON: "%NAME%.png"
  UPDATE_SELFSERVICE_DISPLAY_NAME: "Update %NAME%"
  UPDATE_SELFSERVICE_DESCRIPTION: "%NAME% will be updated to version %version%."
  PROD_PREDICATE: "ready_to_stage == False"
  UPDATE_SCRIPT_NAME: jamf-policy-trigger-blocking-apps.sh
  UPDATE_SCRIPT_PATH: jamf-policy-trigger-blocking-apps.sh
  UPDATE_SCRIPT_PRIORITY: After
  UPDATE_SCRIPT_CATEGORY: Administration
  UPDATE_SCRIPT_PARAMETER4_LABEL: Install policy trigger
  UPDATE_SCRIPT_PARAMETER5_LABEL: quit or cancel
  UPDATE_SCRIPT_PARAMETER6_LABEL: Blocking App 1
  UPDATE_SCRIPT_PARAMETER7_LABEL: Blocking App 2
  UPDATE_SCRIPT_PARAMETER8_LABEL: Blocking App 3
  UPDATE_SCRIPT_PARAMETER9_LABEL: Blocking App 4
  UPDATE_SCRIPT_PARAMETER10_LABEL: Blocking App 5
  UPDATE_SCRIPT_PARAMETER11_LABEL: Blocking App 6
  UPDATE_POLICY_PARAMETER4_VALUE: "%TRIGGER_NAME%"
  UPDATE_POLICY_PARAMETER6_VALUE: "%NAME%"
  UPDATE_POLICY_PARAMETER7_VALUE: ""
  UPDATE_POLICY_PARAMETER8_VALUE: ""
  UPDATE_POLICY_PARAMETER9_VALUE: ""
  UPDATE_POLICY_PARAMETER10_VALUE: ""
  UPDATE_POLICY_PARAMETER11_VALUE: ""
  UPDATE_POLICY_PARAMETER5_VALUE: "quit"
  AUTOUPDATE_POLICY_PARAMETER5_VALUE: "cancel"
  AUTOUPDATE_POLICY_RUN_COMMAND: "echo 'Autoupdate of %NAME% complete'"
  UPDATE_POLICY_RUN_COMMAND: "echo 'Update of %NAME% complete'"



Process:
  - Processor: com.github.grahampugh.recipes.preprocessors/LastRecipeRunChecker
    Arguments:
      recipeoverride_identifier: "%UNTESTED_RECIPE_IDENTIFIER%"

  - Processor: com.github.eth-its-recipes.processors/JamfUploadSharepointStageCheck

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%PROD_PREDICATE%"

  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%TRIGGER_POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%UPDATE_POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%AUTOUPDATE_POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%AUTOINSTALL_POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%SCRIPT_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "%UPDATE_SCRIPT_CATEGORY%"
      script_name: "%UPDATE_SCRIPT_NAME%"
      script_path: "%UPDATE_SCRIPT_PATH%"
      script_priority: "%UPDATE_SCRIPT_PRIORITY%"
      script_parameter4: "%UPDATE_SCRIPT_PARAMETER4_LABEL%"
      script_parameter5: "%UPDATE_SCRIPT_PARAMETER5_LABEL%"
      script_parameter6: "%UPDATE_SCRIPT_PARAMETER6_LABEL%"
      script_parameter7: "%UPDATE_SCRIPT_PARAMETER7_LABEL%"
      script_parameter8: "%UPDATE_SCRIPT_PARAMETER8_LABEL%"
      script_parameter9: "%UPDATE_SCRIPT_PARAMETER9_LABEL%"
      script_parameter10: "%UPDATE_SCRIPT_PARAMETER10_LABEL%"
      script_parameter11: "%UPDATE_SCRIPT_PARAMETER11_LABEL%"
      replace_script: True
 
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%TEST_USERS_GROUP_NAME%"
      computergroup_template: "%TEST_USERS_GROUP_TEMPLATE%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%USERS_GROUP_NAME%"
      computergroup_template: "%USERS_GROUP_TEMPLATE%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%INSTALLED_GROUP_NAME%"
      computergroup_template: "%INSTALLED_GROUP_TEMPLATE%"
      replace_group: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%AUTOINSTALL_ALL_SOFTWARE_GROUP_NAME%"
      computergroup_template: "%AUTOINSTALL_ALL_SOFTWARE_GROUP_TEMPLATE%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%AUTOINSTALL_GROUP_NAME%"
      computergroup_template: "%AUTOINSTALL_GROUP_TEMPLATE%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%AUTOUPDATE_EXCLUDED_GROUP_NAME%"
      computergroup_template: "%AUTOUPDATE_EXCLUDED_GROUP_TEMPLATE%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%PROD_VERSION_INSTALLED_GROUP_NAME%"
      computergroup_template: "%PROD_VERSION_INSTALLED_GROUP_TEMPLATE%"
      replace_group: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Comment: Trigger-only policy
    Arguments:
      policy_template: "%TRIGGER_POLICY_TEMPLATE%"
      policy_name: "%TRIGGER_POLICY_NAME%"
      icon: ""
      replace_policy: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Comment: Auto-install policy
    Arguments:
      policy_template: "%AUTOINSTALL_POLICY_TEMPLATE%"
      policy_name: "%AUTOINSTALL_POLICY_NAME%"
      icon: ""
      replace_policy: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Comment: Auto-update policy
    Arguments:
      policy_template: "%AUTOUPDATE_POLICY_TEMPLATE%"
      policy_name: "%AUTOUPDATE_POLICY_NAME%"
      icon: ""
      replace_policy: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Comment: Self Service install policy
    Arguments:
      SELFSERVICE_POLICY_CATEGORY: "%PKG_CATEGORY%"
      policy_template: "%SELFSERVICE_POLICY_TEMPLATE%"
      policy_name: "%SELFSERVICE_POLICY_NAME%"
      icon: "%SELFSERVICE_ICON%"
      replace_policy: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Comment: Self Service update policy
    Arguments:
      policy_template: "%UPDATE_POLICY_TEMPLATE%"
      policy_name: "%UPDATE_POLICY_NAME%"
      icon: "%SELFSERVICE_ICON%"
      replace_policy: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyDeleter
    Comment: Delete the untested policy
    Arguments:
      policy_name: "%LAST_RUN_POLICY_NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupDeleter
    Comment: Delete the test version installed group
    Arguments:
      computergroup_name: "%TEST_VERSION_INSTALLED_GROUP_NAME%"