Comment: |
  This is a template recipe and cannot be used without a child recipe or RecipeOverride.
  UNTESTED_RECIPE_IDENTIFIER must be supplied.
  NAME needs to be provided in the child recipe. 
  If the app name does not match NAME.app, JSS_INVENTORY_NAME should also be overridden.
  If the icon does not match NAME.png, SELFSERVICE_ICON should also be overridden.
   may require additional information.

Description: Creates trigger policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.template-triggeronly-prod
MinimumVersion: "2.3"

Input:
  TRIGGER_POLICY_NAME: "%NAME%"
  TRIGGER_POLICY_CATEGORY: Triggered Installers
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-nonotification.xml
  TRIGGER_NAME: "%NAME%-install"
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% test version installed"
  TRIGGER_POLICY_RUN_COMMAND: "echo 'Installation of %NAME% complete'"
  SELFSERVICE_POLICY_NAME: "%NAME%"
  PROD_PREDICATE: "ready_to_stage == False"

Process:
  - Processor: com.github.grahampugh.recipes.preprocessors/LastRecipeRunChecker
    Arguments:
      recipeoverride_identifier: "%UNTESTED_RECIPE_IDENTIFIER%"

  - Processor: com.github.eth-its-recipes.processors/JamfUploadSharepointStageCheck

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%PROD_PREDICATE%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%TRIGGER_POLICY_TEMPLATE%"
      policy_name: "%TRIGGER_POLICY_NAME%"
      replace_policy: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyDeleter
    Comment: Delete the untested policy
    Arguments:
      policy_name: "%LAST_RUN_POLICY_NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupDeleter
    Comment: Delete the test version installed group
    Arguments:
      computergroup_name: "%TEST_VERSION_INSTALLED_GROUP_NAME%"