Comment: |
  This is a template recipe and cannot be used without a child recipe or RecipeOverride.
  UNTESTED_RECIPE_IDENTIFIER must be supplied
  NAME, POLICY_NAME and SELFSERVICE_DISPLAY_NAME need to be provided in the child recipe.
  If the app name does not match NAME.app, JSS_INVENTORY_NAME should also be overridden.
  If the icon does not match NAME.png, SELFSERVICE_ICON should also be overridden.

Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.template-OS-exclude-min-script-nodes
MinimumVersion: "2.3"

Input:
  POLICY_NAME: "%NAME% (Testing)"
  OS_EXCLUDE_MIN: "11.0"
  OS_EXCLUDE_MIN_GROUP_NAME: "macOS %OS_EXCLUDE_MIN% or newer"
  OS_EXCLUDE_MAX_GROUP_TEMPLATE: SmartGroup-OS-exclude-min.xml
  SELFSERVICE_DISPLAY_NAME: "%NAME% (Testing)"
  SELFSERVICE_ICON: "%NAME%.png"
  TESTING_GROUP_NAME: Testing
  TESTING_GROUP_TEMPLATE: StaticGroup-testing.xml
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% test version installed"
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed.xml
  INSTALL_BUTTON_TEXT: "Install %version%"
  REINSTALL_BUTTON_TEXT: "Install %version%"
  POLICY_CATEGORY: Untested
  POLICY_TEMPLATE: Policy-untested-selfservice-script-OS-exclude-max.xml
  UPDATE_PREDICATE: "pkg_metadata_updated == False"
  POLICY_RUN_COMMAND: "echo 'Installation of %NAME% complete'"
  SCRIPT_NAME: "%NAME%-postinstall.sh"
  SCRIPT_PATH: "%NAME%-postinstall.sh"
  SCRIPT_PRIORITY: After
  PARAMETER4_LABEL: Parameter 4
  PARAMETER5_LABEL: Parameter 5
  PARAMETER6_LABEL: Parameter 6
  PARAMETER7_LABEL: Parameter 7
  PARAMETER8_LABEL: Parameter 8
  PARAMETER9_LABEL: Parameter 9
  PARAMETER10_LABEL: Parameter 10
  PARAMETER11_LABEL: Parameter 11
  PARAMETER4_VALUE: ""
  PARAMETER5_VALUE: ""
  PARAMETER6_VALUE: ""
  PARAMETER7_VALUE: ""
  PARAMETER8_VALUE: ""
  PARAMETER9_VALUE: ""
  PARAMETER10_VALUE: ""
  PARAMETER11_VALUE: ""
  SELFSERVICE_DESCRIPTION: "%LAST_RUN_SELFSERVICE_DESCRIPTION%"

Process:
  - Processor: com.github.grahampugh.recipes.preprocessors/LastRecipeRunChecker
    Arguments:
      recipeoverride_identifier: "%UNTESTED_RECIPE_IDENTIFIER%"

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"

  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%PKG_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      replace_pkg: "False"
      replace_pkg_metadata: "True"
      pkg_category: "%PKG_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "%PKG_CATEGORY%"
      script_name: "%SCRIPT_NAME%"
      script_path: "%SCRIPT_PATH%"
      script_priority: "%SCRIPT_PRIORITY%"
      script_parameter4: "%PARAMETER4_LABEL%"
      script_parameter5: "%PARAMETER5_LABEL%"
      script_parameter6: "%PARAMETER6_LABEL%"
      script_parameter7: "%PARAMETER7_LABEL%"
      script_parameter8: "%PARAMETER8_LABEL%"
      script_parameter9: "%PARAMETER9_LABEL%"
      script_parameter10: "%PARAMETER10_LABEL%"
      script_parameter11: "%PARAMETER11_LABEL%"
      replace_script: True

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%TESTING_GROUP_TEMPLATE%"
      computergroup_name: "%TESTING_GROUP_NAME%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%OS_EXCLUDE_MAX_GROUP_NAME%"
      computergroup_template: "%OS_EXCLUDE_MAX_GROUP_TEMPLATE%"
      replace_group: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%TEST_VERSION_INSTALLED_GROUP_NAME%"
      computergroup_template: "%TEST_VERSION_INSTALLED_GROUP_TEMPLATE%"
      replace_group: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      icon: "%SELFSERVICE_ICON%"
      replace_policy: "True"
