Description: Uploads a computer configuration to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.LoginItemsNotifications-profile
MinimumVersion: "2.3"

Input:
  NAME: Login Items Notifications
  ORGANIZATION: Apple
  PROFILE_CATEGORY: Notification Settings
  PROFILE_NAME: "%NAME%"
  PROFILE_DESCRIPTION: Disables notifications regarding login items.
  PROFILE_TEMPLATE: Profile-all-computers.xml
  PROFILE_MOBILECONFIG: DisableLoginItemsNotifications.mobileconfig
  REPLACE_PROFILE: "False"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%PROFILE_CATEGORY%"
      replace_category: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerProfileUploader
    Arguments:
      profile_name: "%PROFILE_NAME%"
      profile_category: "%PROFILE_CATEGORY%"
      profile_template: "%PROFILE_TEMPLATE%"
      mobileconfig: "%PROFILE_MOBILECONFIG%"
      replace_profile: "%REPLACE_PROFILE%"
