Comment: |
  This is a template recipe and cannot be used without a child recipe or RecipeOverride.
  UNTESTED_RECIPE_IDENTIFIER must be supplied
  NAME, SELFSERVICE_DESCRIPTION and SELFSERVICE_POLICY_CATEGORY need to be provided in the child recipe. 
  If the app name does not match NAME.app, JSS_INVENTORY_NAME should also be overridden.
  If the icon does not match NAME.png, SELFSERVICE_ICON should also be overridden.
   may require additional information.
Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.template-macos-prod
MinimumVersion: 2.0.0

Input:
  USERS_GROUP_TEMPLATE: SmartGroup-users.xml
  USERS_GROUP_NAME: '%NAME% users'
  UNTESTED_POLICY_NAME: '%NAME% (Testing)'
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly.xml
  TRIGGER_POLICY_RUN_COMMAND: /Library/Management/erase-install/erase-install.sh
  TRIGGER_POLICY_NAME: Trigger %NAME%
  TRIGGER_POLICY_CATEGORY: Triggered Installers
  TRIGGER_NAME: '%NAME%-install'
  TEST_USERS_GROUP_NAME: '%NAME% test users'
  SELFSERVICE_POLICY_TEMPLATE: Policy-prod-selfservice-install-macOS.xml
  SELFSERVICE_POLICY_NAME: '%NAME%'
  SELFSERVICE_ICON: '%NAME%.png'
  SELFSERVICE_DISPLAY_NAME: '%NAME%'
  REINSTALL_BUTTON_TEXT: ERASE!
  PROD_PREDICATE: ready_to_stage == False
  INSTALL_BUTTON_TEXT: ERASE!
  INELIGIBLE_GROUP_TEMPLATE: SmartGroup-macOS-erase-install-ineligible.xml
  INELIGIBLE_GROUP_NAME: '%NAME% ineligible'

Process:
- Processor: com.github.grahampugh.recipes.preprocessors/LastRecipeRunChecker
  Arguments:
    recipeoverride_identifier: '%UNTESTED_RECIPE_IDENTIFIER%'

- Processor: com.github.eth-its-recipes.processors/JamfUploadSharepointStageCheck

- Processor: StopProcessingIf
  Arguments:
    predicate: '%PROD_PREDICATE%'

- Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%TRIGGER_POLICY_CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%USERS_GROUP_NAME%'
    computergroup_template: '%USERS_GROUP_TEMPLATE%'
    replace_group: 'False'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%INELIGIBLE_GROUP_NAME%'
    computergroup_template: '%INELIGIBLE_GROUP_TEMPLATE%'
    replace_group: 'True'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Comment: Trigger-only policy
  Arguments:
    icon: ''
    policy_name: '%TRIGGER_POLICY_NAME%'
    policy_template: '%TRIGGER_POLICY_TEMPLATE%'
    replace_policy: 'True'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Comment: Self Service install policy
  Arguments:
    SELFSERVICE_POLICY_CATEGORY: '%PKG_CATEGORY%'
    icon: '%SELFSERVICE_ICON%'
    policy_name: '%SELFSERVICE_POLICY_NAME%'
    policy_template: '%SELFSERVICE_POLICY_TEMPLATE%'
    replace_policy: 'True'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyDeleter
  Comment: Delete the untested policy
  Arguments:
    policy_name: '%UNTESTED_POLICY_NAME%'
