Comment: |
  This is a template recipe and cannot be used without a child recipe or RecipeOverride.
  UNTESTED_RECIPE_IDENTIFIER must be supplied
  NAME, SELFSERVICE_DESCRIPTION and SELFSERVICE_POLICY_CATEGORY need to be provided in the child recipe. 
  If the app name does not match NAME.app, JSS_INVENTORY_NAME should also be overridden.
  If the icon does not match NAME.png, SELFSERVICE_ICON should also be overridden.
   may require additional information.
Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.template-prod
MinimumVersion: 2.0.0

Input:
  USERS_GROUP_TEMPLATE: SmartGroup-users.xml
  USERS_GROUP_NAME: '%NAME% users'
  UPDATE_SELFSERVICE_DISPLAY_NAME: Update %NAME%
  UPDATE_SELFSERVICE_DESCRIPTION: '%NAME% will be updated to version %version%.'
  UPDATE_POLICY_TEMPLATE: Policy-prod-selfservice-update.xml
  UPDATE_POLICY_NAME: Update %NAME%
  UPDATE_POLICY_CATEGORY: Updates
  UPDATE_BUTTON_TEXT: Update to %version%
  UNTESTED_VERSION_INSTALLED_GROUP_NAME: '%NAME% test version installed'
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly.xml
  TRIGGER_POLICY_RUN_COMMAND: echo 'Installation of %NAME% complete'
  TRIGGER_POLICY_NAME: Install %NAME%
  TRIGGER_POLICY_CATEGORY: Triggered Installers
  TRIGGER_NAME: '%NAME%-install'
  TEST_USERS_GROUP_NAME: '%NAME% test users'
  SELFSERVICE_POLICY_TEMPLATE: Policy-prod-selfservice-install.xml
  SELFSERVICE_POLICY_NAME: '%NAME%'
  SELFSERVICE_ICON: '%NAME%.png'
  SELFSERVICE_DISPLAY_NAME: '%NAME%'
  PROD_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed.xml
  PROD_VERSION_INSTALLED_GROUP_NAME: '%NAME% current version installed'
  PROD_PREDICATE: ready_to_stage == False
  JSS_INVENTORY_NAME: '%NAME%.app'
  INSTALL_BUTTON_TEXT: Install %version%
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed.xml
  INSTALLED_GROUP_NAME: '%NAME% installed'
  AUTOUPDATE_POLICY_TEMPLATE: Policy-prod-autoupdate.xml
  AUTOUPDATE_POLICY_NAME: Auto-update %NAME%
  AUTOUPDATE_POLICY_FREQUENCY: Once every day
  AUTOUPDATE_POLICY_CATEGORY: Auto-updaters
  AUTOUPDATE_GROUP_TEMPLATE: SmartGroup-autoupdate.xml
  AUTOUPDATE_GROUP_NAME: '%NAME% auto-update'
  AUTOUPDATE_ALL_SOFTWARE_GROUP_TEMPLATE: SmartGroup-autoupdate-all-software.xml
  AUTOUPDATE_ALL_SOFTWARE_GROUP_NAME: Software Gets Auto-updated
  AUTOINSTALL_POLICY_TEMPLATE: Policy-prod-autoinstall.xml
  AUTOINSTALL_POLICY_NAME: Auto-install %NAME%
  AUTOINSTALL_POLICY_FREQUENCY: Once every day
  AUTOINSTALL_POLICY_CATEGORY: Auto-installers
  AUTOINSTALL_GROUP_TEMPLATE: SmartGroup-autoinstall.xml
  AUTOINSTALL_GROUP_NAME: '%NAME% auto-install'
  AUTOINSTALL_ALL_SOFTWARE_GROUP_TEMPLATE: SmartGroup-autoinstall-all-software.xml
  AUTOINSTALL_ALL_SOFTWARE_GROUP_NAME: Software Gets Auto-installed

Process:
- Processor: com.github.grahampugh.recipes.preprocessors/LastRecipeRunChecker
  Arguments:
    recipeoverride_identifier: '%UNTESTED_RECIPE_IDENTIFIER%'

- Processor: com.github.eth-its-recipes.processors/JamfUploadSharepointStageCheck

- Processor: StopProcessingIf
  Arguments:
    predicate: '%PROD_PREDICATE%'

- Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%TRIGGER_POLICY_CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%UPDATE_POLICY_CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%AUTOUPDATE_POLICY_CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%AUTOINSTALL_POLICY_CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%USERS_GROUP_NAME%'
    computergroup_template: '%USERS_GROUP_TEMPLATE%'
    replace_group: 'False'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%INSTALLED_GROUP_NAME%'
    computergroup_template: '%INSTALLED_GROUP_TEMPLATE%'
    replace_group: 'True'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%AUTOINSTALL_ALL_SOFTWARE_GROUP_NAME%'
    computergroup_template: '%AUTOINSTALL_ALL_SOFTWARE_GROUP_TEMPLATE%'
    replace_group: 'False'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%AUTOUPDATE_ALL_SOFTWARE_GROUP_NAME%'
    computergroup_template: '%AUTOUPDATE_ALL_SOFTWARE_GROUP_TEMPLATE%'
    replace_group: 'False'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%AUTOINSTALL_GROUP_NAME%'
    computergroup_template: '%AUTOINSTALL_GROUP_TEMPLATE%'
    replace_group: 'False'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%AUTOUPDATE_GROUP_NAME%'
    computergroup_template: '%AUTOUPDATE_GROUP_TEMPLATE%'
    replace_group: 'False'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%PROD_VERSION_INSTALLED_GROUP_NAME%'
    computergroup_template: '%PROD_VERSION_INSTALLED_GROUP_TEMPLATE%'
    replace_group: 'True'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Comment: Trigger-only policy
  Arguments:
    icon: ''
    policy_name: '%TRIGGER_POLICY_NAME%'
    policy_template: '%TRIGGER_POLICY_TEMPLATE%'
    replace_policy: 'True'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Comment: Auto-install policy
  Arguments:
    icon: ''
    policy_name: '%AUTOINSTALL_POLICY_NAME%'
    policy_template: '%AUTOINSTALL_POLICY_TEMPLATE%'
    replace_policy: 'False'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Comment: Auto-update policy
  Arguments:
    icon: ''
    policy_name: '%AUTOUPDATE_POLICY_NAME%'
    policy_template: '%AUTOUPDATE_POLICY_TEMPLATE%'
    replace_policy: 'False'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Comment: Self Service install policy
  Arguments:
    SELFSERVICE_POLICY_CATEGORY: '%PKG_CATEGORY%'
    icon: '%SELFSERVICE_ICON%'
    policy_name: '%SELFSERVICE_POLICY_NAME%'
    policy_template: '%SELFSERVICE_POLICY_TEMPLATE%'
    replace_policy: 'True'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Comment: Self Service update policy
  Arguments:
    icon: '%SELFSERVICE_ICON%'
    policy_name: '%UPDATE_POLICY_NAME%'
    policy_template: '%UPDATE_POLICY_TEMPLATE%'
    replace_policy: 'True'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyDeleter
  Comment: Delete the untested policy
  Arguments:
    policy_name: '%LAST_RUN_POLICY_NAME%'
