Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.AdobeAcrobatReaderDC-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-OS-exclude-max-prod

Input:
  NAME: Adobe Acrobat Reader DC
  UNTESTED_RECIPE_IDENTIFIER: "local.jamf.AdobeAcrobatReaderDC"
  SCRIPT_NAME: AdobeAcrobatReaderDC-postinstall.sh
  SCRIPT_PRIORITY: After
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-script.xml
  SELFSERVICE_ICON: Adobe Acrobat Reader DC 21.png
  OS_EXCLUDE_MAX: 10.13.6
