Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.AdobeCreativeCloud-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: Adobe Creative Cloud
  UNTESTED_RECIPE_IDENTIFIER: "local.jamf.AdobeCreativeCloud"
  SCRIPT_NAME: AdobeCreativeCloud-preinstall.zsh
  SCRIPT_PRIORITY: Before
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-script.xml
  SELFSERVICE_ICON: "%NAME% 5.3.png"
