Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.AdobeAcrobatSDL-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: Adobe Acrobat DC SDL
  JSS_INVENTORY_NAME: Adobe Acrobat.app
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.AdobeAcrobatSDL
  SELFSERVICE_ICON: Adobe Acrobat 22 SDL.png
