Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.AdobeAcrobatReaderDC-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: Adobe Acrobat Reader DC
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.AdobeAcrobatReaderDC
  APPLICATION_NAME_HAS: Adobe Acrobat Reader
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-has.xml
  PROD_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed-has.xml
  SCRIPT_NAME: AdobeAcrobatReaderDC-postinstall.sh
  SCRIPT_PRIORITY: After
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-script.xml
  SELFSERVICE_ICON: Adobe Acrobat Reader DC 21.png
