Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.AdoptOpenJDK8-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: AdoptOpenJDK 8
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.AdoptOpenJDK8
  EXTENSION_ATTRIBUTE_NAME: AdoptOpenJDK8Version
  SELFSERVICE_ICON: AdoptOpenJDK.png
  PROD_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed-EA.xml
  TRIGGERONLY_POLICY_TEMPLATE: Policy-prod-triggeronly-script-parameter4.xml
  SCRIPT_NAME: AdoptOpenJDK-uninstall.sh
  SCRIPT_PRIORITY: Before
  PARAMETER4_VALUE: "8"
