Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.AdoptOpenJDK11-prod
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod
MinimumVersion: 2.0.0

Input:
  NAME: AdoptOpenJDK 8
  EXTENSION_ATTRIBUTE_NAME: AdoptOpenJDK8Version
  PROD_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed-EA.xml
  SELFSERVICE_ICON: AdoptOpenJDK.png
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.AdoptOpenJDK11
