Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.Bitwarden-prod
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod
MinimumVersion: 2.0.0

Input:
  NAME: Bitwarden
  TRIGGER_POLICY_RUN_COMMAND: chown -R "$(stat -f%Su /dev/console):staff" "/Applications/%NAME%.app" && echo "Corrected permissions for %NAME%."
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Bitwarden
