Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.CiscoAnyConnect-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: Cisco AnyConnect Secure Mobility Client
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.CiscoAnyConnect
