Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.CitrixWorkspace-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-OS-exclude-max-prod

Input:
  NAME: Citrix Workspace
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.CitrixWorkspace
  OS_EXCLUDE_MAX: 10.14.6
