Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.CitrixWorkspace-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-OS-exclude-max-prod

Input:
  NAME: Citrix Workspace
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.CitrixWorkspace
  OS_EXCLUDE_MAX: 10.14.6
