Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.CSDS-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: CSD Suite
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.CSDS
  EXTENSION_ATTRIBUTE_NAME: CSDS Version
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: does not match regex
  EXTENSION_ATTRIBUTE_VALUE: ^None$|^$
  PROD_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed-EA.xml
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-EA.xml
  SELFSERVICE_ICON: CSDS.png
