Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.DetectXSwift-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: DetectXSwift
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.DetectXSwift
