Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.DisplayLinkManager-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: DisplayLink Manager
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.DisplayLinkManager
  POLICY_RUN_COMMAND: "jamf policy -event 'DisplayLink Login Screen Extension-install'"
