Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.EclipseTemurin-8-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: Eclipse Temurin 8
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.EclipseTemurin-8
  EXTENSION_ATTRIBUTE_NAME: EclipseTemurin8Version
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: does not match regex
  EXTENSION_ATTRIBUTE_SEARCH_VALUE: ^None$|^$
  SELFSERVICE_ICON: Eclipse Temurin.png
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-EA.xml
  PROD_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed-EA.xml
  TRIGGERONLY_POLICY_TEMPLATE: Policy-prod-triggeronly-script-parameter4.xml
  SCRIPT_NAME: EclipseTemurin-uninstall.sh
  SCRIPT_PRIORITY: Before
  PARAMETER4_VALUE: "8"
