Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.Element-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: Element
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Element
  POLICY_RUN_COMMAND: 'chown -R "$(stat -f%Su /dev/console):staff" "/Applications/%NAME%.app" && echo "Corrected permissions for %NAME%."; jamf policy -event "DisableElectronAppUpdates"'
  SCRIPT_NAME: "%NAME%-postinstall.sh"
  SCRIPT_PRIORITY: After
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-script.xml
  DEFAULT_SERVER_URL: https://staffchat.ethz.ch
