Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.erase-install-prod
MinimumVersion: "2.3"

Input:
  NAME: erase-install.sh
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.erase-install
  TRIGGER_POLICY_NAME: "%NAME%"
  PKG_CATEGORY: Connect & Remote
  TRIGGER_POLICY_CATEGORY: Triggered Installers
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-nonotification.xml
  TRIGGER_NAME: "erase-install-install"
  TRIGGER_POLICY_RUN_COMMAND: "echo 'Installation of %NAME% complete'"
  SELFSERVICE_POLICY_NAME: erase-install.sh

Process:
  - Processor: com.github.grahampugh.recipes.preprocessors/LastRecipeRunChecker
    Arguments:
      recipeoverride_identifier: "%UNTESTED_RECIPE_IDENTIFIER%"

  - Processor: com.github.eth-its-recipes.processors/JamfUploadSharepointStageCheck

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%PROD_PREDICATE%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%TRIGGER_POLICY_TEMPLATE%"
      policy_name: "%TRIGGER_POLICY_NAME%"
      replace_policy: "True"
