Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.ETHDefenderMonitoringTool-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: ETH Defender Monitoring Tool
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.ETHDefenderMonitoringTool
  SELFSERVICE_ICON: Microsoft Defender ATP.png
  EXTENSION_ATTRIBUTE_NAME: ETH Templates MSOffice Version
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: does not match regex
  EXTENSION_ATTRIBUTE_VALUE: ^None$|^$
  SCRIPT_NAME: ETHDefenderMonitoringTool-postinstall.sh
  SCRIPT_PRIORITY: After
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-script.xml
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-EA.xml
  PROD_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed-EA.xml
