Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.ETHDefenderMonitoringTool-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: ETH Defender Monitoring Tool
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.ETHDefenderMonitoringTool
