Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.ETHDefenderMonitoringTool-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: ETH Defender Monitoring Tool
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.ETHDefenderMonitoringTool
  SELFSERVICE_ICON: Microsoft Defender ATP.png
  EXTENSION_ATTRIBUTE_NAME: ETH Templates MSOffice Version
  SCRIPT_NAME: ETHDefenderMonitoringTool-postinstall.sh
  SCRIPT_PRIORITY: After
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-script.xml
  PROD_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed-EA.xml
