Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.ETHOfficeTemplates-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: ETH Templates MSOffice
  PKG_ID: ch.ethz.id.pkg.ETHTemplatesMSOffice
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.ETHOfficeTemplates
  SCRIPT_NAME: ETHOfficeTemplates-uninstall.sh
  SCRIPT_PRIORITY: Before
  EXTENSION_ATTRIBUTE_NAME: ETH Templates MSOffice Version
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: does not match regex
  EXTENSION_ATTRIBUTE_VALUE: ^None$|^$
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-script.xml
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-pkgreceipt.xml
  PROD_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed-pkgreceipt.xml
  SELFSERVICE_ICON: Microsoft Word Template 2021.png
