Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.ETHPrinterDrivers-Ricoh-Vol4-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: ETH Printer Drivers Ricoh Vol4
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.ETHPrinterDriversRicohVol4
  USERS_GROUP_NAME: "ETH Printers users"
  PROD_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed-EA.xml
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-EA.xml
  EXTENSION_ATTRIBUTE_NAME: ETH Printer Drivers Ricoh Vol4 Version
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: does not match regex
  EXTENSION_ATTRIBUTE_VALUE: ^None$|^$
  SELFSERVICE_ICON: ETH Printers.png
