Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.ETHPrinterDrivers-HP-S-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: ETH Printer Drivers HP S
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.ETHPrinterDriversHPS
  USERS_GROUP_NAME: "ETH Printers users"
  PROD_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed-EA.xml
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-EA.xml
  EXTENSION_ATTRIBUTE_NAME: ETH Printer Drivers HP S Version
  SELFSERVICE_ICON: ETH Printers.png
