Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.GLPIAgent-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: GLPI-Agent
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.GLPIAgent
  EXTENSION_ATTRIBUTE_NAME: GLPI-Agent Version
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-EA.xml
  PROD_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed-EA.xml
  TRIGGER_POLICY_RUN_COMMAND: "jamf policy -event GLPI-Agent-Configure"
