Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.GoogleChrome-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-noupdate-prod

Input:
  NAME: Google Chrome
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.GoogleChrome
  SELFSERVICE_ICON: Google Chrome 2020.png
  SCRIPT_NAME: GoogleChrome-postinstall.sh
  SCRIPT_PRIORITY: After
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-script.xml
