Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.KeePassXC-prod
MinimumVersion: 2.0.0
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: KeePassXC
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.KeePassXC
  SCRIPT_NAME: jamf-policy-trigger.sh
  SCRIPT_PRIORITY: Before
  PARAMETER4_VALUE: "%NAME%-uninstall"
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-script-parameter4.xml
