Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.KeePassXC-prod
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod
MinimumVersion: 2.0.0

Input:
  NAME: KeePassXC
  PARAMETER4_VALUE: '%NAME%-uninstall'
  SCRIPT_NAME: jamf-policy-trigger.sh
  SCRIPT_PRIORITY: Before
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-script-parameter4.xml
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.KeePassXC
