Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.LogitechPresentation-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: Logitech Presentation
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.LogitechPresentation
  EXTENSION_ATTRIBUTE_NAME: LogitechPresentationVersion
  EXTENSION_ATTRIBUTE_SCRIPT: LogitechPresentation-EA.sh
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed-EA.xml
