Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.macos-bigsur-download-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-macos-prod

Input:
  NAME: Download macOS Big Sur Installer
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.macOS-erase-install
  INELIGIBLE_GROUP_TEMPLATE: SmartGroup-macOS-download-ineligible.xml
  MIN_OS_VERSION: "10.12.4"
  MAX_OS_VERSION: "11.99"
  MODEL_IDENTIFIER_REGEX: ^(iMac14,4|iMac1[5-9]|iMac2[0-9]|iMacPro|MacBook[8-9]|MacBook1[0-9]|MacBookAir[6-9]|MacBookAir1[0-9]|MacBookPro1[1-6]|Macmini[7-9]|MacPro[6-9])
  TRIGGER_POLICY_RUN_COMMAND: /Library/Management/erase-install/erase-install.sh --os=11 --update --move
  INSTALL_BUTTON_TEXT: Download
  REINSTALL_BUTTON_TEXT: Download
  SELFSERVICE_ICON: Install macOS Big Sur.png
