Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.MAXQDA-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: MAXQDA
  MAJOR_VERSION: "2022"
  JSS_INVENTORY_NAME: "MAXQDA%MAJOR_VERSION%.app"
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.MAXQDA
  TEST_USERS_GROUP_NAME: "%NAME% %MAJOR_VERSION% test users"
  USERS_GROUP_NAME: "%NAME% %MAJOR_VERSION% users"
  AUTOINSTALL_GROUP_NAME: "%NAME% %MAJOR_VERSION% auto-install"
  AUTOUPDATE_GROUP_NAME: "%NAME% %MAJOR_VERSION% auto-update"
  PROD_VERSION_INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% current version installed"
  UNTESTED_VERSION_INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% test version installed"
  INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% installed"
  TRIGGER_POLICY_NAME: "Install %NAME% %MAJOR_VERSION%"
  AUTOINSTALL_POLICY_NAME: "Auto-install %NAME% %MAJOR_VERSION%"
  AUTOUPDATE_POLICY_NAME: "Auto-update %NAME% %MAJOR_VERSION%"
  UPDATE_POLICY_NAME: "Update %NAME% %MAJOR_VERSION%"
  SELFSERVICE_POLICY_NAME: "%NAME% %MAJOR_VERSION%"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %MAJOR_VERSION%"
  UPDATE_SELFSERVICE_DISPLAY_NAME: "Update %NAME% %MAJOR_VERSION%"
