Description: Creates a Self-Service Policy.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftOfficeRemoval-prod
ParentRecipe: com.github.eth-its-recipes.jamf.template-noexclusions-selfservice-only-prod
MinimumVersion: "2.3"

Input:
  NAME: Microsoft Office - Complete Removal
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.MicrosoftOfficeRemoval
  INSTALL_BUTTON_TEXT: "Uninstall"
  REINSTALL_BUTTON_TEXT: "Uninstall"
  SELFSERVICE_POLICY_CATEGORY: Uninstallers
  SELFSERVICE_POLICY_RUN_COMMAND: "jamf policy -event 'ETH Templates MSOffice-uninstall'"
  SELFSERVICE_POLICY_MESSAGE_START: "Completely removing Microsoft Office and all settings"
  SELFSERVICE_POLICY_MESSAGE_FINISH: "Completely removed Microsoft Office and all settings"
