Description: Creates a Self-Service Policy.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftOfficeSerializer-prod
ParentRecipe: com.github.eth-its-recipes.jamf.template-noexclusions-selfservice-only-prod
MinimumVersion: "2.3"

Input:
  NAME: Microsoft Office Serializer
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.MicrosoftOfficeSerializer
  INSTALL_BUTTON_TEXT: "Install License"
  REINSTALL_BUTTON_TEXT: "Install License"
  SELFSERVICE_POLICY_CATEGORY: Tools & Accessories
  SELFSERVICE_POLICY_MESSAGE_START: "Installing Microsoft Office Serial License"
  SELFSERVICE_POLICY_MESSAGE_FINISH: "Microsoft Office Serial License has now been installed"
  SELFSERVICE_ICON: "Microsoft Office 365.png"
  TRIGGER_NAME: Run-MicrosoftOfficeSerializer
