Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.MicrosotRemoteDesktop-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: Microsot Remote Desktop
  UNTESTED_RECIPE_IDENTIFIER: "local.jamf.MicrosotRemoteDesktop"
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-script.xml
  SCRIPT_NAME: MicrosotRemoteDesktop-preinstall.sh
  SCRIPT_PATH: MicrosotRemoteDesktop-preinstall.sh
  SCRIPT_PRIORITY: Before
