Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftRemoteDesktop-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-OS-exclude-max-prod

Input:
  NAME: Microsoft Remote Desktop
  UNTESTED_RECIPE_IDENTIFIER: "local.jamf.MicrosoftRemoteDesktop"
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-script.xml
  SCRIPT_NAME: MicrosoftRemoteDesktop-preinstall.sh
  SCRIPT_PATH: MicrosoftRemoteDesktop-preinstall.sh
  SCRIPT_PRIORITY: Before
  TRIGGER_POLICY_RUN_COMMAND: sudo -u "$(stat -f%Su /dev/console)" -i /Applications/Microsoft\ Remote\ Desktop.app/Contents/MacOS/Microsoft\ Remote\ Desktop --script feed write "%FEED_URL%" --accept-certificates
  SELFSERVICE_ICON: "%NAME% 10.png"
  OS_EXCLUDE_MAX: 10.13.6
