Comment: Requires all the other "Microsoft (app) users" groups to already exist.
Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftAutoUpdate-prod
MinimumVersion: "2.3"

Input:
  NAME: Microsoft AutoUpdate
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.MicrosoftAutoUpdate
  EXTENSION_ATTRIBUTE_NAME: Microsoft AutoUpdate Version
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: does not match regex
  EXTENSION_ATTRIBUTE_SEARCH_VALUE: ^$
  TRIGGERONLY_POLICY_TEMPLATE: Policy-prod-triggeronly-script.xml
  SCRIPT_NAME: MicrosoftAutoUpdate-postinstall.sh
  SCRIPT_PRIORITY: After
  SCRIPT_CATEGORY: Productivity
  USERS_GROUP_NAME: "%NAME% users"
  USERS_GROUP_TEMPLATE: SmartGroup-users-MicrosoftAutoUpdate.xml
  USERS_ALL_MICROSOFT_APPS_NAME: Microsoft applications - all user groups (do not edit)
  USERS_ALL_MICROSOFT_APPS_TEMPLATE: SmartGroup-users-Microsoft-all-apps.xml
  AUTOUPDATE_ALL_SOFTWARE_GROUP_NAME: Software Gets Auto-updated
  AUTOUPDATE_GROUP_NAME: "%NAME% auto-update"
  AUTOUPDATE_GROUP_TEMPLATE: SmartGroup-autoupdate-users-group.xml
  PROD_VERSION_INSTALLED_GROUP_NAME: "%NAME% current version installed"
  PROD_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed-EA.xml
  INSTALLED_GROUP_NAME: "%NAME% installed"
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-EA.xml
  TRIGGER_POLICY_NAME: "Install %NAME%"
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly.xml
  TRIGGER_POLICY_CATEGORY: Triggered Installers
  TRIGGER_POLICY_RUN_COMMAND: "echo 'Installation of %NAME% complete'"
  AUTOUPDATE_POLICY_NAME: "Auto-update %NAME%"
  AUTOUPDATE_POLICY_TEMPLATE: Policy-prod-autoupdate.xml
  AUTOUPDATE_POLICY_CATEGORY: Auto-updaters
  AUTOUPDATE_POLICY_FREQUENCY: Once every day
  TRIGGER_NAME: "%NAME%-install"
  PROD_PREDICATE: "ready_to_stage == False"

Process:
  - Processor: com.github.grahampugh.recipes.preprocessors/LastRecipeRunChecker
    Arguments:
      recipeoverride_identifier: "%UNTESTED_RECIPE_IDENTIFIER%"

  - Processor: com.github.eth-its-recipes.processors/JamfUploadSharepointStageCheck

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%PROD_PREDICATE%"

  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%TRIGGER_POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%AUTOUPDATE_POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%USERS_ALL_MICROSOFT_APPS_NAME%"
      computergroup_template: "%USERS_ALL_MICROSOFT_APPS_TEMPLATE%"
      replace_group: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%USERS_GROUP_NAME%"
      computergroup_template: "%USERS_GROUP_TEMPLATE%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%INSTALLED_GROUP_NAME%"
      computergroup_template: "%INSTALLED_GROUP_TEMPLATE%"
      replace_group: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%PROD_VERSION_INSTALLED_GROUP_NAME%"
      computergroup_template: "%PROD_VERSION_INSTALLED_GROUP_TEMPLATE%"
      replace_group: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%AUTOUPDATE_GROUP_NAME%"
      computergroup_template: "%AUTOUPDATE_GROUP_TEMPLATE%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Comment: Trigger-only policy
    Arguments:
      policy_template: "%TRIGGER_POLICY_TEMPLATE%"
      policy_name: "%TRIGGER_POLICY_NAME%"
      icon: ""
      replace_policy: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Comment: Auto-update policy
    Arguments:
      policy_template: "%AUTOUPDATE_POLICY_TEMPLATE%"
      policy_name: "%AUTOUPDATE_POLICY_NAME%"
      icon: ""
      replace_policy: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyDeleter
    Comment: Delete the untested policy
    Arguments:
      policy_name: "%LAST_RUN_POLICY_NAME%"
