Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftOffice-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-OS-exclude-max-prod

Input:
  NAME: Microsoft Office
  JSS_INVENTORY_NAME: Microsoft Word.app
  UNTESTED_RECIPE_IDENTIFIER: "local.jamf.MicrosoftOffice"
  SELFSERVICE_ICON: "%NAME% 10.png"
  OS_EXCLUDE_MAX: 10.14.6
