Description: Creates a Self-Service Policy.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftOfficeLicenseReset-prod
ParentRecipe: com.github.eth-its-recipes.jamf.template-installedonly-selfservice-prod
MinimumVersion: "2.3"

Input:
  NAME: Microsoft Office License Reset
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.MicrosoftOfficeLicenseReset
  INSTALLED_GROUP_NAME: Microsoft Office installed
  USERS_GROUP_NAME: Microsoft Office users
  JSS_INVENTORY_NAME: Microsoft Word.app
  INSTALL_BUTTON_TEXT: "Reset License"
  REINSTALL_BUTTON_TEXT: "Reset License"
  SELFSERVICE_POLICY_CATEGORY: Tools & Accessories
  SELFSERVICE_POLICY_MESSAGE_START: "Resetting Microsoft Office License"
  SELFSERVICE_POLICY_MESSAGE_FINISH: "Microsoft Office License has now been reset"
  SELFSERVICE_ICON: "Microsoft Office Factory Reset.png"
  TRIGGER_NAME: Run-MicrosoftOfficeLicenseReset
