Description: Creates a Self-Service Policy.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftOfficeSerializer-prod
ParentRecipe: com.github.eth-its-recipes.jamf.template-customexclusion-selfservice-prod
MinimumVersion: "2.3"

Input:
  NAME: Microsoft Office LTSC 2021 Volume License
  JSS_INVENTORY_NAME: Microsoft Word.app
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.MicrosoftOfficeSerializer
  INSTALL_BUTTON_TEXT: "Install License"
  REINSTALL_BUTTON_TEXT: "Install License"
  SELFSERVICE_POLICY_CATEGORY: Productivity
  SELFSERVICE_POLICY_MESSAGE_START: "Installing %NAME%"
  SELFSERVICE_POLICY_MESSAGE_FINISH: "%NAME% has now been installed"
  SELFSERVICE_ICON: "Microsoft Office 365.png"
  TRIGGER_POLICY_NAME: "Install %NAME% Serializer"
  TRIGGER_NAME: Run-MicrosoftOfficeSerializer
  TEST_USERS_GROUP_NAME: "Microsoft Office LTSC 2021 test users"
  EXCLUSION1_GROUP_NAME: "Microsoft Office LTSC 2021 installed"
  EXCLUSION1_GROUP_TEMPLATE: SmartGroup-exclusion-EA.xml
  EXCLUSION2_GROUP_NAME: "Microsoft Office not installed"
  EXCLUSION2_GROUP_TEMPLATE: SmartGroup-not-installed.xml
  EXTENSION_ATTRIBUTE_NAME: Microsoft Office License Type
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: matches regex
  EXTENSION_ATTRIBUTE_VALUE: "2021"
