Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftAutoUpdate-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: Microsoft AutoUpdate
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.MicrosoftAutoUpdate
  EXTENSION_ATTRIBUTE_NAME: Microsoft AutoUpdate Version
  PROD_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed-EA.xml
  TRIGGERONLY_POLICY_TEMPLATE: Policy-prod-triggeronly-script.xml
  SCRIPT_NAME: MicrosoftAutoUpdate-postinstall.sh
  SCRIPT_PRIORITY: After
  SCRIPT_CATEGORY: Productivity
