Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.NessusAgent-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: Nessus Agent
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.NessusAgent
  EXTENSION_ATTRIBUTE_NAME: Nessus Agent Version
  EXTENSION_ATTRIBUTE_SCRIPT: NessusAgent-EA.sh
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: does not match regex
  EXTENSION_ATTRIBUTE_VALUE: ^None$|^$
  PROD_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed-EA.xml
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-EA.xml
