Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.OpenScapeClient-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: OpenScapeClient
  JSS_INVENTORY_NAME: UCDesktopApp.app
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.OpenScapeClient
  VERSION_STRING_TYPE: CFBundleVersion
  EXTENSION_ATTRIBUTE_NAME: OpenScape Client Version
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: does not match regex
  EXTENSION_ATTRIBUTE_VALUE: ^None$|^$
  PROD_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed-app-EA.xml
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed.xml
  SELFSERVICE_ICON: OpenScape Client.png
