Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.Pages-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-OS-exclude-max-prod

Input:
  NAME: Pages
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Pages
