Description: Creates all production policies for a particular title.
Comment: this policy does not need to be staged; this recipe is only for reporting purposes. The SELFSERVICE_POLICY_NAME key does not create a self-service policy - this is only so that the Slack and SharePoint reporting will work properly.
Identifier: com.github.eth-its-recipes.jamf.PyMOLLicense-prod
MinimumVersion: "2.3"

Input:
  NAME: PyMOL License
  UNTESTED_RECIPE_IDENTIFIER: "local.jamf.PyMOLLicense"
  TRIGGER_POLICY_NAME: "%NAME%"
  PKG_CATEGORY: Science & Math
  TRIGGER_POLICY_CATEGORY: Triggered Installers
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-nonotification.xml
  TRIGGER_NAME: "%NAME%-install"
  TRIGGER_POLICY_RUN_COMMAND: "echo 'Installation of %NAME% complete'"
  PROD_PREDICATE: "ready_to_stage == False"
  SELFSERVICE_POLICY_NAME: PyMOL License

Process:
  - Processor: com.github.grahampugh.recipes.preprocessors/LastRecipeRunChecker
    Arguments:
      recipeoverride_identifier: "%UNTESTED_RECIPE_IDENTIFIER%"

  - Processor: com.github.eth-its-recipes.processors/JamfUploadSharepointStageCheck

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%PROD_PREDICATE%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%TRIGGER_POLICY_TEMPLATE%"
      policy_name: "%TRIGGER_POLICY_NAME%"
      replace_policy: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyDeleter
    Comment: Delete the untested policy
    Arguments:
      policy_name: "%LAST_RUN_POLICY_NAME%"
