Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.PyMOL-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: PyMOL
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.PyMOL
  POLICY_RUN_COMMAND: "jamf policy -event 'PyMOL License-install'"
