Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.Quicksilver-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: Quicksilver
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Quicksilver
  SELFSERVICE_ICON: Quicksilver 2.1.png
