Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.SPSSStatistics27-Node-prod
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod
MinimumVersion: 2.0.0

Input:
  NAME: SPSS Statistics
  AUTOINSTALL_GROUP_NAME: '%NAME% %MAJOR_VERSION% %LICENSE% auto-install'
  AUTOINSTALL_POLICY_NAME: Auto-install %NAME% %MAJOR_VERSION% %LICENSE%
  AUTOUPDATE_GROUP_NAME: '%NAME% %MAJOR_VERSION% %LICENSE% auto-update'
  AUTOUPDATE_POLICY_NAME: Auto-update %NAME% %MAJOR_VERSION% %LICENSE%
  INSTALLED_GROUP_NAME: '%NAME% %MAJOR_VERSION% %LICENSE% installed'
  LICENSE: Node
  LICENSE_SET_POLICY_TRIGGER_NAME: Activate-SPSS-%MAJOR_VERSION%-%LICENSE%-License
  MAJOR_VERSION: '27'
  PROD_VERSION_INSTALLED_GROUP_NAME: '%NAME% %MAJOR_VERSION% %LICENSE% current version installed'
  SELFSERVICE_DISPLAY_NAME: '%NAME% %MAJOR_VERSION% %LICENSE%'
  SELFSERVICE_POLICY_NAME: '%NAME% %MAJOR_VERSION% %LICENSE%'
  TEST_USERS_GROUP_NAME: '%NAME% %MAJOR_VERSION% %LICENSE% test users'
  TRIGGER_NAME: SPSSStatistics %MAJOR_VERSION% %LICENSE%-install
  TRIGGER_POLICY_NAME: Install %NAME% %MAJOR_VERSION% %LICENSE%
  TRIGGER_POLICY_RUN_COMMAND: jamf policy -event '%LICENSE_SET_POLICY_TRIGGER_NAME%'
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.SPSSStatistics27-Floating
  UNTESTED_VERSION_INSTALLED_GROUP_NAME: '%NAME% %MAJOR_VERSION% %LICENSE% test version installed'
  UPDATE_POLICY_NAME: Update %NAME% %MAJOR_VERSION% %LICENSE%
  UPDATE_SELFSERVICE_DISPLAY_NAME: Update %NAME% %MAJOR_VERSION% %LICENSE%
  USERS_GROUP_NAME: '%NAME% %MAJOR_VERSION% %LICENSE% users'
