Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.SPSSStatistics28-Floating-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-noupdate-prod

Input:
  NAME: SPSS Statistics
  MAJOR_VERSION: "28"
  LICENSE: Floating
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.SPSSStatistics28-Floating
  TEST_USERS_GROUP_NAME: "%NAME% %MAJOR_VERSION% %LICENSE% test users"
  USERS_GROUP_NAME: "%NAME% %MAJOR_VERSION% %LICENSE% users"
  AUTOINSTALL_GROUP_NAME: "%NAME% %MAJOR_VERSION% %LICENSE% auto-install"
  INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% %LICENSE% installed"
  TRIGGER_POLICY_NAME: "Install %NAME% %MAJOR_VERSION% %LICENSE%"
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-scripts-2.xml
  AUTOINSTALL_POLICY_NAME: "Auto-install %NAME% %MAJOR_VERSION% %LICENSE%"
  SELFSERVICE_POLICY_NAME: "%NAME% %MAJOR_VERSION% %LICENSE%"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %MAJOR_VERSION% %LICENSE%"
  TRIGGER_NAME: "SPSSStatistics %MAJOR_VERSION% %LICENSE%-install"
  TRIGGER_POLICY_RUN_COMMAND: "jamf policy -event '%LICENSE_SET_POLICY_TRIGGER_NAME%'"
  LICENSE_SET_POLICY_TRIGGER_NAME: "Activate-SPSS-%MAJOR_VERSION%-%LICENSE%-License"
  PREINSTALL_SCRIPT_NAME: SPSSStatistics28-preinstall.sh
  PREINSTALL_SCRIPT_PRIORITY: Before
  POSTINSTALL_SCRIPT_NAME: SPSSStatistics28-postinstall.sh
  POSTINSTALL_SCRIPT_PRIORITY: After
