Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.Support-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-OS-exclude-max-prod

Input:
  NAME: Support
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Support
  OS_EXCLUDE_MAX: 10.15.8
  SELFSERVICE_ICON: "ETH.png"
  TRIGGER_POLICY_RUN_COMMAND: "jamf policy -event 'Support App Customisation-install'"
