Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Comment: this policy does not need to be staged; this recipe is only for reporting purposes
Identifier: com.github.eth-its-recipes.jamf.SupportAppCustomisation-prod
MinimumVersion: "2.3"

Input:
  NAME: Support App Customisation
  UNTESTED_RECIPE_IDENTIFIER: "local.jamf.SupportAppCustomisation"
  TRIGGER_POLICY_NAME: "%NAME%"
  PKG_CATEGORY: Tools & Accessories
  TRIGGER_POLICY_CATEGORY: Triggered Installers
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-nonotification.xml
  TRIGGER_NAME: "%NAME%-install"
  TRIGGER_POLICY_RUN_COMMAND: "echo 'Installation of %NAME% complete'"
  UPDATE_PREDICATE: "pkg_metadata_updated == False"

Process:
  - Processor: com.github.grahampugh.recipes.preprocessors/LastRecipeRunChecker
    Arguments:
      recipeoverride_identifier: "%UNTESTED_RECIPE_IDENTIFIER%"

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%TRIGGER_POLICY_TEMPLATE%"
      policy_name: "%TRIGGER_POLICY_NAME%"
      replace_policy: "False"
