Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.switchdrive-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: switchdrive
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.switchdrive
  EXTENSION_ATTRIBUTE_NAME: switchdrive Version
  EXTENSION_ATTRIBUTE_SCRIPT: VersionStringOverride-EA.sh
  JSS_INVENTORY_NAME: "%NAME%.app"
  VERSION_STRING_TYPE: CFBundleVersion
  PROD_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed-EA.xml
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-EA.xml
