Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.TeamViewerQS-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: TeamViewerQS
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.TeamViewerQS
  SELFSERVICE_ICON: TeamViewer.png
