Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.VisualStudioCode-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: Visual Studio Code
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.VisualStudioCode
  SCRIPT_NAME: VisualStudioCode-postinstall.zsh
  SCRIPT_PRIORITY: After
  TRIGGER_POLICY_RUN_COMMAND: 'chown -R "$(stat -f%Su /dev/console):staff" "/Applications/%NAME%.app" && echo "Corrected permissions for %NAME%."'
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-script.xml
  SELFSERVICE_ICON: "%NAME% 1.65.png"
