Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.AdobePhotoshopSDL-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.AdobeCreativeCloudApps-Template-prod

Input:
  NAME: Adobe Photoshop 2024 SDL
  JSS_INVENTORY_NAME: Adobe Photoshop 2024.app
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.AdobePhotoshopSDL
  SELFSERVICE_ICON: Adobe Photoshop 23 SDL.png
  TRIGGER_POLICY_RUN_COMMAND: jamf policy -event AdobeCreativeCloudSDL-install
