Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.AdobePremiereProSDL-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: Adobe Premiere Pro 2022 SDL
  JSS_INVENTORY_NAME: Adobe Premiere Pro 2022.app
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.AdobePremiereProSDL
  SELFSERVICE_ICON: Adobe Premiere Pro 22 SDL.png
  POLICY_RUN_COMMAND: jamf policy -event AdobeCreativeCloudSDL-install
