Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.AdobeInDesignSDL-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.AdobeCreativeCloudApps-Template-prod

Input:
  NAME: Adobe InDesign 2023 SDL
  JSS_INVENTORY_NAME: Adobe InDesign 2023.app
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.AdobeInDesignSDL
  SELFSERVICE_ICON: Adobe InDesign 17 SDL.png
  TRIGGER_POLICY_RUN_COMMAND: jamf policy -event AdobeCreativeCloudSDL-install
