Description: Creates all production policies for a particular title.
Comment: this policy does not need to be staged; this recipe is only for reporting purposes
Identifier: com.github.eth-its-recipes.jamf.AdobeRUM-prod
MinimumVersion: "2.3"

Input:
  NAME: Adobe Remote Update Manager
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.AdobeRUM
  TRIGGER_POLICY_NAME: "Install %NAME%"
  EXTENSION_ATTRIBUTE_NAME: Adobe RUM Version
  EXTENSION_ATTRIBUTE_SCRIPT: AdobeRUM-EA.zsh
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: does not match regex
  EXTENSION_ATTRIBUTE_VALUE: ^None$|^$
  PROD_VERSION_INSTALLED_GROUP_NAME: "%NAME% current version installed"
  PROD_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed-EA.xml
  INSTALLED_GROUP_NAME: "%NAME% installed"
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-EA.xml
  TEST_USERS_GROUP_NAME: Adobe Creative Cloud test users
  TEST_USERS_GROUP_TEMPLATE: SmartGroup-test-users.xml
  USERS_GROUP_NAME: Adobe Creative Cloud users
  USERS_GROUP_TEMPLATE: SmartGroup-users.xml
  AUTOUPDATE_ALL_SOFTWARE_GROUP_NAME: Software Gets Auto-updated
  AUTOUPDATE_GROUP_NAME: Adobe Creative Cloud auto-update
  AUTOUPDATE_GROUP_TEMPLATE: SmartGroup-autoupdate-users-group.xml
  AUTOUPDATE_POLICY_CATEGORY: Auto-updaters
  AUTOUPDATE_POLICY_TEMPLATE: Policy-prod-autoupdate.xml
  AUTOUPDATE_POLICY_NAME: "Auto-update %NAME%"
  AUTOUPDATE_POLICY_FREQUENCY: Once every day
  PKG_CATEGORY: Tools & Accessories
  TRIGGER_POLICY_CATEGORY: Triggered Installers
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-nonotification.xml
  TRIGGER_NAME: AdobeRUM-install
  TRIGGER_POLICY_RUN_COMMAND: "echo 'Installation of %NAME% complete'"
  PROD_PREDICATE: "ready_to_stage == False"
  SELFSERVICE_POLICY_NAME: Adobe Remote Update Manager

Process:
  - Processor: com.github.grahampugh.recipes.preprocessors/LastRecipeRunChecker
    Arguments:
      recipeoverride_identifier: "%UNTESTED_RECIPE_IDENTIFIER%"

  - Processor: com.github.eth-its-recipes.processors/JamfUploadSharepointStageCheck

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%PROD_PREDICATE%"

  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%TRIGGER_POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%AUTOUPDATE_POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%TEST_USERS_GROUP_NAME%"
      computergroup_template: "%TEST_USERS_GROUP_TEMPLATE%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%USERS_GROUP_NAME%"
      computergroup_template: "%USERS_GROUP_TEMPLATE%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%INSTALLED_GROUP_NAME%"
      computergroup_template: "%INSTALLED_GROUP_TEMPLATE%"
      replace_group: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%PROD_VERSION_INSTALLED_GROUP_NAME%"
      computergroup_template: "%PROD_VERSION_INSTALLED_GROUP_TEMPLATE%"
      replace_group: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%AUTOUPDATE_GROUP_NAME%"
      computergroup_template: "%AUTOUPDATE_GROUP_TEMPLATE%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Comment: Trigger-only policy
    Arguments:
      policy_template: "%TRIGGER_POLICY_TEMPLATE%"
      policy_name: "%TRIGGER_POLICY_NAME%"
      icon: ""
      replace_policy: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Comment: Auto-update policy
    Arguments:
      policy_template: "%AUTOUPDATE_POLICY_TEMPLATE%"
      policy_name: "%AUTOUPDATE_POLICY_NAME%"
      icon: ""
      replace_policy: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyDeleter
    Comment: Delete the untested policy
    Arguments:
      policy_name: "%LAST_RUN_POLICY_NAME%"
