Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.AdobeAfterEffectsSDL-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: Adobe After Effects CC 2023 SDL
  JSS_INVENTORY_NAME: Adobe After Effects CC 2023.app
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.AdobeAfterEffectsSDL
  SELFSERVICE_ICON: Adobe After Effects CC SDL 22.png
  TRIGGER_POLICY_RUN_COMMAND: jamf policy -event AdobeCreativeCloudSDL-install
