Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.AffinityPublisher-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: Affinity Publisher 2
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.AffinityPublisher
  TRIGGER_POLICY_TEMPLATE: Policy-prod-selfservice-script-parameter4.xml
  SELFSERVICE_ICON: "%NAME%.png"
  SCRIPT_NAME: jamf-policy-trigger.sh
  SCRIPT_CATEGORY: Administration
  SCRIPT_PRIORITY: Before
  PARAMETER4_LABEL: Trigger name
  PARAMETER4_VALUE: Run-AffinityLicense
