Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.AmazonCoretto-JDK11-ARM64-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: AmazonCorettoJDK11
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.AmazonCoretto-JDK11-ARM64
