Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.AtegraWebFileHandler-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: ATEGRA Web File Handler
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.AtegraWebFileHandler
  SELFSERVICE_ICON: "%NAME%.png"
