Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.AuthyDesktop-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: Authy Desktop
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.AuthyDesktop
  TRIGGER_POLICY_RUN_COMMAND: 'chown -R "$(stat -f%Su /dev/console):staff" "/Applications/%NAME%.app" && echo "Corrected permissions for %NAME%."'
