Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.CellProfiler-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-prod

Input:
  NAME: CellProfiler
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.CellProfiler
