Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.ChemDraw-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod-no-users

Input:
  NAME: ChemDraw
  JSS_INVENTORY_NAME: ChemDraw 23.app
  MAJOR_VERSION: "23"
  LANGUAGE: EN
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.ChemDraw
  USERS_GROUP_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% users"
  AUTOINSTALL_GROUP_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% auto-install"
  AUTOUPDATE_GROUP_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% auto-update"
  PROD_VERSION_INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% current version installed"
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% test version installed"
  INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% installed"
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-majorversion-no-users.xml
  TRIGGER_POLICY_NAME: "Install %NAME% %MAJOR_VERSION% %LANGUAGE%"
  TRIGGER_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE%-install" 
  AUTOINSTALL_POLICY_NAME: "Auto-install %NAME% %MAJOR_VERSION% %LANGUAGE%"
  AUTOUPDATE_POLICY_NAME: "Auto-update %NAME% %MAJOR_VERSION% %LANGUAGE%"
  UPDATE_POLICY_NAME: "Update %NAME% %MAJOR_VERSION% %LANGUAGE%"
  SELFSERVICE_POLICY_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE%"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE%"
  UPDATE_SELFSERVICE_DISPLAY_NAME: "Update %NAME% %MAJOR_VERSION% %LANGUAGE%"
  SELFSERVICE_ICON: ChemDraw 20.png
  
  FORCE_DESCRIPTION: "true"
  AUTOINSTALL_POLICY_TEMPLATE: Policy-prod-autoinstall-ITShop.xml
  SELFSERVICE_POLICY_TEMPLATE: Policy-prod-selfservice-install-ITShop.xml
  SELFSERVICE_POLICY_CATEGORY: "Science & Math"
  SCRIPT_NAME_1: "ITShop_license_check.sh"
  SCRIPT_PRIORITY: "After"
  PARAMETER4_VALUE: "ChemDraw Professional" 
  PARAMETER5_VALUE: "%NAME% %MAJOR_VERSION% %LANGUAGE%-install" 
  PARAMETER6_VALUE: "https://ics.services.jamfcloud.com/icon/hash_937fca61baaedb3611f04019845193b99917ac077ba8c2f96b7fffe92bcd9db2" 
  PARAMETER7_VALUE: "%MAJOR_VERSION%" 
  PARAMETER8_VALUE: "NO"