Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.ChimeraX-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-prod

Input:
  NAME: ChimeraX
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.ChimeraX
  LAST_RUN_SELFSERVICE_DESCRIPTION:  |
    UCSF ChimeraX (or simply ChimeraX) is the next-generation molecular visualization program from the Resource for Biocomputing, Visualization, and Informatics (RBVI), following UCSF Chimera.

    Version: %version%
    Category: %PKG_CATEGORY%
  SELFSERVICE_POLICY_TEMPLATE: Policy-prod-selfservice-install-forcedescription.xml
  
