Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.CitrixWorkspace-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: Citrix Workspace
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.CitrixWorkspace
  PREINSTALL_SCRIPT_NAME: jamf-policy-trigger.sh
  PREINSTALL_SCRIPT_PRIORITY: Before
  PREINSTALL_SCRIPT_PARAMETER4_VALUE: "%NAME%-uninstall"
  POSTINSTALL_SCRIPT_NAME: CitrixWorkspace-postinstall.zsh
  POSTINSTALL_SCRIPT_PRIORITY: After
  POSTINSTALL_SCRIPT_PARAMETER4_VALUE: ""
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-scripts-2-parameter4.xml
  SELFSERVICE_ICON: Citrix Workspace 22.png
