Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.ClickShare-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-prod-no-users

Input:
  NAME: ClickShare
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.ClickShare
