Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.Comsol-arm64-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-platform-prod-no-users

Input:
  NAME: COMSOL Multiphysics
  PLATFORM_EXCLUSION_GROUP_NAME: "Intel Mac"
  PLATFORM_EXCLUSION: x86_64
  PLATFORM: arm64
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Comsol-arm64
  MAJOR_VERSION: "6.4"
  MAJOR_VERSION_FOLDER_NAME: "64"
  SCRIPT_CATEGORY: Productivity
  SCRIPT_NAME: "Comsol-install.zsh"
  SCRIPT_PATH: "Comsol-install.zsh"
  SCRIPT_PRIORITY: After
  PARAMETER4_VALUE: "%COMSOL_DMG_URL%"
  AUTOINSTALL_GROUP_NAME: "%NAME% %MAJOR_VERSION_FOLDER_NAME% %PLATFORM% auto-install"
  AUTOUPDATE_GROUP_NAME: "%NAME% %MAJOR_VERSION_FOLDER_NAME% %PLATFORM% auto-update"
  PROD_VERSION_INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION_FOLDER_NAME% %PLATFORM% current version installed"
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION_FOLDER_NAME% %PLATFORM% test version installed"
  INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION_FOLDER_NAME% %PLATFORM% installed"
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-platform-majorversion-no-users.xml
  TRIGGER_POLICY_NAME: "Install %NAME% %MAJOR_VERSION_FOLDER_NAME% %PLATFORM%"
  TRIGGER_POLICY_RUN_COMMAND: "echo 'Installation of %NAME% %MAJOR_VERSION_FOLDER_NAME% %PLATFORM% complete'"
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-script-parameter4.xml
  AUTOINSTALL_POLICY_NAME: "Auto-install %NAME% %MAJOR_VERSION_FOLDER_NAME% %PLATFORM%"
  AUTOUPDATE_POLICY_NAME: "Auto-update %NAME% %MAJOR_VERSION_FOLDER_NAME% %PLATFORM%"
  UPDATE_POLICY_NAME: "Update %NAME% %MAJOR_VERSION_FOLDER_NAME% %PLATFORM%"
  SELFSERVICE_POLICY_NAME: "%NAME% %MAJOR_VERSION_FOLDER_NAME% %PLATFORM%"
  TRIGGER_NAME: "%NAME% %MAJOR_VERSION_FOLDER_NAME% %PLATFORM%-install"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %MAJOR_VERSION% %PLATFORM%"
  UPDATE_SELFSERVICE_DISPLAY_NAME: "Update %NAME% %MAJOR_VERSION% %PLATFORM%"
  UPDATE_SELFSERVICE_DESCRIPTION: "%NAME% %MAJOR_VERSION% will be updated to version %version%."