Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.Comsol-arm64-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-platform-prod

Input:
  NAME: COMSOL Multiphysics
  PLATFORM_EXCLUSION_GROUP_NAME: "Intel Mac"
  PLATFORM_EXCLUSION: x86_64
  PLATFORM: arm64
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Comsol-arm64
  MAJOR_VERSION: "61"
  AUTOINSTALL_GROUP_NAME: "%NAME% %MAJOR_VERSION% auto-install"
  AUTOUPDATE_GROUP_NAME: "%NAME% %MAJOR_VERSION% auto-update"
  PROD_VERSION_INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% current version installed"
  UNTESTED_VERSION_INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% test version installed"
  INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% installed"
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-majorversion.xml
  TRIGGER_POLICY_NAME: "Install %NAME% %MAJOR_VERSION% %PLATFORM%"
  TRIGGER_POLICY_RUN_COMMAND: "echo 'Installation of %NAME% %MAJOR_VERSION% complete'"
  AUTOINSTALL_POLICY_NAME: "Auto-install %NAME% %MAJOR_VERSION% %PLATFORM%"
  AUTOUPDATE_POLICY_NAME: "Auto-update %NAME% %MAJOR_VERSION% %PLATFORM%"
  UPDATE_POLICY_NAME: "Update %NAME% %MAJOR_VERSION% %PLATFORM%"
  SELFSERVICE_POLICY_NAME: "%NAME% %MAJOR_VERSION% %PLATFORM%"
  TRIGGER_NAME: "%NAME% %MAJOR_VERSION% %PLATFORM%-install"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %MAJOR_VERSION% %PLATFORM%"
  UPDATE_SELFSERVICE_DISPLAY_NAME: "Update %NAME% %MAJOR_VERSION% %PLATFORM%"
  UPDATE_SELFSERVICE_DESCRIPTION: "%NAME% %MAJOR_VERSION% will be updated to version %version%."
