Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.DataWarrior-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: DataWarrior
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.DataWarrior
