Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.DeepL-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: DeepL
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.DeepL
