Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.DellDisplayAndPeripheralManager-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-prod

Input:
  NAME: Dell Display And Peripheral Manager
  JSS_INVENTORY_NAME: DDPM.app
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.DellDisplayAndPeripheralManager
  TRIGGER_POLICY_RUN_COMMAND: 'chown -R "$(stat -f%Su /dev/console):staff" "/Applications/DDPM" && echo "Corrected permissions for %NAME%."'
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-script.xml
  SCRIPT_NAME: DellDisplayAndPeripheralManager-postinstall.zsh
  SCRIPT_PRIORITY: After
