Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.DellDisplayAndPeripheralManager-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: Dell Display And Peripheral Manager
  JSS_INVENTORY_NAME: DDPM.app
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.DellDisplayAndPeripheralManager
