Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.DjView-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: DjView
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.DjView
