Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.Docker-x86_64-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-platform-prod-no-users

Input:
  NAME: Docker
  PLATFORM: x86_64
  PLATFORM_EXCLUSION: arm64
  PLATFORM_EXCLUSION_GROUP_NAME: "Apple Silicon Mac"
  PLATFORM_EXCLUSION_GROUP_TEMPLATE: SmartGroup-platform.xml
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Docker-x86_64
