Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.ETHPrinters-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-prod-no-users

Input:
  NAME: ETH Printers
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.ETHPrinters
  SCRIPT_NAME: ETHPrinters-preinstall.sh
  SCRIPT_PRIORITY: Before
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-script.xml
