Description: Creates all production policies for a particular title.

Identifier: com.github.eth-its-recipes.jamf.Fiji-x86_64-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-platform-prod-no-users

Input:
  NAME: Fiji
  LANGUAGE: EN
  PLATFORM: x86_64
  PLATFORM_EXCLUSION_GROUP_NAME: "Apple Silicon Mac"
  PLATFORM_EXCLUSION: arm64
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Fiji-x86_64
  PROD_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed-EA-no-users-platform.xml
  EXTENSION_ATTRIBUTE_NAME: FijiVersion
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: does not match regex
  EXTENSION_ATTRIBUTE_VALUE: ^None$|^$
  PREINSTALL_SCRIPT_NAME: "%NAME%-preinstall.zsh"
  PREINSTALL_SCRIPT_PRIORITY: Before
  POSTINSTALL_SCRIPT_NAME: "%NAME%-postinstall.zsh"
  POSTINSTALL_SCRIPT_PRIORITY: After
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-scripts-2.xml

