Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.Fiji-arm64-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-platform-prod-no-users

Input:
  NAME: Fiji
  LANGUAGE: EN
  PLATFORM: arm64
  PLATFORM_EXCLUSION_GROUP_NAME: "Intel Mac"
  PLATFORM_EXCLUSION: x86_64
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Fiji-arm64
  PROD_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed-EA-no-users-platform.xml
  EXTENSION_ATTRIBUTE_NAME: FijiVersion
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: does not match regex
  EXTENSION_ATTRIBUTE_VALUE: ^None$|^$
  PREINSTALL_SCRIPT_NAME: "%NAME%-preinstall.zsh"
  PREINSTALL_SCRIPT_PRIORITY: Before
  POSTINSTALL_SCRIPT_NAME: "%NAME%-postinstall.zsh"
  POSTINSTALL_SCRIPT_PRIORITY: After
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-scripts-2.xml
  USERS_GROUP_NAME: "%NAME% %PLATFORM% users"
  AUTOINSTALL_GROUP_NAME: "%NAME% %PLATFORM% auto-install"
  AUTOUPDATE_GROUP_NAME: "%NAME% %PLATFORM% auto-update"
  PROD_VERSION_INSTALLED_GROUP_NAME: "%NAME% %PLATFORM% current version installed"
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% %PLATFORM% test version installed"
  INSTALLED_GROUP_NAME: "%NAME% %PLATFORM% installed"
  TRIGGER_POLICY_NAME: "Install %NAME% %PLATFORM%"
  AUTOINSTALL_POLICY_NAME: "Auto-install %NAME% %PLATFORM%"
  AUTOUPDATE_POLICY_NAME: "Auto-update %NAME% %PLATFORM%"
  UPDATE_POLICY_NAME: "Update %NAME% %PLATFORM%"
  SELFSERVICE_POLICY_NAME: "%NAME% %PLATFORM%"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %PLATFORM%"
  UPDATE_SELFSERVICE_DISPLAY_NAME: "Update %NAME% %PLATFORM%"
