Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.FileMakerPro-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: FileMaker Pro
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.FileMakerPro
  SELFSERVICE_ICON: FileMaker Pro 2024.png
