Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.Firefox-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: Firefox
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Firefox
  TRIGGER_POLICY_RUN_COMMAND: 'chown -R "$(stat -f%Su /dev/console):staff" "/Applications/%NAME%.app" && echo "Corrected permissions for %NAME%."'
  SELFSERVICE_ICON: Firefox 112.png
