Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.G*Power-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-prod

Input:
  NAME: G*Power
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.G*Power
