Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.Gimp-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod-no-users

Input:
  NAME: GIMP
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Gimp
  PREINSTALL_SCRIPT_NAME: jamf-policy-trigger.sh
  PREINSTALL_SCRIPT_PATH: jamf-policy-trigger.sh
  PREINSTALL_SCRIPT_CATEGORY: Administration
  PREINSTALL_SCRIPT_PRIORITY: Before
  PREINSTALL_SCRIPT_PARAMETER4_LABEL: Trigger name
  PREINSTALL_SCRIPT_PARAMETER4_VALUE: "%NAME%-uninstall"
