Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.GLPIAgent-arm64-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-platform-prod

Input:
  NAME: GLPI-Agent
  PLATFORM_EXCLUSION_GROUP_NAME: "Intel Mac"
  PLATFORM_EXCLUSION: x86_64
  PLATFORM: arm64
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.GLPIAgent-arm64
  EXTENSION_ATTRIBUTE_NAME: GLPI-Agent Version
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: does not match regex
  EXTENSION_ATTRIBUTE_VALUE: ^None$|^$
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-EA.xml
  PROD_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed-EA.xml
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-script.xml
  SCRIPT_NAME: GLPIAgent-uninstall.sh
  SCRIPT_PATH: GLPIAgent-uninstall.sh
  SCRIPT_PRIORITY: Before
  TRIGGER_POLICY_RUN_COMMAND: "jamf policy -event GLPI-Agent-Configure"
  AUTOINSTALL_POLICY_NAME: "Auto-install %NAME% %PLATFORM%"
  AUTOUPDATE_POLICY_NAME: "Auto-update %NAME% %PLATFORM%"
  UPDATE_POLICY_NAME: "Update %NAME% %PLATFORM%"
  SELFSERVICE_POLICY_NAME: "%NAME% %PLATFORM%"
  SELFSERVICE_ICON: "GLPI-Agent.png"
  TRIGGER_NAME: "%NAME%-%PLATFORM%-install"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %PLATFORM%"
  UPDATE_SELFSERVICE_DISPLAY_NAME: "Update %NAME%"
  UPDATE_SELFSERVICE_DESCRIPTION: "%NAME% will be updated to version %version%."
  LAST_RUN_POLICY_NAME: "%NAME% %PLATFORM% (Testing)"