Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.GoogleChrome-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-prod

Input:
  NAME: Google Chrome
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.GoogleChrome
  SELFSERVICE_ICON: Google Chrome 2020.png
  SCRIPT_NAME: GoogleChrome-postinstall.sh
  SCRIPT_PRIORITY: After
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-script.xml
