Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.GPGSuite-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: GPG Suite
  JSS_INVENTORY_NAME: GPG Keychain.app
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.GPGSuite
  SELFSERVICE_ICON: GPG Keychain.png
