Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.GraphicConverter-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod-no-users

Input:
  NAME: GraphicConverter
  MAJOR_VERSION: "12"
  JSS_INVENTORY_NAME: "%NAME% %MAJOR_VERSION%.app"
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.GraphicConverter
  USERS_GROUP_NAME: "%NAME% %MAJOR_VERSION% users"
  AUTOINSTALL_GROUP_NAME: "%NAME% %MAJOR_VERSION% auto-install"
  AUTOUPDATE_GROUP_NAME: "%NAME% %MAJOR_VERSION% auto-update"
  PROD_VERSION_INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% current version installed"
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% test version installed"
  INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% installed"
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-majorversion-no-users.xml
  TRIGGER_POLICY_NAME: "Install %NAME% %MAJOR_VERSION%"
  AUTOINSTALL_POLICY_NAME: "Auto-install %NAME% %MAJOR_VERSION%"
  AUTOUPDATE_POLICY_NAME: "Auto-update %NAME% %MAJOR_VERSION%"
  UPDATE_POLICY_NAME: "Update %NAME% %MAJOR_VERSION%"
  SELFSERVICE_POLICY_NAME: "%NAME% %MAJOR_VERSION%"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %MAJOR_VERSION%"
  UPDATE_SELFSERVICE_DISPLAY_NAME: "Update %NAME% %MAJOR_VERSION%"
  SELFSERVICE_ICON: "%NAME% %MAJOR_VERSION%.png"
  TRIGGER_NAME: "%NAME% %MAJOR_VERSION%-install"

  FORCE_DESCRIPTION: "false"
  ISG_GROUP_NAME: "%NAME% %MAJOR_VERSION% ISG-licensed"
  AUTOINSTALL_GROUP_TEMPLATE: SmartGroup-autoinstall-no-users-ITShop.xml
  AUTOINSTALL_POLICY_TEMPLATE: Policy-prod-autoinstall-ITShop.xml
  SELFSERVICE_POLICY_TEMPLATE: Policy-prod-selfservice-install-ITShop.xml
  SELFSERVICE_POLICY_CATEGORY: "Imaging & Design"
  SCRIPT_NAME_1: "ITShop_license_check.sh"
  SCRIPT_PRIORITY: "After"
  PARAMETER4_VALUE: "GraphicConverter" 
  PARAMETER5_VALUE: "%NAME% %MAJOR_VERSION%-install" 
  PARAMETER6_VALUE: "https://ics.services.jamfcloud.com/icon/hash_e0f53a5b24f1e589794f618269aba01dd9fb68ab010189ca780f75046b00f0ca" 
  PARAMETER7_VALUE: "%MAJOR_VERSION%" 
  PARAMETER8_VALUE: "NO"