Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.HandBrake-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-prod-no-users

Input:
  NAME: HandBrake
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.HandBrake
