Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.IBMSpectrumProtect-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: IBM Spectrum Protect
  LANGUAGE: EN
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.IBMSpectrumProtect
  PREINSTALL_SCRIPT_NAME: IBMSpectrumProtect-preinstall.zsh
  PREINSTALL_SCRIPT_PRIORITY: Before
  POSTINSTALL_SCRIPT_NAME: IBMSpectrumProtect-postinstall.zsh
  POSTINSTALL_SCRIPT_PRIORITY: After
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-scripts-2.xml
  TEST_USERS_GROUP_NAME: "%NAME% %LANGUAGE% test users"
  USERS_GROUP_NAME: "%NAME% %LANGUAGE% users"
  AUTOINSTALL_GROUP_NAME: "%NAME% %LANGUAGE% auto-install"
  AUTOUPDATE_GROUP_NAME: "%NAME% %LANGUAGE% auto-update"
  PROD_VERSION_INSTALLED_GROUP_NAME: "%NAME% %LANGUAGE% current version installed"
  UNTESTED_VERSION_INSTALLED_GROUP_NAME: "%NAME% %LANGUAGE% test version installed"
  INSTALLED_GROUP_NAME: "%NAME% %LANGUAGE% installed"
  TRIGGER_POLICY_NAME: "Install %NAME% %LANGUAGE%"
  AUTOINSTALL_POLICY_NAME: "Auto-install %NAME% %LANGUAGE%"
  AUTOUPDATE_POLICY_NAME: "Auto-update %NAME% %LANGUAGE%"
  UPDATE_POLICY_NAME: "Update %NAME% %LANGUAGE%"
  SELFSERVICE_POLICY_NAME: "%NAME% %LANGUAGE%"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %LANGUAGE%"
  UPDATE_SELFSERVICE_DISPLAY_NAME: "Update %NAME% %LANGUAGE%"
