Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.ilastik-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-prod-no-users

Input:
  NAME: ilastik
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.ilastik
  LAST_RUN_SELFSERVICE_DESCRIPTION:  |
    ilastik is a simple, user-friendly tool for interactive image classification, segmentation and analysis. It is built as a modular software framework, which currently has workflows for automated (supervised) pixel- and object-level classification, automated and semi-automated object tracking, semi-automated segmentation and object counting without detection. 

    Version: %version%
    Category: %PKG_CATEGORY%
  SELFSERVICE_POLICY_TEMPLATE: Policy-prod-selfservice-install-all-computers.xml
  
