Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.Inkscape-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod-no-users

Input:
  NAME: Inkscape
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Inkscape
  TRIGGER_POLICY_RUN_COMMAND: 'chown -R "$(stat -f%Su /dev/console):staff" "/Applications/%NAME%.app" && echo "Corrected permissions for %NAME%."'
  SELFSERVICE_ICON: Inkscape 1.2.png
