Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.JMP-PRO-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: JMP
  MAJOR_VERSION: "17"
  JSS_INVENTORY_NAME: "%NAME% %MAJOR_VERSION%.app"
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.JMP-PRO
  TEST_USERS_GROUP_NAME: "%NAME% %MAJOR_VERSION% test users"
  USERS_GROUP_NAME: "%NAME% %MAJOR_VERSION% users"
  AUTOINSTALL_GROUP_NAME: "%NAME% %MAJOR_VERSION% auto-install"
  AUTOUPDATE_GROUP_NAME: "%NAME% %MAJOR_VERSION% auto-update"
  PROD_VERSION_INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% current version installed"
  UNTESTED_VERSION_INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% test version installed"
  INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% installed"
  TRIGGER_POLICY_NAME: "Install %NAME% %MAJOR_VERSION%"
  AUTOINSTALL_POLICY_NAME: "Auto-install %NAME% %MAJOR_VERSION%"
  AUTOUPDATE_POLICY_NAME: "Auto-update %NAME% %MAJOR_VERSION%"
  UPDATE_POLICY_NAME: "Update %NAME% %MAJOR_VERSION%"
  SELFSERVICE_POLICY_NAME: "%NAME% %MAJOR_VERSION%"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %MAJOR_VERSION%"
  UPDATE_SELFSERVICE_DISPLAY_NAME: "Update %NAME% %MAJOR_VERSION%"
