Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.KeePassXC-arm64-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-platform-prod-no-users

Input:
  NAME: KeePassXC
  PLATFORM: arm64
  PLATFORM_EXCLUSION: x86_64
  PLATFORM_EXCLUSION_GROUP_NAME: "Intel Mac"
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.KeePassXC-arm64
  SCRIPT_NAME: jamf-policy-trigger.sh
  SCRIPT_PRIORITY: Before
  PARAMETER4_VALUE: "%NAME% %PLATFORM%-uninstall"
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-script-parameter4.xml
  SELFSERVICE_ICON: KeePassXC 2.7.png
