Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.KeePassXC-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-prod-no-users

Input:
  NAME: KeePassXC
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.KeePassXC
  SCRIPT_NAME: jamf-policy-trigger.sh
  SCRIPT_PRIORITY: Before
  PARAMETER4_VALUE: "%NAME%-uninstall"
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-script-parameter4.xml
  SELFSERVICE_ICON: KeePassXC 2.7.png
