Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.LogiOptions-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-prod

Input:
  NAME: "Logi Options+"
  TRIGGER_POLICY_NAME: "Install %NAME%"
  SELFSERVICE_DISPLAY_NAME: "Logi Options+"
  JSS_INVENTORY_NAME: "Logi Options+"
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.LogiOptions
  PROD_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed.xml
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed.xml
  TEST_VERSION_INSTALLED_GROUP_NAME: "Logi Options+ test version installed"
