Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.LogitechOptionsPlus-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-prod-no-users-runcommand

Input:
  NAME: "LogitechOptionsPlus"
  JSS_INVENTORY_NAME: "logioptionsplus.app"
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.LogitechOptionsPlus
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-script-parameter4.xml
  SCRIPT_NAME: LogitechOptionsPlus-uninstall.sh
  SCRIPT_PRIORITY: Before
  PARAMETER4_VALUE: "logirrelevantPlus"