Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.LogicProX-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-OS-minimum-prod

Input:
  NAME: Logic Pro X
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.LogicProX
