Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.Mathematica-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: Mathematica
  LANGUAGE: EN
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Mathematica
  JSS_INVENTORY_NAME: "Wolfram.app"
  TRIGGER_POLICY_RUN_COMMAND: jamf policy -event Mathematica-license
  USERS_GROUP_NAME: "%NAME% %LANGUAGE% users"
  AUTOINSTALL_GROUP_NAME: "%NAME% %LANGUAGE% auto-install"
  AUTOUPDATE_GROUP_NAME: "%NAME% %LANGUAGE% auto-update"
  PROD_VERSION_INSTALLED_GROUP_NAME: "%NAME% %LANGUAGE% current version installed"
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% %LANGUAGE% test version installed"
  INSTALLED_GROUP_NAME: "%NAME% %LANGUAGE% installed"
  TRIGGER_POLICY_NAME: "Install %NAME% %LANGUAGE%"
  AUTOINSTALL_POLICY_NAME: "Auto-install %NAME% %LANGUAGE%"
  AUTOUPDATE_POLICY_NAME: "Auto-update %NAME% %LANGUAGE%"
  UPDATE_POLICY_NAME: "Update %NAME% %LANGUAGE%"
  SELFSERVICE_POLICY_NAME: "%NAME% %LANGUAGE%"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %LANGUAGE%"
  UPDATE_SELFSERVICE_DISPLAY_NAME: "Update %NAME% %LANGUAGE%"
