Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftEdge-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: Microsoft Edge
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.MicrosoftEdge
  SELFSERVICE_ICON: Microsoft Edge 100.png
