Description: Creates a Self-Service Policy.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftOffice2019Serializer-prod
ParentRecipe: com.github.eth-its-recipes.jamf.template-2customexclusions-selfservice-prod
MinimumVersion: "2.3"

Input:
  NAME: Microsoft Office 2019 Volume License
  JSS_INVENTORY_NAME: Microsoft Word.app
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.MicrosoftOffice2019Serializer
  INSTALL_BUTTON_TEXT: "Install License"
  REINSTALL_BUTTON_TEXT: "Install License"
  SELFSERVICE_POLICY_CATEGORY: Productivity
  SELFSERVICE_POLICY_MESSAGE_START: "Installing %NAME%"
  SELFSERVICE_POLICY_MESSAGE_FINISH: "%NAME% has now been installed"
  SELFSERVICE_POLICY_RUN_COMMAND: "jamf policy -event '%TRIGGER_NAME%'"
  SELFSERVICE_ICON: "Microsoft Office 365.png"
  TRIGGER_POLICY_NAME: "Install %NAME% Serializer"
  TRIGGER_NAME: MSOffice2019-volumelicense
  USERS_GROUP_NAME: "Microsoft Office 2019 users"
  TEST_USERS_GROUP_NAME: "Microsoft Office 2019 test users"
  EXCLUSION1_GROUP_NAME: "Microsoft Office 2019 installed"
  EXCLUSION1_GROUP_TEMPLATE: SmartGroup-exclusion-EA.xml
  EXCLUSION2_GROUP_NAME: "Microsoft Office not installed"
  EXCLUSION2_GROUP_TEMPLATE: SmartGroup-not-installed.xml
  EXTENSION_ATTRIBUTE_NAME: Microsoft Office License Type
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: matches regex
  EXTENSION_ATTRIBUTE_VALUE: "2019"
