Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftTeamsWorkOrSchool-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-prod

Input:
  NAME: Microsoft Teams (work or school)
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.MicrosoftTeamsWorkOrSchool
  SELFSERVICE_ICON: Microsoft Teams 5.png
