Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftWindowsApp-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-prod

Input:
  NAME: Windows App
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.MicrosoftWindowsApp
  SELFSERVICE_ICON: WindowsApp.png
