Description: Creates a Self-Service Policy.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftOutlookDataRemoval-prod
ParentRecipe: com.github.eth-its-recipes.jamf.template-noexclusions-selfservice-only-prod
MinimumVersion: "2.3"

Input:
  NAME: Microsoft Outlook Data Removal
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.MicrosoftOutlookDataRemoval
  INSTALL_BUTTON_TEXT: "Delete all email!"
  REINSTALL_BUTTON_TEXT: "Delete all email!"
  SELFSERVICE_POLICY_CATEGORY: Tools & Accessories
  SELFSERVICE_POLICY_MESSAGE_START: "Removing all data from Microsoft Outlook"
  SELFSERVICE_POLICY_MESSAGE_FINISH: "Removed all data from Microsoft Outlook"
  SELFSERVICE_ICON: "Microsoft Outlook Reset.png"
  TRIGGER_NAME: Run-MicrosoftOutlookDataRemoval
