Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftTeams-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-prod-no-users

Input:
  NAME: Microsoft Teams
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.MicrosoftTeams
  APPLICATION_NAME_HAS: Microsoft Teams
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-has-no-users.xml
  PROD_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed-has-no-users.xml
  SELFSERVICE_ICON: Microsoft Teams 5.png
