Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.MindManager-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: MindManager
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.MindManager
  SCRIPT_NAME: "%NAME%-postinstall.sh"
  SCRIPT_PRIORITY: After
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-script.xml
