Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.miniconda-arm64-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-platform-prod-no-users

Input:
  NAME: miniconda
  PLATFORM: arm64
  PLATFORM_EXCLUSION_GROUP_NAME: "Intel Mac"
  PLATFORM_EXCLUSION: x86_64
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.miniconda-arm64
  PROD_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed-EA-no-users-platform.xml
  EXTENSION_ATTRIBUTE_NAME: minicondaVersion
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: does not match regex
  EXTENSION_ATTRIBUTE_VALUE: ^None$|^$
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-no-users-EA-platform.xml
  