Description: |
  Creates all production policies for a particular title.

  The following Input must be overridden:
  - SERVER_ID_STRING (e.g. 123.145.167.89 001122334455 6677)
Identifier: com.github.eth-its-recipes.jamf.MOE-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-noupdate-prod

Input:
  NAME: MOE
  LANGUAGE: EN
  MAJOR_VERSION: "2022.02"
  TRIGGER_NAME: "%NAME% %MAJOR_VERSION%-install"
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.MOE
  PREINSTALL_SCRIPT_NAME: jamf-policy-trigger.sh
  PREINSTALL_SCRIPT_PRIORITY: Before
  PREINSTALL_SCRIPT_PARAMETER4_VALUE: XQuartz-install
  POSTINSTALL_SCRIPT_NAME: MOE-postinstall.zsh
  POSTINSTALL_SCRIPT_PRIORITY: After
  POSTINSTALL_SCRIPT_PARAMETER4_VALUE: "%MAJOR_VERSION%"
  POSTINSTALL_SCRIPT_PARAMETER5_VALUE: "%SERVER_ID_STRING%"
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-scripts-2-parameter4and5.xml
  TEST_USERS_GROUP_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% test users"
  USERS_GROUP_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% users"
  AUTOINSTALL_GROUP_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% auto-install"
  INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% installed"
  TRIGGER_POLICY_NAME: "Install %NAME% %MAJOR_VERSION% %LANGUAGE%"
  AUTOINSTALL_POLICY_NAME: "Auto-install %NAME% %MAJOR_VERSION% %LANGUAGE%"
  SELFSERVICE_POLICY_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE%"
  SELFSERVICE_POLICY_TEMPLATE: Policy-prod-selfservice-install-forcedescription.xml
  SELFSERVICE_DISPLAY_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE%"
  SELFSERVICE_ICON: MOE 2019.png
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-majorversion.xml
