Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.NiceUpdater2-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: macOS Managed Updates
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.NiceUpdater2
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-script-parameters-all.xml
  EXTENSION_ATTRIBUTE_NAME: macOS Managed Updates Tool Version
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: does not match regex
  EXTENSION_ATTRIBUTE_VALUE: ^None$|^$
  SCRIPT_NAME: "%NAME%-postinstall.sh"
  SCRIPT_PRIORITY: After
  PARAMETER4_LABEL: Start hr 0-23
  PARAMETER5_LABEL: Start min 0-59
  PARAMETER6_LABEL: Alert timeout sec
  PARAMETER7_LABEL: Max deferrals
  PARAMETER8_LABEL: Days wait after no updates
  PARAMETER9_LABEL: Days wait after update
  PARAMETER10_LABEL: Custom icon path
  PARAMETER11_LABEL: Parameter 11
  PARAMETER4_VALUE: "13"
  PARAMETER5_VALUE: "00"
  PARAMETER6_VALUE: "3540"
  PARAMETER7_VALUE: "7"
  PARAMETER8_VALUE: "3"
  PARAMETER9_VALUE: "3"
  PARAMETER10_VALUE: /Applications/ETH Self Service.app
  PARAMETER11_VALUE: ""
  SELFSERVICE_ICON: Software Update 2022.png
  PROD_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed-EA.xml
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-EA.xml
