Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.OmnissaHorizonClient-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod-no-users

Input:
  NAME: Omnissa Horizon Client
  LANGUAGE: EN
  JSS_INVENTORY_NAME_2: "VMware Horizon Client.app"
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.OmnissaHorizonClient
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-no-users-twonames-or.xml
  POSTINSTALL_SCRIPT_NAME: OmnissaHorizonClient-postinstall.zsh
  POSTINSTALL_SCRIPT_PRIORITY: After
  POSTINSTALL_SCRIPT_PARAMETER4_VALUE: ""
  PREINSTALL_SCRIPT_NAME: jamf-policy-trigger.sh
  PREINSTALL_SCRIPT_PRIORITY: Before
  PREINSTALL_SCRIPT_PARAMETER4_VALUE: "VMWareHorizonClient-uninstall"
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-scripts-2-parameter4.xml
  SELFSERVICE_ICON: "%NAME%.png"