Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.OmnissaHorizonClient-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-prod-no-users

Input:
  NAME: Omnissa Horizon Client
  LANGUAGE: EN
  JSS_INVENTORY_NAME_2: "VMware Horizon Client.app"
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.OmnissaHorizonClient
  USERS_GROUP_NAME: "%NAME% %LANGUAGE% users"
  AUTOINSTALL_GROUP_NAME: "%NAME% %LANGUAGE% auto-install"
  AUTOUPDATE_EXCLUDED_GROUP_NAME: "%NAME% %LANGUAGE% auto-update excluded"
  PROD_VERSION_INSTALLED_GROUP_NAME: "%NAME% %LANGUAGE% current version installed"
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% %LANGUAGE% test version installed"
  INSTALLED_GROUP_NAME: "%NAME% %LANGUAGE% installed"
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-no-users-twonames.xml
  TRIGGER_POLICY_NAME: "Install %NAME% %LANGUAGE%"
  AUTOINSTALL_POLICY_NAME: "Auto-install %NAME% %LANGUAGE%"
  AUTOUPDATE_POLICY_NAME: "Auto-update %NAME% %LANGUAGE%"
  UPDATE_POLICY_NAME: "Update %NAME% %LANGUAGE%"
  SELFSERVICE_POLICY_NAME: "%NAME% %LANGUAGE%"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %LANGUAGE%"
  UPDATE_SELFSERVICE_DISPLAY_NAME: "Update %NAME% %LANGUAGE%"
  SELFSERVICE_ICON: "%NAME%.png"
  SCRIPT_NAME: OmnissaHorizonClient-postinstall.zsh
  SCRIPT_PRIORITY: After
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-script.xml
