Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.OxygenXMLEditor-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-prod-no-users

Input:
  NAME: Oxygen XML Editor
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.OxygenXMLEditor
  APPLICATION_NAME_HAS: "Oxygen XML Editor"
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-has-no-users.xml
  PROD_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed-has-no-users.xml
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly.xml
  SELFSERVICE_ICON: OxygenXMLEditor.png
  SELFSERVICE_POLICY_TEMPLATE: Policy-prod-selfservice-install-all-computers-forcedescription.xml