Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.ParallelsDesktop-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: Parallels Desktop
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.ParallelsDesktop
  SELFSERVICE_POLICY_TEMPLATE: Policy-prod-selfservice-install-forcedescription.xml
