Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.PopChar-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-prod-no-users

Input:
  NAME: PopChar
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.PopChar
  TRIGGER_POLICY_RUN_COMMAND: "jamf policy -event 'PopChar License-install'"
  SELFSERVICE_ICON: PopChar 8.png

  FORCE_DESCRIPTION: "false"
  ISG_GROUP_NAME: "%NAME% ISG-licensed"
  AUTOINSTALL_GROUP_TEMPLATE: SmartGroup-autoinstall-no-users-ITShop.xml
  AUTOINSTALL_POLICY_TEMPLATE: Policy-prod-autoinstall-ITShop.xml
  SELFSERVICE_POLICY_TEMPLATE: Policy-prod-selfservice-install-ITShop.xml
  SELFSERVICE_POLICY_CATEGORY: "Tools & Accessories"
  SCRIPT_NAME_1: "ITShop_license_check.sh"
  SCRIPT_PRIORITY: "After"
  PARAMETER4_VALUE: "PopChar" 
  PARAMETER5_VALUE: "%NAME%-install" 
  PARAMETER6_VALUE: "https://ics.services.jamfcloud.com/icon/hash_795d9be3520166a9a8743831708667cc571621c862cc421a9b73daf3c8380c65" 
  PARAMETER7_VALUE: "NONE" 
  PARAMETER8_VALUE: "NO"

