Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.PopChar-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: PopChar
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.PopChar
  TRIGGER_POLICY_RUN_COMMAND: "jamf policy -event 'PopChar License-install'"
  SELFSERVICE_ICON: PopChar 8.png
