Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.Prism-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-prod-no-users

Input:
  NAME: Prism
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Prism
  SELFSERVICE_ICON: "Prism 9.png"
  SCRIPT_NAME: "%NAME%-postinstall.sh"
  SCRIPT_PATH: "%NAME%-postinstall.sh"
  SCRIPT_PRIORITY: After
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-script.xml
  SELFSERVICE_POLICY_TEMPLATE: Policy-prod-selfservice-install-forcedescription.xml