Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.Prism-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: Prism
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Prism
  SELFSERVICE_ICON: "Prism 9.png"
  SELFSERVICE_POLICY_TEMPLATE: Policy-prod-selfservice-install-forcedescription.xml