Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.Privileges-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-prod

Input:
  NAME: Privileges
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Privileges
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-script-dockitem.xml
  SCRIPT_NAME: "Privileges-preinstall.sh"
  SCRIPT_PATH: "Privileges-preinstall.sh"
  SCRIPT_PRIORITY: Before
  SCRIPT_CATEGORY: "Tools & Accessories"
  SELFSERVICE_ICON: "Privileges2.png"
  DOCK_ITEM_NAME: Privileges
  DOCK_ITEM_ACTION: Add To End
  TRIGGER_POLICY_RUN_COMMAND: sudo -u "$(stat -f%Su /dev/console)" "/Applications/Privileges.app/Contents/MacOS/PrivilegesCLI" -r
