Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.PyCharmCE-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-prod-no-users

Input:
  NAME: PyCharm CE
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.PyCharmCE
  JSS_INVENTORY_NAME: "%NAME%.app"
  VERSION_STRING_TYPE: CFBundleVersion
  PROD_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed-no-users.xml
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-no-users.xml