Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.PyCharm-arm64-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-platform-prod-no-users

Input:
  NAME: PyCharm
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.PyCharm-arm64
  JSS_INVENTORY_NAME: "%NAME%.app"
  VERSION_STRING_TYPE: CFBundleVersion
  PLATFORM: arm64
  PLATFORM_EXCLUSION: x86_64
  PLATFORM_EXCLUSION_GROUP_NAME: "Intel Mac"