Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.PyMOL-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-prod-no-users

Input:
  NAME: PyMOL
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.PyMOL
  TRIGGER_POLICY_RUN_COMMAND: "jamf policy -event 'PyMOL License-install'"

  FORCE_DESCRIPTION: "false"
  AUTOINSTALL_POLICY_TEMPLATE: Policy-prod-autoinstall-ITShop.xml
  SELFSERVICE_POLICY_TEMPLATE: Policy-prod-selfservice-install-ITShop.xml
  SELFSERVICE_POLICY_CATEGORY: "Tools & Accessories"
  SCRIPT_NAME_1: "ITShop_license_check.sh"
  SCRIPT_PRIORITY: "After"
  PARAMETER4_VALUE: "PyMOL" 
  PARAMETER5_VALUE: "%NAME%-install" 
  PARAMETER6_VALUE: "https://ics.services.jamfcloud.com/icon/hash_c6bc960d36a53e49123af80d61449b0a76fe104d3408ead0389272766e79c472" 
  PARAMETER7_VALUE: "NONE" 
  PARAMETER8_VALUE: "NO"