Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.PyMOL-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: PyMOL
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.PyMOL
  TRIGGER_POLICY_RUN_COMMAND: "jamf policy -event 'PyMOL License-install'"
