Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.R-x86_64-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-platform-prod-no-users

Input:
  NAME: R
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.R-x86_64
  PLATFORM: x86_64
  PROD_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed-EA-no-users-platform.xml
  EXTENSION_ATTRIBUTE_NAME: R Version
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: does not match regex
  EXTENSION_ATTRIBUTE_VALUE: ^None$|^$
  PREINSTALL_SCRIPT_NAME: R-preinstall.sh
  PREINSTALL_SCRIPT_PATH: R-preinstall.sh
  PREINSTALL_SCRIPT_PRIORITY: Before
  POSTINSTALL_SCRIPT_NAME: R-postinstall.sh
  POSTINSTALL_SCRIPT_PATH: R-postinstall.sh
  POSTINSTALL_SCRIPT_PRIORITY: After
  POSTINSTALL_SCRIPT_PARAMETER4_VALUE: "None"
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-scripts-2-parameter4.xml