Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.RStudio-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod-no-users

Input:
  NAME: RStudio
  LANGUAGE: EN
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.RStudio
  AUTOINSTALL_GROUP_NAME: "%NAME% %LANGUAGE% auto-install"
  AUTOUPDATE_GROUP_NAME: "%NAME% %LANGUAGE% auto-update"
  PROD_VERSION_INSTALLED_GROUP_NAME: "%NAME% %LANGUAGE% current version installed"
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% %LANGUAGE% test version installed"
  INSTALLED_GROUP_NAME: "%NAME% %LANGUAGE% installed"
  TRIGGER_POLICY_NAME: "Install %NAME% %LANGUAGE%"
  AUTOINSTALL_POLICY_NAME: "Auto-install %NAME% %LANGUAGE%"
  AUTOUPDATE_POLICY_NAME: "Auto-update %NAME% %LANGUAGE%"
  UPDATE_POLICY_NAME: "Update %NAME% %LANGUAGE%"
  SELFSERVICE_POLICY_NAME: "%NAME% %LANGUAGE%"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %LANGUAGE%"
  UPDATE_SELFSERVICE_DISPLAY_NAME: "Update %NAME% %LANGUAGE%"
  SELFSERVICE_POLICY_TEMPLATE: Policy-prod-selfservice-install-all-computers-forcedescription.xml
  SELFSERVICE_ICON: "%NAME% 2021.png"
