Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.silnite-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-prod

Input:
  NAME: silnite
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.silnite
  SCRIPT_NAME: "%NAME%-postinstall.zsh"
  SCRIPT_PRIORITY: After
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-script.xml
  SELFSERVICE_ICON: Terminal.png
  EXTENSION_ATTRIBUTE_NAME: silnite Version
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: does not match regex
  EXTENSION_ATTRIBUTE_VALUE: ^None$|^$
  PROD_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed-EA.xml
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-EA.xml
