Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.Skim-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-prod-no-users

Input:
  NAME: Skim
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Skim
  SELFSERVICE_ICON: Skim 1.6.png
