Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.SnapGene-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: SnapGene
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.SnapGene
  LAST_RUN_SELFSERVICE_DESCRIPTION:  |
    The Industry's Most Popular Molecular Cloning Tool 

    Version: %version%
    Category: %PKG_CATEGORY%
