Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.SnapGene-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-prod-no-users

Input:
  NAME: SnapGene
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.SnapGene
  LAST_RUN_SELFSERVICE_DESCRIPTION:  |
    The Industry's Most Popular Molecular Cloning Tool 

    This version of Snapgene comes deactivated. Please see the [description](https://unlimited.ethz.ch/display/biolopen/Snapgene) for the
    activation process.

    Version: %version%
    Category: %PKG_CATEGORY%
  SELFSERVICE_POLICY_TEMPLATE: Policy-prod-selfservice-install-all-computers-forcedescription.xml
  
