Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.StataSE-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod-no-users

Input:
  NAME: StataSE
  MAJOR_VERSION: "19"
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.StataSE
  USERS_GROUP_NAME: "%NAME% %MAJOR_VERSION% users"
  AUTOINSTALL_GROUP_NAME: "%NAME% %MAJOR_VERSION% auto-install"
  AUTOUPDATE_GROUP_NAME: "%NAME% %MAJOR_VERSION% auto-update"
  PROD_VERSION_INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% current version installed"
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% test version installed"
  INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% installed"
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-majorversion-no-users.xml
  TRIGGER_POLICY_NAME: "Install %NAME% %MAJOR_VERSION%"
  AUTOINSTALL_POLICY_NAME: "Auto-install %NAME% %MAJOR_VERSION%"
  AUTOUPDATE_POLICY_NAME: "Auto-update %NAME% %MAJOR_VERSION%"
  UPDATE_POLICY_NAME: "Update %NAME% %MAJOR_VERSION%"
  SELFSERVICE_POLICY_NAME: "%NAME% %MAJOR_VERSION%"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %MAJOR_VERSION%"
  UPDATE_SELFSERVICE_DISPLAY_NAME: "Update %NAME% %MAJOR_VERSION%"
  SELFSERVICE_ICON: "%NAME% %MAJOR_VERSION%.png"
  TRIGGER_NAME: "%NAME% %MAJOR_VERSION%-install"

  FORCE_DESCRIPTION: "false"
  AUTOINSTALL_POLICY_TEMPLATE: Policy-prod-autoinstall-ITShop.xml
  SELFSERVICE_POLICY_TEMPLATE: Policy-prod-selfservice-install-ITShop.xml
  SELFSERVICE_POLICY_CATEGORY: "Science & Math"
  SCRIPT_NAME_1: "ITShop_license_check.sh"
  SCRIPT_PRIORITY: "After"
  PARAMETER4_VALUE: "PyMOL" 
  PARAMETER5_VALUE: "%NAME%-install" 
  PARAMETER6_VALUE: "https://ics.services.jamfcloud.com/icon/hash_28c520d3f0d533eab6fd09a2dae89378428078a6f1130fe8f9bf2440e56902f6" 
  PARAMETER7_VALUE: "NONE" 
  PARAMETER8_VALUE: "NO"
