Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.Support-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-OS-minimum-prod

Input:
  NAME: Support
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Support
  minimum_os_version: "11.0"
  SELFSERVICE_ICON: "ETH.png"
  TRIGGER_POLICY_RUN_COMMAND: "jamf policy -event 'Support App Customisation-install'; jamf policy -event 'SupportHelper-install'"
