Description: Creates all production policies for a particular title.
Comment: this policy does not need to be staged; this recipe is only for reporting purposes
Identifier: com.github.eth-its-recipes.jamf.SupportAppCustomisation-v2-prod
MinimumVersion: "2.3"

Input:
  NAME: Support App Customisation v2
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.SupportAppCustomisation-v2
  TRIGGER_POLICY_NAME: "%NAME%"
  PKG_CATEGORY: Tools & Accessories
  TRIGGER_POLICY_CATEGORY: Triggered Installers
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-script-nonotification.xml
  TRIGGER_NAME: "%NAME%-install"
  TRIGGER_POLICY_RUN_COMMAND: "echo 'Installation of %NAME% complete' & killall Support"
  SCRIPT_NAME: "SupportAppCustomisation"
  SCRIPT_PATH: "SupportAppCustomisation-preinstall.zsh"
  SCRIPT_PRIORITY: After
  SCRIPT_CATEGORY: Administration
  PROD_PREDICATE: "ready_to_stage == False"


Process:
  - Processor: com.github.grahampugh.recipes.preprocessors/LastRecipeRunChecker
    Arguments:
      recipeoverride_identifier: "%UNTESTED_RECIPE_IDENTIFIER%"

  - Processor: com.github.eth-its-recipes.processors/JamfUploadSharepointStageCheck

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%PROD_PREDICATE%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%TRIGGER_POLICY_TEMPLATE%"
      policy_name: "%TRIGGER_POLICY_NAME%"
      replace_policy: "False"
