Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.swiftDialog-prod
MinimumVersion: "2.3"

Input:
  NAME: swiftDialog
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.swiftDialog
  PKG_CATEGORY: Tools & Utilities
  TRIGGER_NAME: "swiftDialog-install"
  TRIGGER_POLICY_NAME: "Install %NAME%"
  TRIGGER_POLICY_CATEGORY: Triggered Installers
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-nonotification.xml
  TRIGGER_POLICY_RUN_COMMAND: "echo 'Installation of %NAME% complete'"
  SELFSERVICE_POLICY_NAME: swiftDialog
  PROD_PREDICATE: "ready_to_stage == False"
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% test version installed"

Process:
  - Processor: com.github.grahampugh.recipes.preprocessors/LastRecipeRunChecker
    Arguments:
      recipeoverride_identifier: "%UNTESTED_RECIPE_IDENTIFIER%"

  - Processor: com.github.eth-its-recipes.processors/JamfUploadSharepointStageCheck

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%PROD_PREDICATE%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%TRIGGER_POLICY_TEMPLATE%"
      policy_name: "%TRIGGER_POLICY_NAME%"
      replace_policy: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyDeleter
    Comment: Delete the untested policy
    Arguments:
      policy_name: "%LAST_RUN_POLICY_NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupDeleter
    Comment: Delete the test version installed group
    Arguments:
      computergroup_name: "%TEST_VERSION_INSTALLED_GROUP_NAME%"