Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.swiftDialog-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: swiftDialog
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.swiftDialog
  EXTENSION_ATTRIBUTE_NAME: swiftDialog Version
  EXTENSION_ATTRIBUTE_SCRIPT: swiftDialog-EA.zsh
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: does not match regex
  EXTENSION_ATTRIBUTE_VALUE: "^None$"
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-EA.xml
  PROD_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed-EA.xml
