Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.TeamViewerQS-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-prod

Input:
  NAME: TeamViewerQS
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.TeamViewerQS
  SELFSERVICE_ICON: TeamViewer 15.png
