Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.TeamViewer-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: TeamViewer
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.TeamViewer
  SCRIPT_NAME: "%NAME%-preinstall.sh"
  SCRIPT_PRIORITY: Before
  SELFSERVICE_ICON: TeamViewer 15.41.png
