Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.texmaker-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-platform-prod-no-users

Input:
  NAME: texmaker
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.texmaker
  SELFSERVICE_ICON: texmaker 5.png
  TRIGGER_POLICY_NAME: "Install %NAME%"
  AUTOINSTALL_POLICY_NAME: "Auto-install %NAME%"
  AUTOUPDATE_POLICY_NAME: "Auto-update %NAME%"
  UPDATE_POLICY_NAME: "Update %NAME%"
  SELFSERVICE_POLICY_NAME: "%NAME%"
  TRIGGER_NAME: "%NAME% %PLATFORM%-install"
  SELFSERVICE_DISPLAY_NAME: "%NAME%"
  UPDATE_SELFSERVICE_DISPLAY_NAME: "Update %NAME%"