Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.texmaker-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-prod

Input:
  NAME: texmaker
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.texmaker
  SELFSERVICE_ICON: texmaker 5.png
