Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.ThreemaWork-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-prod-no-users

Input:
  NAME: Threema Work
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.ThreemaWork
  TRIGGER_POLICY_RUN_COMMAND: 'chown -R "$(stat -f%Su /dev/console):staff" "/Applications/%NAME%.app" && echo "Corrected permissions for %NAME%."'
