Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.TorBrowser-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-prod

Input:
  NAME: Tor Browser
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.TorBrowser
