Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.Webex-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-prod

Input:
  NAME: Webex
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Webex
  SELFSERVICE_ICON: Webex 41.png
