Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.XQuartz-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-OS-exclude-max-prod

Input:
  NAME: XQuartz
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.XQuartz
