Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.Zoom-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-prod-no-users

Input:
  NAME: Zoom Client
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Zoom
  EXTENSION_ATTRIBUTE_NAME: Zoom Version
  EXTENSION_ATTRIBUTE_SCRIPT: VersionStringOverride-EA.sh
  JSS_INVENTORY_NAME: zoom.us.app
  VERSION_STRING_TYPE: CFBundleVersion
  PROD_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed-EA-no-users.xml
  SELFSERVICE_ICON: zoom.us 5.png
