Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.Zotero-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-prod-no-users

Input:
  NAME: Zotero
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Zotero
  TRIGGER_POLICY_RUN_COMMAND: 'chown -R "$(stat -f%Su /dev/console):staff" "/Applications/%NAME%.app" && echo "Corrected permissions for %NAME%."'
