Description: |
  Creates or updates an account based on a template. Note that LDAP Groups cannot be created, only updated.

  The following must be put in an override:
  - NAME
  - DOMAIN
  - EMAIL

Identifier: com.github.eth-its-recipes.jamf.account.StandardLDAPGroup
MinimumVersion: "2.3"

Input:
  ACCOUNT_TYPE: user
  ACCOUNT_TEMPLATE: Account-user-AutoPkg.xml

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfAccountUploader
    Arguments:
      account_name: "%NAME%"
      account_type: "%ACCOUNT_TYPE%"
      account_template: "%ACCOUNT_TEMPLATE%"
      replace_account: "True"
