Description: |
  Uploads a computer configuration to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.CiscoSecureClient-settings-profile
MinimumVersion: "2.3"

Input:
  NAME: Cisco Secure Client
  PROFILE_CATEGORY: System Extensions
  PROFILE_TEMPLATE: Profile-all-computers.xml
  PROFILE_NAME: Cisco Secure Client - Socket Filter
  PROFILE_DESCRIPTION: Settings that allow the Cisco Secure Client application to function.
  ORGANIZATION: "%NAME%"
  PROFILE_MOBILECONFIG: CiscoSecureClient-SystemExtension.mobileconfig
  REPLACE_PROFILE: "True"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%PROFILE_CATEGORY%"
      replace_category: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerProfileUploader
    Arguments:
      profile_name: "%PROFILE_NAME%"
      profile_category: "%PROFILE_CATEGORY%"
      profile_template: "%PROFILE_TEMPLATE%"
      mobileconfig: "%PROFILE_MOBILECONFIG%"
      profile_computergroup: "%USERS_GROUP_NAME%"
      replace_profile: "%REPLACE_PROFILE%"
