Description: |
  Uploads a computer configuration to the Jamf Pro Server and creates a Self Service Policy and Smart Group.

  Requires the "Dell Display And Peripheral Manager users" group and the relevant category to have already been created.
Identifier: com.github.eth-its-recipes.jamf.DellDisplayAndPeripheralManager-PPPC-profile
MinimumVersion: "2.3"

Input:
  NAME: Dell Display And Peripheral Manager
  GROUP_NAME: "%NAME% users"
  PROFILE_CATEGORY: "Privacy Settings"
  PROFILE_TEMPLATE: Profile-1-group.xml
  PROFILE_NAME: Dell Display And Peripheral Manager Privacy Settings
  PROFILE_DESCRIPTION: Manages Accessibility settings for the Dell Display and Peripheral Manager
  ORGANIZATION: "%NAME%"
  PROFILE_MOBILECONFIG: DellDisplayAndPeripheralManager-PPPC.mobileconfig
  USERS_GROUP_NAME: "%NAME% users"
  USERS_GROUP_TEMPLATE: SmartGroup-users.xml
  TEST_USERS_GROUP_NAME: "%NAME% test users"
  TEST_USERS_GROUP_TEMPLATE: SmartGroup-test-users.xml
  REPLACE_PROFILE: "True"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%PROFILE_CATEGORY%"
      replace_category: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%TEST_USERS_GROUP_TEMPLATE%"
      computergroup_name: "%TEST_USERS_GROUP_NAME%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%USERS_GROUP_TEMPLATE%"
      computergroup_name: "%USERS_GROUP_NAME%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerProfileUploader
    Arguments:
      profile_name: "%PROFILE_NAME%"
      profile_category: "%PROFILE_CATEGORY%"
      profile_template: "%PROFILE_TEMPLATE%"
      mobileconfig: "%PROFILE_MOBILECONFIG%"
      profile_computergroup: "%GROUP_NAME%"
      replace_profile: "%REPLACE_PROFILE%"
