Description: |
  Uploads a computer configuration to the Jamf Pro Server and creates a Smart Group.

  Required overrides:
  - ORGANIZATION
  - SERIAL (this is the license key)
Identifier: com.github.eth-its-recipes.jamf.GraphicConverter12-settings-profile
MinimumVersion: "2.3"

Input:
  NAME: GraphicConverter
  MAJOR_VERSION: "12"
  IDENTIFIER: com.lemkesoft.graphicconverter12
  PROFILE_CATEGORY: Application Settings
  PROFILE_TEMPLATE: Profile-1-group.xml
  PROFILE_NAME: "%NAME% %MAJOR_VERSION%"
  PROFILE_PAYLOAD: "%IDENTIFIER%.plist"
  PROFILE_DESCRIPTION: Licenses GraphicConverter %MAJOR_VERSION%.
  INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% installed"

  REPLACE_PROFILE: "True"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%PROFILE_CATEGORY%"
      replace_category: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerProfileUploader
    Arguments:
      profile_name: "%PROFILE_NAME%"
      profile_category: "%PROFILE_CATEGORY%"
      profile_template: "%PROFILE_TEMPLATE%"
      payload: "%PROFILE_PAYLOAD%"
      identifier: "%IDENTIFIER%"
      organization: "%ORGANIZATION%"
      profile_description: "%PROFILE_DESCRIPTION%"
      profile_computergroup: "%INSTALLED_GROUP_NAME%"
      replace_profile: "%REPLACE_PROFILE%"
