Description: Uploads a computer configuration to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.PPPCJamfAppleEvents-profile
MinimumVersion: "2.3"

Input:
  NAME: Jamf Pro Privacy Settings
  PROFILE_GROUP_TEMPLATE: SmartGroup-installed.xml
  PROFILE_CATEGORY: "Privacy Preferences"
  PROFILE_TEMPLATE: Profile-all-computers.xml
  PROFILE_NAME: "%NAME%"
  PROFILE_DESCRIPTION: Full disk access for Jamf Pro.
  PROFILE_MOBILECONFIG: JamfProPrivacySettings.mobileconfig

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%PROFILE_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerProfileUploader
    Arguments:
      profile_name: "%PROFILE_NAME%"
      profile_category: "%PROFILE_CATEGORY%"
      profile_template: "%PROFILE_TEMPLATE%"
      mobileconfig: "%PROFILE_MOBILECONFIG%"
      replace_profile: "True"
