Description: Uploads a computer configuration to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.swiftdialog-notifications-profile
MinimumVersion: "2.3"

Input:
  NAME: mac.ethOS - swiftDialog Notification Settings
  IDENTIFIER: au.csiro.dialog
  ORGANIZATION: ETH Zürich
  PROFILE_CATEGORY: Application Settings
  PROFILE_DESCRIPTION: Settings for swiftDialog notifications
  PROFILE_NAME: "%NAME%"
  PROFILE_TEMPLATE: Profile-all-computers.xml
  REPLACE_PROFILE: "True"
  PROFILE_MOBILECONFIG: swiftDialog-notifications.mobileconfig

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%PROFILE_CATEGORY%"
      replace_category: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerProfileUploader
    Arguments:
      profile_name: "%PROFILE_NAME%"
      profile_category: "%PROFILE_CATEGORY%"
      profile_template: "%PROFILE_TEMPLATE%"
      mobileconfig: "%PROFILE_MOBILECONFIG%"
      profile_computergroup: "%GROUP_NAME%"
      replace_profile: "%REPLACE_PROFILE%"