Description: Uploads a computer configuration to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.macethOS-MicrosoftOutlook-settings-new-profile
MinimumVersion: "2.3"

Input:
  NAME: mac.ethOS - Microsoft Outlook Settings
  IDENTIFIER: com.microsoft.outlook
  ORGANIZATION: ETH Zürich
  PROFILE_CATEGORY: Application Settings
  PROFILE_DESCRIPTION: Settings for Microsoft Outlook
  PROFILE_NAME: "%NAME%"
  PROFILE_PAYLOAD: com.microsoft.outlook-ethos.plist
  PROFILE_TEMPLATE: Profile-MicrosoftOffice.xml
  REPLACE_PROFILE: "True"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%PROFILE_CATEGORY%"
      replace_category: "False"

  - Processor: com.github.grahampugh.recipes.commonprocessors/CreatePlist
    Arguments:
      output_file_name: "%NAME%"
      plist_content:
        EnableNewOutlook: 1
        HideCanAddOtherAccountTypesTipText: True
        TrustO365AutodiscoverRedirect: True
        DisableDefaultAppSignature: True
        AutomaticallyDownloadExternalContent: 1

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerProfileUploader
    Arguments:
      identifier: "%IDENTIFIER%"
      profile_name: "%output_file_name%"
      payload: "%plist_path%"
      profile_category: "%PROFILE_CATEGORY%"
      profile_template: "%PROFILE_TEMPLATE%"
      organization: "%ORGANIZATION%"
      profile_description: "%PROFILE_DESCRIPTION%"
      replace_profile: "%REPLACE_PROFILE%"
