Description: |
  Uploads a computer configuration to the Jamf Pro Server and creates a Self Service Policy and Smart Group.

  Requires the "Support users" group to have already been created.
Identifier: com.github.eth-its-recipes.jamf.Support-profile
MinimumVersion: "2.3"

Input:
  NAME: ETH Support App v2
  IDENTIFIER: nl.root3.support
  ORGANIZATION: ETH Zürich
  GROUP_NAME: "%NAME% users"
  USERS_GROUP_NAME: "%GROUP_NAME%"
  USERS_GROUP_TEMPLATE: SmartGroup-users.xml
  PROFILE_CATEGORY: Application Settings
  PROFILE_TEMPLATE: Profile-1-group.xml
  PROFILE_NAME: Support App Settings v2
  PROFILE_PAYLOAD: "nl.root3.support_v2.plist"
  PROFILE_DESCRIPTION: This profile supplies the ETH-specific basic settings for the Support menu bar application.
  REPLACE_PROFILE: "True"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%USERS_GROUP_TEMPLATE%"
      computergroup_name: "%GROUP_NAME%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%PROFILE_CATEGORY%"
      replace_category: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerProfileUploader
    Arguments:
      profile_name: "%PROFILE_NAME%"
      profile_category: "%PROFILE_CATEGORY%"
      profile_template: "%PROFILE_TEMPLATE%"
      payload: "%PROFILE_PAYLOAD%"
      identifier: "%IDENTIFIER%"
      organization: "%ORGANIZATION%"
      profile_description: "%PROFILE_DESCRIPTION%"
      computergroup_name: "%GROUP_NAME%"
      replace_profile: "%REPLACE_PROFILE%"
