Description: |
  Creates a trigger-only policy to install the Messus Agent license by running the postinstall script.

  Requires the following keys to be overridden:
  - NESSUS_AGENT_KEY
  - NESSUS_AGENT_GROUP
  - NESSUS_AGENT_HOST
  - NESSUS_AGENT_PORT
Identifier: com.github.eth-its-recipes.jamf.script.NessusAgentLicense
MinimumVersion: "2.3"

Input:
  NAME: Nessus Agent License
  SCRIPT_CATEGORY: Security
  TRIGGER_POLICY_CATEGORY: Triggered Installers
  TRIGGER_POLICY_TEMPLATE: Policy-script-triggeronly-parameters-nonotification.xml
  TRIGGER_POLICY_NAME: "Install %NAME%"
  TRIGGER_NAME: Run-NessusAgentLicense
  SCRIPT_NAME: NessusAgentLicense-install.zsh
  SCRIPT_PRIORITY: After
  TRIGGER_POLICY_RUN_COMMAND: "echo 'Installation of %NAME% complete'"
  PARAMETER4_LABEL: Nessus host name
  PARAMETER5_LABEL: Nessus host port
  PARAMETER6_LABEL: License key
  PARAMETER7_LABEL: Group
  PARAMETER8_LABEL: Parameter 8
  PARAMETER9_LABEL: Parameter 9
  PARAMETER10_LABEL: Parameter 10
  PARAMETER11_LABEL: Parameter 11
  PARAMETER4_VALUE: "%NESSUS_AGENT_HOST%"
  PARAMETER5_VALUE: "%NESSUS_AGENT_PORT%"
  PARAMETER6_VALUE: "%NESSUS_AGENT_KEY%"
  PARAMETER7_VALUE: "%NESSUS_AGENT_GROUP%"
  PARAMETER8_VALUE: "None"
  PARAMETER9_VALUE: "None"
  PARAMETER10_VALUE: "None"
  PARAMETER11_VALUE: "None"
  REPLACE_POLICY: "False"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%SCRIPT_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%TRIGGER_POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "%SCRIPT_CATEGORY%"
      script_path: "%SCRIPT_NAME%"
      script_priority: "%SCRIPT_PRIORITY%"
      script_parameter4: "%PARAMETER4_LABEL%"
      script_parameter5: "%PARAMETER5_LABEL%"
      script_parameter6: "%PARAMETER6_LABEL%"
      script_parameter7: "%PARAMETER7_LABEL%"
      script_parameter8: "%PARAMETER8_LABEL%"
      script_parameter9: "%PARAMETER9_LABEL%"
      script_parameter10: "%PARAMETER10_LABEL%"
      script_parameter11: "%PARAMETER11_LABEL%"
      replace_script: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%TRIGGER_POLICY_TEMPLATE%"
      policy_name: "%TRIGGER_POLICY_NAME%"
      replace_policy: "%REPLACE_POLICY%"
