Description: |
  Creates a Once per day policy to run silnite.

  Requires the "silnite installed" group to already exist.
Identifier: com.github.eth-its-recipes.jamf.script.silentnite-run
MinimumVersion: "2.3"

Input:
  NAME: silnite
  RECURRING_POLICY_CATEGORY: Administration
  RECURRING_POLICY_TEMPLATE: Policy-script-recurring.xml
  RECURRING_POLICY_NAME: "Run %NAME%"
  RECURRING_POLICY_FREQUENCY: Once every day
  RECURRING_GROUP_NAME: silnite installed
  SCRIPT_NAME: silnite-run.zsh
  SCRIPT_PRIORITY: After

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%RECURRING_POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "%RECURRING_POLICY_CATEGORY%"
      script_path: "%SCRIPT_NAME%"
      script_priority: "%SCRIPT_PRIORITY%"
      replace_script: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%RECURRING_POLICY_TEMPLATE%"
      policy_name: "%RECURRING_POLICY_NAME%"
      replace_policy: "True"
