Description: |
  Downloads the last available installer package from a local source. This is a template recipe that can be used for all Adobe CC apps.

  Required override keys:
  - LIST_NAME
Identifier: com.github.eth-its-recipes.download.AdobeCreativeCloudApps
MinimumVersion: "2.3"

Input:
  LIMITATION: ""
  EXCEPTION: ""
  LOCAL_REPO: /tmp/AutoPkg_Local_Sources
  VENDOR: Adobe

Process:
  - Processor: com.github.eth-its-recipes.processors/SubDirectoryList
    Arguments:
      EXCEPTION: "%EXCEPTION%"
      root_path: "%LOCAL_REPO%/%VENDOR%/%LIST_NAME%"

  - Processor: com.github.eth-its-recipes.processors/LocalRepoUpdateChecker
    Arguments:
      RECIPE_CACHE_DIR: "%RECIPE_CACHE_DIR%"
      found_files: "%found_filenames%"

  - Processor: URLDownloader
    Arguments:
      url: "file://%root_path%/%version%/%latest_file%.zip"

  - Processor: EndOfCheckPhase
