Description: Checks /tmp/AutoPkg_Local_Sources for update.
Identifier: com.github.eth-its-recipes.download.AdobeCreativeCloud
MinimumVersion: 1.0.0

Input:
  EXCEPTION: ""
  LIMITATION: ""
  LOCAL_REPO: /tmp/AutoPkg_Local_Sources
  LIST_NAME: Creative_Cloud_Desktop_App
  VENDOR: Adobe
  STOP_PREDICATE: "file_exists == True"

Process:
  - Processor: com.github.eth-its-recipes.processors/SubDirectoryList
    Arguments:
      EXCEPTION: "%EXCEPTION%"
      LIMITATION: "%LIMITATION%"
      root_path: "%LOCAL_REPO%/%VENDOR%/%LIST_NAME%"

  - Processor: com.github.eth-its-recipes.processors/LocalRepoUpdateChecker
    Arguments:
      RECIPE_CACHE_DIR: "%RECIPE_CACHE_DIR%"
      found_files: "%found_filenames%"

  - Processor: StopProcessingIf
    Comment: "Checks if the file already exists in the cache"
    Arguments:
      predicate: "%STOP_PREDICATE%"

  - Processor: URLDownloader
    Comment: "Downloads the file from the source repo to the AutoPkg cache"
    Arguments:
      url: "file://%root_path%/%version%/%latest_file%.pkg"
      
  - Processor: FileMover
    Comment: "Renames Package to something trackable"
    Arguments:
      source: "file://%RECIPE_CACHE_DIR%/%latest_file%.pkg"
      target: "file://%RECIPE_CACHE_DIR%/%LIST_NAME%-%version%.pkg"

  - Processor: EndOfCheckPhase
