Description: Downloads the latest version of Affinity ( one app, since version 3 ).
Identifier: com.github.eth-its-recipes.download.Affinity
MinimumVersion: 1.0.0

Input:
  LIST_NAME: Affinity
  VENDOR: Canva
  NAME: Affinity

Process:

  - Processor: URLDownloader
    Comment: "Downloads the file from the source repo to the AutoPkg cache"
    Arguments:
      url: "https://downloads.affinity.studio/Affinity.dmg"
      filename: "%NAME%.dmg"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/Affinity.app"
      requirement: anchor apple generic and identifier "com.canva.affinity" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "5HD2ARTBFS")

  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: "%pathname%"