Description: Download recipe for Comsol Multiphysics.
Identifier: com.github.eth-its-recipes.download.Comsol
MinimumVersion: "2.3"

Input:
  NAME: COMSOL Multiphysics
  LOCAL_REPO: /tmp/AutoPkg_Local_Sources
  LIST_NAME: "Comsol Multiphysics"
  VENDOR: Comsol

Process:
  - Processor: com.github.eth-its-recipes.processors/SubDirectoryList
    Arguments:
      root_path: "%LOCAL_REPO%/%VENDOR%/%LIST_NAME%/%PKG_PLATFORM_ID%"

  - Processor: com.github.eth-its-recipes.processors/LocalRepoUpdateChecker
    Arguments:
      RECIPE_CACHE_DIR: "%RECIPE_CACHE_DIR%"
      found_files: "%found_filenames%"

  - Processor: URLDownloader
    Arguments:
      url: file://%root_path%/%version%/%latest_file%.dmg

  - Processor: EndOfCheckPhase
