Comment: Created with Recipe Robot v2.5.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of Enpass.
Identifier: com.github.eth-its-recipes.download.Enpass
Input:
  NAME: Enpass
MinimumVersion: '2.3'
Process:
- Arguments:
    url: https://www.enpass.io/download/macos/website/stable
    filename: Enpass.pkg
  Processor: URLDownloader
- Processor: EndOfCheckPhase
- Arguments:
    input_path: '%pathname%'
    expected_authority_names:
        - 'Developer ID Installer: Enpass Technologies Private Limited (7ADB8CC6TF)'
        - 'Developer ID Certification Authority'
        - 'Apple Root CA'
  Processor: CodeSignatureVerifier
- Arguments:
    flat_pkg_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/%NAME%'
    purge_destination: true
  Processor: FlatPkgUnpacker
- Arguments:
    pkg_payload_path: '%RECIPE_CACHE_DIR%/%NAME%/Enpass_temp.pkg/Payload'
    destination_path: '%RECIPE_CACHE_DIR%/payload'
    purge_destination: true
  Processor: PkgPayloadUnpacker
- Arguments:
    input_plist_path: '%RECIPE_CACHE_DIR%/payload/Enpass.app/Contents/Info.plist'
  Processor: Versioner
- Arguments:
    path_list:
        - '%RECIPE_CACHE_DIR%/payload'
        - '%RECIPE_CACHE_DIR%/%NAME%'
  Processor: PathDeleter
