Description: Download recipe for the ETH Monitoring Tool client.
Identifier: com.github.eth-its-recipes.download.ETHDefenderMonitoringTool
MinimumVersion: "2.3"

Input:
  NAME: ETH Defender Monitoring Tool
  LOCAL_REPO: /Volumes/AutoPkg_Local_Sources
  LIST_NAME: Defender_Monitoring_Tool
  VENDOR: ETH

Process:
  - Processor: com.github.eth-its-recipes.processors/SubDirectoryList
    Arguments:
      root_path: "%LOCAL_REPO%/%VENDOR%/%LIST_NAME%"

  - Processor: com.github.eth-its-recipes.processors/LocalRepoUpdateChecker
    Arguments:
      RECIPE_CACHE_DIR: "%RECIPE_CACHE_DIR%"
      found_files: "%found_filenames%"

  - Processor: URLDownloader
    Arguments:
      url: file://%root_path%/%version%/%latest_file%.zip

  - Processor: EndOfCheckPhase
