Description: Downloads the latest version of ETH Office Templates.
Identifier: com.github.eth-its-recipes.download.ETHOfficeTemplates
MinimumVersion: 1.0.0

Input:
  LOCAL_REPO: /Volumes/AutoPkg_Local_Sources
  LIST_NAME: Templates_MSOffice
  VENDOR: ETH

Process:
  - Processor: com.github.eth-its-recipes.processors/SubDirectoryList
    Comment: Obtaining the Word Templates
    Arguments:
      root_path: "%LOCAL_REPO%/%VENDOR%/%LIST_NAME%"
      LIMITATION: eth-wordtemplates

  - Processor: com.github.eth-its-recipes.processors/LocalRepoUpdateChecker
    Arguments:
      RECIPE_CACHE_DIR: "%RECIPE_CACHE_DIR%"
      found_files: "%found_filenames%"

  - Processor: URLDownloader
    Arguments:
      url: file://%root_path%/%version%/%latest_file%.zip

  - Processor: com.github.eth-its-recipes.processors/SubDirectoryList
    Comment: Obtaining the PowerPoint Templates
    Arguments:
      root_path: "%LOCAL_REPO%/%VENDOR%/%LIST_NAME%"
      LIMITATION: eth-pp-template

  - Processor: com.github.eth-its-recipes.processors/LocalRepoUpdateChecker
    Arguments:
      RECIPE_CACHE_DIR: "%RECIPE_CACHE_DIR%"
      found_files: "%found_filenames%"

  - Processor: URLDownloader
    Arguments:
      url: file://%root_path%/%version%/%latest_file%.zip

  - Processor: EndOfCheckPhase
