Description: Download recipe for the IBM Storage Protect desktop client.
Identifier: com.github.eth-its-recipes.download.IBMStorageProtect
MinimumVersion: "2.3"

Input:
  NAME: IBM Storage Protect
  SEARCH_PATTERN: (?P<match>href="(?P<dmg_name>(?P<version>.*?)-TIV-TSMBAC-Mac\.dmg?)")
  SEARCH_URL: https://sp-repo.ethz.ch/mac/?C=N;O=D

Process:
  - Arguments:
      re_pattern: "%SEARCH_PATTERN%"
      result_output_var_name: download_url
      url: "%SEARCH_URL%"
    Processor: URLTextSearcher

  - Arguments:
      url: "https://sp-repo.ethz.ch/mac/%dmg_name%"
    Processor: URLDownloader

  - Processor: EndOfCheckPhase

  # - Arguments:
  #     expected_authority_names:
  #       - "Developer ID Installer: International  Business Machines Corp (PETKK2G752)"
  #       - Developer ID Certification Authority
  #       - Apple Root CA
  #     input_path: "%pathname%/IBM Spectrum Protect.pkg"
  #   Processor: CodeSignatureVerifier
