Description: Downloads the latest version of ilastik and verifies the signature.
Identifier: com.github.eth-its-recipes.download.ilastik
MinimumVersion: "2.3"

Input:
  NAME: ilastik

Process:
  - Processor: URLTextSearcher
    Arguments:
      url: "https://www.ilastik.org/download"
      re_pattern: 'href="(?P<url>https://files\.ilastik\.org/ilastik-[0-9]+\.[0-9]+\.[0-9]+[a-z0-9-]*-arm64-OSX\.zip)"'

  - Processor: URLDownloader
  
  - Processor: EndOfCheckPhase