Description: Checks IT Shop for an update. Requires override of LIST_NAME.
Identifier: com.github.eth-its-recipes.download.internal-sources-check
MinimumVersion: "2.3"

Input:
  LIST_FILTER: ""
  LIST_LANGUAGE: ML
  LIST_LANGUAGE_COLUMN_NUMBER: "4"
  LIST_LICENSE_FILE_COLUMN_NUMBER: "9"
  LIST_LICENSE_FILE_SOURCE: /Volumes/maclic/PRD/Mac/licensefiles
  LIST_LICENSE_KEY_COLUMN_NUMBER: "8"
  LIST_DELIMITER: ;
  LIST_SOURCE: /Volumes/maclic/PRD/Mac/ListofSoftwareItemsForMacPackaging-v5.csv
  LIST_SUBFOLDER: ""
  LIST_MAJOR_VERSION: ""
  LIST_PATH_COLUMN_NUMBER: "6"
  LIST_TITLE_COLUMN_NUMBER: "1"
  LIST_VERSION_COLUMN_NUMBER: "2"
  SOFTWARE_REPO: /Volumes/mac

Process:
  - Arguments:
      list_filter: "%LIST_FILTER%"
      list_language: "%LIST_LANGUAGE%"
      list_name: "%LIST_NAME%"
      list_major_version: "%LIST_MAJOR_VERSION%"
      RECIPE_CACHE_DIR: "%RECIPE_CACHE_DIR%"
      lang_col: "%LIST_LANGUAGE_COLUMN_NUMBER%"
      license_col: "%LIST_LICENSE_KEY_COLUMN_NUMBER%"
      license_file_col: "%LIST_LICENSE_FILE_COLUMN_NUMBER%"
      license_file_source: "%LIST_LICENSE_FILE_SOURCE%"
      list_delimiter: "%LIST_DELIMITER%"
      list_source: "%LIST_SOURCE%"
      list_subfolder: "%LIST_SUBFOLDER%"
      mounted_repo: "%SOFTWARE_REPO%"
      path_col: "%LIST_PATH_COLUMN_NUMBER%"
      title_col: "%LIST_TITLE_COLUMN_NUMBER%"
      version_col: "%LIST_VERSION_COLUMN_NUMBER%"
    Comment: Get list of versions of a product. Outputs path to latest version.
    Processor: com.github.eth-its-recipes.processors/InternalUpdateChecker
