Description: Downloads the latest version of ISL Light Client for Mac.
Identifier: com.github.eth-its-recipes.download.ISLLightClient
MinimumVersion: "2.3"

Input:
  DOWNLOAD_URL: https://swarley.ethz.ch/download/ISLLightClient?platform=mac
  NAME: ISL Light Client

Process:
- Arguments:
    filename: ISL Light Client.dmg
    url: '%DOWNLOAD_URL%'
  Processor: URLDownloader

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: "%pathname%/ISL Light Client.app"
    requirement: (anchor apple generic and certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = GP5P6H7RRF) and identifier "com.islonline.isllight.isllight"
