Description: Download recipe for the MailToOutlook script to set Outlook as default mail client. 
Identifier: com.github.eth-its-recipes.download.MailToOutlook
MinimumVersion: "2.3"

Input:
  NAME: MailToOutlook

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: "(?P<pkg_name>MailToOutlook_(?P<version>[0-9.]+)\.pkg)"
      result_output_var_name: pkg_name
      url: "https://macadmins.software/tools/"

  - Processor: URLDownloader
    Arguments:
      url: "https://macadmins.software/tools/%pkg_name%"
      filename: "MailToOutlook-%version%.pkg"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%"
      expected_authority_names: 
        - "Developer ID Installer: Paul Bowden (QGS93ZLCU7)"
        - Developer ID Certification Authority
        - Apple Root CA



