Description: Download recipe for the MailToOutlook PKG to set the default Mail client to Outlook.
Identifier: com.github.eth-its-recipes.download.MailToOutlook
MinimumVersion: "2.3"

Input:
  NAME: MailToOutlook
  SEARCH_PATTERN: (?P<pkg_name>MailToOutlook_[0-9.]+\.pkg)
  SEARCH_URL: https://macadmins.software/tools/

Process:
  - Processor: URLTextSearcher
    Arguments:
      url: "%SEARCH_URL%"
      re_pattern: "%SEARCH_PATTERN%"
      result_output_var_name: download_url

  - Processor: URLDownloader
    Arguments:
      url: "%download_url%"
      filename: "%NAME%.pkg"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%"
      expected_authority_names: 
        - "Developer ID Installer: Paul Bowden (QGS93ZLCU7)"
        - Developer ID Certification Authority
        - Apple Root CA