Description: Download recipe for the MailToOutlook script to set Outlook as default mail client. 
Identifier: com.github.eth-its-recipes.download.MailToOutlook
MinimumVersion: "2.3"

Input:
  NAME: MailToOutlook
  SEARCH_PATTERN: (?P<pkg_name>MailToOutlook_[0-9.]+\.pkg)
  SEARCH_URL: https://macadmins.software/tools/

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: "%SEARCH_PATTERN%"
      result_output_var_name: pkg_name
      url: "%SEARCH_URL%"

  - Processor: URLDownloader
    Arguments:
      url: "https://macadmins.software/tools/%pkg_name%"
      filename: "%NAME%.pkg"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%"
      expected_authority_names: 
        - "Developer ID Installer: Paul Bowden (QGS93ZLCU7)"
        - Developer ID Certification Authority
        - Apple Root CA