Description: "Checks /Volumes/AutoPkg_Local_Sources for update. Requires: override of NAME, LIST_NAME and VENDOR."
Identifier: com.github.eth-its-recipes.download.Matlab
MinimumVersion: "2.3"

Input:
  EXCEPTION: ""
  LOCAL_REPO: /Volumes/AutoPkg_Local_Sources
  LIST_NAME: MATLAB
  VENDOR: Mathworks
  STOP_PREDICATE: file_exists == True

Process:
  - Processor: com.github.eth-its-recipes.processors/SubDirectoryList
    Arguments:
      EXCEPTION: "%EXCEPTION%"
      root_path: "%LOCAL_REPO%/%VENDOR%/%LIST_NAME%"

  - Processor: com.github.eth-its-recipes.processors/LocalRepoUpdateChecker
    Arguments:
      RECIPE_CACHE_DIR: "%RECIPE_CACHE_DIR%"
      found_files: "%found_filenames%"

  - Processor: StopProcessingIf
    Comment: "Checks if the file already exists in the cache"
    Arguments:
      predicate: "%STOP_PREDICATE%"

  - Processor: URLDownloader
    Comment: "Downloads the file from the source repo to the AutoPkg cache"
    Arguments:
      url: file://%root_path%/%version%/%latest_file%.zip

  - Processor: EndOfCheckPhase
