Description: "Checks /tmp/AutoPkg_Local_Sources for update. Requires: override of NAME, LIST_NAME and VENDOR."
Identifier: com.github.eth-its-recipes.download.Mega
MinimumVersion: "2.3"

Input:
  Name: Mega
  USER_AGENT: "Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/145.0.0.0 Safari/537.36"

Process:
  - Processor: MEGAURLProvider

  - Processor: URLDownloader
    Comment: "Downloads the file from the source repo to the AutoPkg cache"
    Arguments:
        request_headers:
            User-Agent: "Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/145.0.0.0 Safari/537.36"

  - Processor: EndOfCheckPhase