Description: Downloads the latest Microsoft Office Serializer package.
Identifier: com.github.eth-its-recipes.download.MicrosoftOfficeSerializer-eawag
MinimumVersion: "2.3"

Input:
  NAME: Microsoft Office Serializer
  LOCAL_REPO: /Volumes/AutoPkg_Local_Sources
  LIST_NAME: Serializer_MSOffice
  VENDOR: eawag

Process:
  - Processor: com.github.eth-its-recipes.processors/SubDirectoryList
    Arguments:
      root_path: "%LOCAL_REPO%/%VENDOR%/%LIST_NAME%"

  - Processor: com.github.eth-its-recipes.processors/LocalRepoUpdateChecker
    Arguments:
      RECIPE_CACHE_DIR: "%RECIPE_CACHE_DIR%"
      found_files: "%found_filenames%"

  - Processor: URLDownloader
    Arguments:
      url: file://%root_path%/%version%/%latest_file%.pkg

  - Processor: EndOfCheckPhase
