Description: Downloads the current pkg installer for miniconda3 and returns its version. ARM64 only, since manufacturer stopped intel builds 08/2025
Identifier: com.github.eth-its-recipes.download.miniconda-arm64
MinimumVersion: "2.3"

Input:
  NAME: miniconda

Process:
  - Processor: URLTextSearcher
    Comment: Get the sha256 of the current pkg installer
    Arguments:
      result_output_var_name: miniconda_current_version_sha256
      re_flags: re.M
      re_pattern: \"Miniconda3-latest-MacOSX-arm64.pkg\">Miniconda3-latest-MacOSX-arm64.pkg</a></td>\s*?<td.*\s*?<td.*\s*<td>(.*?)<\/td>
      url: https://repo.anaconda.com/miniconda/

  - Processor: URLTextSearcher
    Comment: Get the version of the current pkg installer by going backwards from the sha256 of the above
    Arguments:
      result_output_var_name: version
      re_flags: re.M
      re_pattern: \"Miniconda3-(.*?)-MacOSX-arm64.pkg\">Miniconda3-py.*?-MacOSX-arm64.pkg</a></td>\s*?<td.*\s*?<td.*\s*?<td>%miniconda_current_version_sha256%

  - Processor: URLDownloader
    Comment: Downloads the file from the source repo to the AutoPkg cache, and names it as if was on the source
    Arguments:
      url: https://repo.anaconda.com/miniconda/Miniconda3-latest-MacOSX-arm64.pkg
      filename: Miniconda3-%version%-MacOSX-arm64.pkg

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%"
      expected_authority_names:
        - "Developer ID Installer: Anaconda, Inc (Z5788K4JT7)"
        - "Developer ID Certification Authority"
        - "Apple Root CA"

  - Processor: com.github.rtrouton.SharedProcessors/VariablePlaceholder
    Arguments:
      pkg_path: "%pathname%"
      pkg_version: "%version%"
