Description: Checks github for new relases of NotepadPlusPlus
Identifier: com.github.eth-its-recipes.download.NotepadPlusPlus
MinimumVersion: "2.3"

Input:
  INCLUDE_PRERELEASES: "False"

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: notepad-plus-plus-mac/notepad-plus-plus-macos
      include_prereleases: "%INCLUDE_PRERELEASES%"

  - Processor: URLDownloader

  - Processor: EndOfCheckPhase
