Description: Downloads the latest PopChar sitekey file.
Identifier: com.github.eth-its-recipes.download.PopCharLicense
MinimumVersion: "2.3"

Input:
  NAME: PyMOL License
  LOCAL_REPO: /tmp/AutoPkg_Local_Sources
  LIST_NAME: PopChar_License
  VENDOR: ETH

Process:
  - Processor: com.github.eth-its-recipes.processors/SubDirectoryList
    Arguments:
      root_path: "%LOCAL_REPO%/%VENDOR%/%LIST_NAME%"

  - Processor: com.github.eth-its-recipes.processors/LocalRepoUpdateChecker
    Arguments:
      RECIPE_CACHE_DIR: "%RECIPE_CACHE_DIR%"
      found_files: "%found_filenames%"

  - Processor: URLDownloader
    Arguments:
      url: file://%root_path%/%version%/%latest_file%.sitekey

  - Processor: EndOfCheckPhase
