Description: Checks /Volumes/AutoPkg_Local_Sources for update.
Identifier: com.github.eth-its-recipes.download.SPSSStatisticsFixPack
MinimumVersion: "2.3"

Comment: Requires MAJOR_VERSION to be supplied in the override/child recipe

Input:
  LIMITATION: "%MAJOR_VERSION%"
  LOCAL_REPO: /Volumes/AutoPkg_Local_Sources
  LIST_NAME: SPSS_Statistics_Fix_Packs
  VENDOR: IBM

Process:
  - Processor: com.github.eth-its-recipes.processors/SubDirectoryList
    Arguments:
      LIMITATION: "%LIMITATION%"
      root_path: "%LOCAL_REPO%/%VENDOR%/%LIST_NAME%"

  - Processor: com.github.eth-its-recipes.processors/LocalRepoUpdateChecker
    Arguments:
      RECIPE_CACHE_DIR: "%RECIPE_CACHE_DIR%"
      found_files: "%found_filenames%"

  - Processor: URLDownloader
    Comment: "Downloads the file from the source repo to the AutoPkg cache"
    Arguments:
      url: file://%root_path%/%version%/%latest_file%.pkg

  - Processor: EndOfCheckPhase
