Comment: REGISTRATION_CODE, REGISTRATION_EMAIL, REGISTRATION_NAME, REGISTRATION_PRODUCT_NAME keys all need to be added to the recipe override.
Description: Uploads a computer configuration to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.grahampugh.recipes.jamf.CarbonCopyCloner-prod-profile
MinimumVersion: "2.3"

Input:
  NAME: Carbon Copy Cloner
  LANGUAGE: EN
  IDENTIFIER: com.bombich.ccc
  ORGANIZATION: ETH Zürich
  USERS_GROUP_NAME: "%NAME% %LANGUAGE% users"
  TEST_USERS_GROUP_NAME: "%NAME% %LANGUAGE% test users"
  JSS_INVENTORY_NAME: "%NAME%.app"
  USERS_GROUP_TEMPLATE: SmartGroup-users.xml
  TEST_USERS_GROUP_TEMPLATE: SmartGroup-test-users.xml
  PROFILE_CATEGORY: Development & Computing
  PROFILE_DESCRIPTION: License and settings for Carbon Copy Cloner (v6)
  PROFILE_TEMPLATE: Profile-1-group-1-exclusion.xml
  PROFILE_NAME: Carbon Copy Cloner
  PROFILE_PAYLOAD: "%IDENTIFIER%.plist"
  REPLACE_PROFILE: "False"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%PROFILE_CATEGORY%"
      replace_category: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%USERS_GROUP_TEMPLATE%"
      computergroup_name: "%USERS_GROUP_NAME%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%TEST_USERS_GROUP_TEMPLATE%"
      computergroup_name: "%TEST_USERS_GROUP_NAME%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerProfileUploader
    Arguments:
      profile_name: "%PROFILE_NAME%"
      profile_category: "%PROFILE_CATEGORY%"
      profile_template: "%PROFILE_TEMPLATE%"
      payload: "%PROFILE_PAYLOAD%"
      identifier: "%IDENTIFIER%"
      organization: "%ORGANIZATION%"
      profile_description: "%PROFILE_DESCRIPTION%"
      profile_computergroup: "%USERS_GROUP_NAME%"
      replace_profile: "%REPLACE_PROFILE%"
