Description: |
  Uploads a computer configuration to the Jamf Pro Server and creates a Self Service Policy and Smart Group.

  Requires the "Citrix Workspace users" group and the relevant category to have already been created.

  Required overrides:
  - CITRIX_SERVER_URL
Identifier: com.github.eth-its-recipes.jamf.CitrixWorkspace-profile
MinimumVersion: "2.3"

Input:
  NAME: Citrix Workspace
  IDENTIFIER: com.citrix.receiver.nomas
  GROUP_NAME: "%NAME% users"
  PROFILE_CATEGORY: "Administration"
  PROFILE_TEMPLATE: Profile-1-group.xml
  PROFILE_NAME: Citrix Workspace Settings
  PROFILE_PAYLOAD: "%IDENTIFIER%.plist"
  PROFILE_DESCRIPTION: Restricts Citrix Workspace updates and sets the default server URL
  REPLACE_PROFILE: "False"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerProfileUploader
    Arguments:
      profile_name: "%PROFILE_NAME%"
      profile_category: "%PROFILE_CATEGORY%"
      profile_template: "%PROFILE_TEMPLATE%"
      mobileconfig: "%PROFILE_MOBILECONFIG%"
      profile_computergroup: "%GROUP_NAME%"
      replace_profile: "%REPLACE_PROFILE%"
