Description: |
  Uploads a computer configuration to the Jamf Pro Server and creates a Self Service Policy and Smart Group.

  Requires the "Dell Display And Peripheral Manager users" group and the relevant category to have already been created.
Identifier: com.github.eth-its-recipes.jamf.DellDisplayAndPeripheralManager-profile
MinimumVersion: "2.3"

Input:
  NAME: Dell Display And Peripheral Manager
  GROUP_NAME: "%NAME% users"
  PROFILE_CATEGORY: "Administration"
  PROFILE_TEMPLATE: Profile-1-group.xml
  PROFILE_NAME: Dell Display And Peripheral Manager Privacy Settings
  PROFILE_DESCRIPTION: Manages Accessibility settings for the Dell Display and Peripheral Manager
  ORGANIZATION: "%NAME%"
  PROFILE_MOBILECONFIG: DellDisplayAndPeripheralManager-privacy.mobileconfig
  REPLACE_PROFILE: "False"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerProfileUploader
    Arguments:
      profile_name: "%PROFILE_NAME%"
      profile_category: "%PROFILE_CATEGORY%"
      profile_template: "%PROFILE_TEMPLATE%"
      mobileconfig: "%PROFILE_MOBILECONFIG%"
      profile_computergroup: "%GROUP_NAME%"
      replace_profile: "%REPLACE_PROFILE%"
