Description: Uploads a computer configuration to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.grahampugh.recipes.jamf.DetectX-profile
MinimumVersion: "2.3"

Input:
  NAME: DetectX Swift
  INSTALLED_GROUP_NAME: "%NAME% installed"
  JSS_INVENTORY_NAME: "%NAME%.app"
  PROFILE_GROUP_TEMPLATE: SmartGroup-installed.xml
  PROFILE_CATEGORY: "Administration"
  PROFILE_TEMPLATE: Profile-1-group.xml
  PROFILE_NAME: DetectX settings
  PROFILE_MOBILECONFIG: DetectX-settings.mobileconfig
  PROFILE2_NAME: Privacy Preferences - DetectX
  PROFILE2_MOBILECONFIG: DetectX-PPPC.mobileconfig
  REPLACE_PROFILE: "False"
  REPLACE_PROFILE2: "False"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%PROFILE_CATEGORY%"
      replace_category: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%PROFILE_GROUP_TEMPLATE%"
      computergroup_name: "%INSTALLED_GROUP_NAME%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerProfileUploader
    Arguments:
      profile_name: "%PROFILE_NAME%"
      profile_category: "%PROFILE_CATEGORY%"
      profile_template: "%PROFILE_TEMPLATE%"
      mobileconfig: "%PROFILE_MOBILECONFIG%"
      profile_computergroup: "%INSTALLED_GROUP_NAME%"
      replace_profile: "%REPLACE_PROFILE%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerProfileUploader
    Arguments:
      profile_name: "%PROFILE2_NAME%"
      profile_category: "%PROFILE_CATEGORY%"
      profile_template: "%PROFILE_TEMPLATE%"
      mobileconfig: "%PROFILE2_MOBILECONFIG%"
      profile_computergroup: "%INSTALLED_GROUP_NAME%"
      replace_profile: "%REPLACE_PROFILE2%"
