Description: Uploads a computer configuration to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.grahampugh.recipes.jamf.DisablePython2DeprecationPrompt-profile
MinimumVersion: "2.3"

Input:
  NAME: Disable Python 2 Deprecation Prompt
  PROFILE_CATEGORY: "Administration"
  PROFILE_TEMPLATE: Profile-single-group.xml
  PROFILE_NAME: "%NAME%"
  PROFILE_MOBILECONFIG: DisablePythonAlert.mobileconfig
  USERS_GROUP_NAME: Disable Python 2 Deprecation Prompt users
  TEST_USERS_GROUP_NAME: Disable Python 2 Deprecation Prompt test users
  PROFILE_GROUP_TEMPLATE: SmartGroup-users.xml
  PROFILE_TEST_GROUP_TEMPLATE: StaticGroup-testing.xml
  TESTING_GROUP_NAME: "%TEST_USERS_GROUP_NAME%"
  REPLACE_PROFILE: "False"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%PROFILE_CATEGORY%"
      replace_category: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%PROFILE_TEST_GROUP_TEMPLATE%"
      computergroup_name: "%TEST_USERS_GROUP_NAME%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%PROFILE_GROUP_TEMPLATE%"
      computergroup_name: "%USERS_GROUP_NAME%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerProfileUploader
    Arguments:
      profile_name: "%PROFILE_NAME%"
      profile_category: "%PROFILE_CATEGORY%"
      profile_template: "%PROFILE_TEMPLATE%"
      mobileconfig: "%PROFILE_MOBILECONFIG%"
      profile_computergroup: "%USERS_GROUP_NAME%"
      replace_profile: "%REPLACE_PROFILE%"
