Description: |
  Uploads a computer configuration to the Jamf Pro Server and creates a Self Service Policy.
Identifier: com.github.eth-its-recipes.jamf.Firewall-profile
MinimumVersion: "2.3"

Input:
  NAME: Firewall Settings
  PROFILE_NAME: Firewall Settings
  PROFILE_MOBILECONFIG: Firewall.mobileconfig
  PROFILE_TEMPLATE: Profile-1-group.xml
  PROFILE_CATEGORY: Security
  PROFILE_DESCRIPTION: Ensures Firewall is enabled.
  ORGANIZATION: ETH Zurich
  USERS_GROUP_NAME: "%NAME% enforced"
  TEST_USERS_GROUP_NAME: "Testing - %NAME%"
  TESTING_GROUP_NAME: "%TEST_USERS_GROUP_NAME%"
  PROFILE_GROUP_TEMPLATE: SmartGroup-users.xml
  PROFILE_TEST_GROUP_TEMPLATE: StaticGroup-testing.xml
  REPLACE_PROFILE: "True"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%PROFILE_CATEGORY%"
      replace_category: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%PROFILE_TEST_GROUP_TEMPLATE%"
      computergroup_name: "%TEST_USERS_GROUP_NAME%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%PROFILE_GROUP_TEMPLATE%"
      computergroup_name: "%USERS_GROUP_NAME%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerProfileUploader
    Arguments:
      profile_name: "%PROFILE_NAME%"
      profile_category: "%PROFILE_CATEGORY%"
      profile_template: "%PROFILE_TEMPLATE%"
      payload: "%PROFILE_PAYLOAD%"
      identifier: "%IDENTIFIER%"
      organization: "%ORGANIZATION%"
      profile_description: "%PROFILE_DESCRIPTION%"
      profile_computergroup: "%USERS_GROUP_NAME%"
      replace_profile: "%REPLACE_PROFILE%"
