Description: |
  Uploads a computer configuration to the Jamf Pro Server and creates a Self Service Policy.
Identifier: com.github.eth-its-recipes.jamf.Gatekeeper-profile
MinimumVersion: "2.3"

Input:
  NAME: Gatekeeper
  PROFILE_NAME: Gatekeeper Settings
  PROFILE_MOBILECONFIG: Gatekeeper.mobileconfig
  PROFILE_TEMPLATE: Profile-ignore-scope.xml
  REPLACE_PROFILE: "True"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerProfileUploader
    Arguments:
      profile_name: "%PROFILE_NAME%"
      profile_category: "%PROFILE_CATEGORY%"
      profile_template: "%PROFILE_TEMPLATE%"
      mobileconfig: "%PROFILE_MOBILECONFIG%"
      profile_computergroup: "%GROUP_NAME%"
      replace_profile: "%REPLACE_PROFILE%"
