Description: |
  Uploads a computer configuration to the Jamf Pro Server and creates a Self Service Policy and Smart Group.

  Required overrides:
  - SERIAL (this is the license key)
Identifier: com.github.eth-its-recipes.jamf.GraphicConverter11-profile
MinimumVersion: "2.3"

Input:
  NAME: GraphicConverter
  MAJOR_VERSION: "11"
  IDENTIFIER: com.lemkesoft.graphicconverter11
  ORGANIZATION: ETH Zürich
  PROFILE_CATEGORY: Administration
  PROFILE_TEMPLATE: Profile-1-group.xml
  PROFILE_NAME: "%NAME% %MAJOR_VERSION%"
  PROFILE_PAYLOAD: "%IDENTIFIER%.plist"
  PROFILE_DESCRIPTION: Licenses GraphicConverter %MAJOR_VERSION%.
  USERS_GROUP_NAME: "%NAME% %MAJOR_VERSION% users"
  TEST_USERS_GROUP_NAME: "%NAME% %MAJOR_VERSION% test users"
  PROFILE_GROUP_TEMPLATE: SmartGroup-users.xml
  PROFILE_TEST_GROUP_TEMPLATE: StaticGroup-testing.xml
  TESTING_GROUP_NAME: "%TEST_USERS_GROUP_NAME%"
  REPLACE_PROFILE: "False"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%PROFILE_CATEGORY%"
      replace_category: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%PROFILE_TEST_GROUP_TEMPLATE%"
      computergroup_name: "%TEST_USERS_GROUP_NAME%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%PROFILE_GROUP_TEMPLATE%"
      computergroup_name: "%USERS_GROUP_NAME%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerProfileUploader
    Arguments:
      profile_name: "%PROFILE_NAME%"
      profile_category: "%PROFILE_CATEGORY%"
      profile_template: "%PROFILE_TEMPLATE%"
      payload: "%PROFILE_PAYLOAD%"
      identifier: "%IDENTIFIER%"
      organization: "%ORGANIZATION%"
      profile_description: "%PROFILE_DESCRIPTION%"
      profile_computergroup: "%USERS_GROUP_NAME%"
      replace_profile: "%REPLACE_PROFILE%"
