Description: Uploads a computer configuration to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.grahampugh.recipes.jamf.MicrosoftDefender-profile
MinimumVersion: "2.3"

Input:
  NAME: Microsoft Defender
  GROUP_NAME: Microsoft Defender users
  ORGANIZATION: ETH Zürich
  PROFILE_CATEGORY: Microsoft Defender

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%PROFILE_CATEGORY%"
      replace_category: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerProfileUploader
    Comment: Microsoft Defender Settings
    Arguments:
      profile_name: Microsoft Defender Settings
      profile_category: "%PROFILE_CATEGORY%"
      profile_template: Profile-1-group.xml
      mobileconfig: MicrosoftDefender.mobileconfig
      replace_profile: True
      computergroup_name: "%GROUP_NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerProfileUploader
    Comment: Microsoft Defender Onboarding Settings
    Arguments:
      profile_name: Microsoft Defender Onboarding Settings
      profile_category: "%PROFILE_CATEGORY%"
      profile_template: Profile-1-group.xml
      mobileconfig: ""
      payload: WindowsDefenderATPOnboarding.plist
      identifier: com.microsoft.wdav.atp
      organization: "%ORGANIZATION%"
      profile_description: Microsoft Defender Onboarding Settings
      computergroup_name: "%GROUP_NAME%"
      replace_profile: True
