Description: |
  Uploads a computer configuration to the Jamf Pro Server and creates a Self Service Policy and Smart Group.

  Requires the individual users and test users groups to have been already created.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftAutoUpdate-notifications-profile
MinimumVersion: "2.3"

Input:
  NAME: Microsoft AutoUpdate Notifications
  USERS_ALL_MICROSOFT_APPS_NAME: "Microsoft applications users"
  USERS_GROUP_TEMPLATE: SmartGroup-users-Microsoft-all-apps.xml
  PROFILE_CATEGORY: Notifications
  PROFILE_TEMPLATE: Profile-1-group.xml
  PROFILE_NAME: "%NAME%"
  PROFILE_DESCRIPTION: Enables notifications for Microsoft AutoUpdate
  ORGANIZATION: Microsoft
  PROFILE_MOBILECONFIG: MicrosoftAutoUpdate-notifications.mobileconfig
  REPLACE_PROFILE: "False"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%PROFILE_CATEGORY%"
      replace_category: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%USERS_GROUP_TEMPLATE%"
      computergroup_name: "%USERS_ALL_MICROSOFT_APPS_NAME%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerProfileUploader
    Arguments:
      GROUP_NAME: "%USERS_ALL_MICROSOFT_APPS_NAME%"
      profile_name: "%PROFILE_NAME%"
      profile_category: "%PROFILE_CATEGORY%"
      profile_template: "%PROFILE_TEMPLATE%"
      mobileconfig: "%PROFILE_MOBILECONFIG%"
      profile_computergroup: "%GROUP_NAME%"
      replace_profile: "%REPLACE_PROFILE%"
