Description: |
  Uploads a computer configuration to the Jamf Pro Server and creates a Self Service Policy and Smart Group.

  Requires the "Microsoft Office 2019 users" and "Microsoft Office 365 users" groups to already exist.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftOffice-profile
MinimumVersion: "2.3"

Input:
  NAME: Microsoft Office
  GROUP_NAME: "%NAME% users"
  PROFILE_CATEGORY: "Administration"
  PROFILE_TEMPLATE: Profile-MicrosoftOffice.xml
  PROFILE_NAME: Microsoft Office Privacy Settings
  PROFILE_DESCRIPTION: Manages Full Disk Access settings for Microsoft Office
  ORGANIZATION: "%NAME%"
  PROFILE_MOBILECONFIG: MicrosoftOffice-privacy.mobileconfig
  REPLACE_PROFILE: "True"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%PROFILE_CATEGORY%"
      replace_category: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerProfileUploader
    Arguments:
      profile_name: "%PROFILE_NAME%"
      profile_category: "%PROFILE_CATEGORY%"
      profile_template: "%PROFILE_TEMPLATE%"
      mobileconfig: "%PROFILE_MOBILECONFIG%"
      profile_computergroup: "%GROUP_NAME%"
      replace_profile: "%REPLACE_PROFILE%"
