Description: Uploads a computer configuration to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.grahampugh.recipes.jamf.MicrosoftDefender-profile
MinimumVersion: "2.3"

Input:
  NAME: Microsoft Defender
  GROUP_NAME: Microsoft Defender users
  GROUP_TEMPLATE: SmartGroup-users.xml
  TEST_SERVER_GROUP_NAME: Microsoft Defender test users
  TESTING_GROUP_NAME: Testing - Microsoft Defender Test Context
  TESTING_GROUP_TEMPLATE: StaticGroup-testing.xml
  ORGANIZATION: ETH Zürich
  PROFILE_CATEGORY: Microsoft Defender

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%TESTING_GROUP_TEMPLATE%"
      computergroup_name: "%TESTING_GROUP_NAME%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%GROUP_TEMPLATE%"
      computergroup_name: "%GROUP_NAME%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%PROFILE_CATEGORY%"
      replace_category: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerProfileUploader
    Comment: Microsoft Defender Settings
    Arguments:
      profile_name: Microsoft Defender Settings
      profile_category: "%PROFILE_CATEGORY%"
      profile_template: Profile-1-group.xml
      computergroup_name: "%GROUP_NAME%"
      mobileconfig: MicrosoftDefender.mobileconfig
      replace_profile: True

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerProfileUploader
    Comment: Microsoft Defender Onboarding Settings - Test Context
    Arguments:
      profile_name: Microsoft Defender Onboarding Settings - Test Context
      profile_category: "%PROFILE_CATEGORY%"
      computergroup_name: "%TESTING_GROUP_NAME%"
      profile_template: Profile-1-group.xml
      mobileconfig: ""
      payload: WindowsDefenderATPOnboarding-Test.plist
      identifier: com.microsoft.wdav.atp
      organization: "%ORGANIZATION%"
      profile_description: Microsoft Defender Onboarding Settings
      replace_profile: True

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerProfileUploader
    Comment: Microsoft Defender Onboarding Settings - Prod Context
    Arguments:
      EXCLUSION_GROUP_NAME: "%TESTING_GROUP_NAME%"
      profile_name: Microsoft Defender Onboarding Settings - Prod Context
      profile_category: "%PROFILE_CATEGORY%"
      computergroup_name: "%GROUP_NAME%"
      profile_template: Profile-1-group-1-exclusion.xml
      mobileconfig: ""
      payload: WindowsDefenderATPOnboarding.plist
      identifier: com.microsoft.wdav.atp
      organization: "%ORGANIZATION%"
      profile_description: Microsoft Defender Onboarding Settings
      replace_profile: True
