Description: Uploads a computer configuration to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftAutoUpdate-download-untested-profile
MinimumVersion: "2.3"

Input:
  NAME: Check Microsoft AutoUpdate - untested
  TEST_USERS_GROUP_ALL_MICROSOFT_APPS_NAME: Microsoft applications test users
  TEST_USERS_GROUP_ALL_MICROSOFT_APPS_TEMPLATE: SmartGroup-test-users-Microsoft-all-apps.xml
  IDENTIFIER: com.microsoft.autoupdate2
  ORGANIZATION: ETH Zürich
  PROFILE_CATEGORY: Administration
  PROFILE_DESCRIPTION: Update settings for Microsoft AutoUpdate. This profile will detect and download updates directly from Microsoft's servers based on the "Production" channel.
  PROFILE_NAME: "%NAME%"
  PROFILE_PAYLOAD: MicrosoftAutoUpdate-download-untested.plist
  PROFILE_TEMPLATE: Profile-MicrosoftAutoUpdate-download-untested.xml
  REPLACE_PROFILE: "True"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%TEST_USERS_GROUP_ALL_MICROSOFT_APPS_TEMPLATE%"
      computergroup_name: "%TEST_USERS_GROUP_ALL_MICROSOFT_APPS_NAME%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerProfileUploader
    Arguments:
      profile_name: "%PROFILE_NAME%"
      profile_category: "%PROFILE_CATEGORY%"
      profile_template: "%PROFILE_TEMPLATE%"
      payload: "%PROFILE_PAYLOAD%"
      identifier: "%IDENTIFIER%"
      organization: "%ORGANIZATION%"
      profile_description: "%PROFILE_DESCRIPTION%"
      replace_profile: "%REPLACE_PROFILE%"
