Description: Uploads a computer configuration to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftOffice-profile
MinimumVersion: "2.3"

Input:
  NAME: Microsoft Office
  IDENTIFIER: com.microsoft.office
  ORGANIZATION: ETH Zürich
  PROFILE_CATEGORY: Administration
  PROFILE_DESCRIPTION: Settings for Microsoft Office applications
  PROFILE_NAME: "%NAME%"
  PROFILE_PAYLOAD: com.microsoft.office.plist
  PROFILE_TEMPLATE: Profile-MicrosoftOffice.xml
  REPLACE_PROFILE: "True"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerProfileUploader
    Arguments:
      profile_name: "%PROFILE_NAME%"
      profile_category: "%PROFILE_CATEGORY%"
      profile_template: "%PROFILE_TEMPLATE%"
      payload: "%PROFILE_PAYLOAD%"
      identifier: "%IDENTIFIER%"
      organization: "%ORGANIZATION%"
      profile_description: "%PROFILE_DESCRIPTION%"
      replace_profile: "%REPLACE_PROFILE%"
