Description: Uploads a computer configuration to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.grahampugh.recipes.jamf.PPPCJamfAppleEvents-profile
MinimumVersion: "2.3"

Input:
  NAME: PPPC - Jamf Pro Apple Events
  INSTALLED_GROUP_NAME: "%NAME% installed"
  JSS_INVENTORY_NAME: "%NAME%.app"
  PROFILE_GROUP_TEMPLATE: SmartGroup-installed.xml
  PROFILE_CATEGORY: "Privacy Preferences"
  PROFILE_TEMPLATE: Profile-all-computers.xml
  PROFILE_NAME: "%NAME%"
  PROFILE_MOBILECONFIG: PPPCJamfAppleEvents.mobileconfig
  REPLACE_PROFILE: "False"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%PROFILE_CATEGORY%"
      replace_category: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerProfileUploader
    Arguments:
      profile_name: "%PROFILE_NAME%"
      profile_category: "%PROFILE_CATEGORY%"
      profile_template: "%PROFILE_TEMPLATE%"
      mobileconfig: "%PROFILE_MOBILECONFIG%"
      profile_computergroup: "%INSTALLED_GROUP_NAME%"
      replace_profile: "%REPLACE_PROFILE%"
