Description: |
  Uploads a computer configuration to the Jamf Pro Server and creates a Self Service Policy and Smart Group.

  Requires the "Quicksilver users" group to have already been created.
Identifier: com.github.grahampugh.recipes.jamf.Quicksilver-profile
MinimumVersion: "2.3"

Input:
  NAME: Quicksilver
  GROUP_NAME: "%NAME% users"
  PROFILE_CATEGORY: "Administration"
  PROFILE_TEMPLATE: Profile-1-group.xml
  PROFILE_NAME: Quicksilver Privacy Preferences
  PROFILE_MOBILECONFIG: Quicksilver-PPPC.mobileconfig
  REPLACE_PROFILE: "False"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%PROFILE_CATEGORY%"
      replace_category: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerProfileUploader
    Arguments:
      profile_name: "%PROFILE_NAME%"
      profile_category: "%PROFILE_CATEGORY%"
      profile_template: "%PROFILE_TEMPLATE%"
      mobileconfig: "%PROFILE_MOBILECONFIG%"
      profile_computergroup: "%GROUP_NAME%"
      replace_profile: "%REPLACE_PROFILE%"
