Description: Mounts the local shares. Required for most of the Download recipes to work at ETH.
Identifier: com.github.eth-its-recipes.mount.LocalShares
MinimumVersion: "2.3"

Comment: All variables must be in the environment supplied by the GitLab Runner using input keys.

Input: {}

Process:
  - Processor: com.github.grahampugh.recipes.commonprocessors/SMBMounter
    Arguments:
      smb_path: "//%IDES_USER%:%IDES_PASS%@%IDES_MAC_URL%"
      mount_point: "/Volumes/mac"

  - Processor: com.github.grahampugh.recipes.commonprocessors/SMBMounter
    Arguments:
      smb_path: "//%IDES_USER%:%IDES_PASS%@%IDES_MACLIC_URL%"
      mount_point: "/Volumes/maclic"

  - Processor: com.github.grahampugh.recipes.commonprocessors/SMBMounter
    Arguments:
      smb_path: "//%IDMACMAIN_USER%:%IDMACMAIN_PASS%@%IDMACMAIN_URL%"
      mount_point: "/Volumes/AutoPkg_Local_Sources"
