Comment: |
  This is a template recipe and cannot be used without a child recipe or RecipeOverride.
  UNTESTED_RECIPE_IDENTIFIER must be supplied
  NAME, POLICY_NAME and SELFSERVICE_DISPLAY_NAME need to be provided in the child recipe.
  If the app name does not match NAME.app, JSS_INVENTORY_NAME should also be overridden.
  If the icon does not match NAME.png, SELFSERVICE_ICON should also be overridden.
Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.template-EA-nodes
MinimumVersion: 2.0.0

Input:
  UPDATE_PREDICATE: pkg_metadata_updated == False
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed.xml
  TEST_VERSION_INSTALLED_GROUP_NAME: '%NAME% test version installed'
  TEST_USERS_GROUP_TEMPLATE: SmartGroup-test-users.xml
  TEST_USERS_GROUP_NAME: '%NAME% test users'
  TESTING_GROUP_TEMPLATE: StaticGroup-testing.xml
  TESTING_GROUP_NAME: Testing
  SELFSERVICE_ICON: '%NAME%.png'
  SELFSERVICE_DISPLAY_NAME: '%NAME% (Testing)'
  REINSTALL_BUTTON_TEXT: Install %version%
  POLICY_TEMPLATE: Policy-untested-selfservice.xml
  POLICY_RUN_COMMAND: echo 'Installation of %NAME% complete'
  POLICY_NAME: '%NAME% (Testing)'
  POLICY_CATEGORY: Untested
  INSTALL_BUTTON_TEXT: Install %version%

Process:
- Processor: com.github.grahampugh.recipes.preprocessors/LastRecipeRunChecker
  Arguments:
    recipeoverride_identifier: '%UNTESTED_RECIPE_IDENTIFIER%'

- Processor: StopProcessingIf
  Arguments:
    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%PKG_CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%PKG_CATEGORY%'
    replace_pkg: 'False'
    replace_pkg_metadata: 'True'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%POLICY_CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfExtensionAttributeUploader
  Arguments:
    ea_name: '%EXTENSION_ATTRIBUTE_NAME%'
    ea_script_path: '%EXTENSION_ATTRIBUTE_SCRIPT%'
    replace_ea: 'True'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%TESTING_GROUP_NAME%'
    computergroup_template: '%TESTING_GROUP_TEMPLATE%'
    replace_group: 'False'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%TEST_USERS_GROUP_NAME%'
    computergroup_template: '%TEST_USERS_GROUP_TEMPLATE%'
    replace_group: 'False'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%TEST_VERSION_INSTALLED_GROUP_NAME%'
    computergroup_template: '%TEST_VERSION_INSTALLED_GROUP_TEMPLATE%'
    replace_group: 'True'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    icon: '%SELFSERVICE_ICON%'
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
    replace_policy: 'True'
