Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.AdobeAcrobatReaderDC-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-nodes
MinimumVersion: "2.3"

Input:
  NAME: Adobe Acrobat Reader DC
  UNTESTED_RECIPE_IDENTIFIER: "local.jamf.AdobeAcrobatReaderDC"
  SCRIPT_NAME: AdobeAcrobatReaderDC-postinstall.sh
  SCRIPT_PATH: AdobeAcrobatReaderDC-postinstall.sh
  SELFSERVICE_ICON: Adobe Acrobat Reader DC 21.png
