Description: |
  Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.AdobeAfterEffectsSDL-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.AdobeCreativeCloudApps-Template-nodes
MinimumVersion: "2.3"

Input:
  NAME: Adobe After Effects 2023 SDL
  JSS_INVENTORY_NAME: Adobe After Effects 2023.app
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.AdobeAfterEffectsSDL
  SELFSERVICE_ICON: Adobe After Effects CC SDL 22.png
  POLICY_RUN_COMMAND: jamf policy -event AdobeCreativeCloudSDL-install-test-version
