Description: |
  Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.AdobeIllustratorSDL-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: Adobe Illustrator SDL
  MAJOR_VERSION: "2022"
  JSS_INVENTORY_NAME: Adobe Illustrator.app
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.AdobeIllustratorSDL
  SELFSERVICE_ICON: Adobe Illustrator 26 SDL.png
