Description: |
  Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.AdobePhotoshopSDL-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: Adobe Photoshop SDL
  MAJOR_VERSION: "2022"
  JSS_INVENTORY_NAME: Adobe Photoshop %MAJOR_VERSION%.app
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.AdobePhotoshopSDL
  SELFSERVICE_ICON: "Adobe Photoshop 2022 SDL.png"
