Description: |
  Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.AdobeLightroomClassicSDL-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: Adobe Lightroom Classic CC 2022 SDL
  JSS_INVENTORY_NAME: Adobe Lightroom Classic.app
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.AdobeLightroomClassicSDL
  SELFSERVICE_ICON: Adobe Lightroom Classic CC SDL.png
  POLICY_RUN_COMMAND: jamf policy -event AdobeCreativeCloudSDL-install-test-version
