Description: |
  Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.AdobePremiereProSDL-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: Adobe Premiere Pro SDL
  MAJOR_VERSION: "2022"
  JSS_INVENTORY_NAME: Adobe Premiere Pro %MAJOR_VERSION%.app
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.AdobePremiereProSDL
  SELFSERVICE_ICON: "Adobe Premiere Pro 2022 SDL.png"
