Description: |
  Creates a Self-Service Policy available to members of a Testing group.

  Required override keys:
  - MAJOR_VERSION
Identifier: com.github.eth-its-recipes.jamf.AdobeIllustratorSDL-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: Adobe Illustrator SDL
  MAJOR_VERSION: "2022"
  JSS_INVENTORY_NAME: Adobe Illustrator %MAJOR_VERSION%.app
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.AdobeIllustratorSDL
  SELFSERVICE_ICON: "Adobe Illustrator 2022 SDL.png"
