Description: |
  Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.AdobeIllustratorSDL-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: Adobe Illustrator 2024 SDL
  JSS_INVENTORY_NAME: Adobe Illustrator 2024.app
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.AdobeIllustratorSDL
  SELFSERVICE_ICON: Adobe Illustrator 26 SDL.png
  POLICY_RUN_COMMAND: jamf policy -event AdobeCreativeCloudSDL-install-test-version
