Description: |
  Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.AdobeAcrobatSDL-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: Adobe Acrobat DC SDL
  JSS_INVENTORY_NAME: Adobe Acrobat.app
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.AdobeAcrobatSDL
  SELFSERVICE_ICON: "Adobe Acrobat DC SDL.png"
