Description: |
  Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.AdobeAfterEffectsSDL-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: Adobe After Effects CC 2022 SDL
  JSS_INVENTORY_NAME: Adobe After Effects CC 2022.app
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.AdobeIllustratorSDL
  SELFSERVICE_ICON: Adobe After Effects CC SDL.png
  POLICY_RUN_COMMAND: jamf policy -event AdobeCreativeCloudSDL-install-test-version
