Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.AdobeRUM-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-EA-nodes
MinimumVersion: "2.3"

Input:
  NAME: Adobe Remote Update Manager
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.AdobeRUM
  TRIGGER_POLICY_NAME: "Install %NAME%"
  EXTENSION_ATTRIBUTE_NAME: Adobe RUM Version
  EXTENSION_ATTRIBUTE_SCRIPT: AdobeRUM-EA.sh
  PKG_CATEGORY: Tools & Accessories
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed-EA.xml
  POLICY_TEMPLATE: Policy-untested-selfservice.xml
  UPDATE_PREDICATE: "pkg_metadata_updated == False"
  SELFSERVICE_ICON: Adobe Creative Cloud 5.3.png
