Description: |
  Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.AdobePhotoshopSDL-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.AdobeCreativeCloudApps-Template-nodes
MinimumVersion: "2.3"

Input:
  NAME: Adobe Photoshop 2023 SDL
  JSS_INVENTORY_NAME: Adobe Photoshop 2023.app
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.AdobePhotoshopSDL
  SELFSERVICE_ICON: Adobe Photoshop 23 SDL.png
  POLICY_RUN_COMMAND: jamf policy -event AdobeCreativeCloudSDL-install-test-version
