Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.AdoptOpenJDK8-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-EA-script-nodes
MinimumVersion: "2.3"

Input:
  NAME: AdoptOpenJDK 8
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.AdoptOpenJDK8
  EXTENSION_ATTRIBUTE_NAME: "AdoptOpenJDK8Version"
  EXTENSION_ATTRIBUTE_SCRIPT: AdoptOpenJDK-EA.sh
  EXTENSION_ATTRIBUTE_VALUE: "8"
  SELFSERVICE_ICON: AdoptOpenJDK.png
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed-EA.xml
  SCRIPT_PATH: AdoptOpenJDK-uninstall.sh
  SCRIPT_NAME: AdoptOpenJDK-uninstall.sh
  SCRIPT_PRIORITY: Before
  SCRIPT_CATEGORY: Uninstallers
  PARAMETER4_LABEL: JDK major version
  PARAMETER4_VALUE: "8"
  POLICY_TEMPLATE: Policy-untested-selfservice-script-parameter4.xml
