Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.Affinity-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: Affinity
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Affinity
  POLICY_RUN_COMMAND: "echo 'Installation of %NAME% complete'"
