Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.AtegraWebFileHandler-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: ATEGRA Web File Handler
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.AtegraWebFileHandler
  SELFSERVICE_ICON: "%NAME%.png"
