Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.Blender-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-platform-nodes
MinimumVersion: "2.3"

Input:
  NAME: Blender
  PLATFORM: arm64
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Blender
  POLICY_TEMPLATE: Policy-untested-selfservice-platform.xml
  PLATFORM_EXCLUSION_GROUP_NAME: "Intel Mac"
  PLATFORM_EXCLUSION: x86_64
  PLATFORM_EXCLUSION_GROUP_TEMPLATE: SmartGroup-platform.xml
