Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.ChemDraw-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: ChemDraw
  JSS_INVENTORY_NAME: ChemDraw 20.app
  MAJOR_VERSION: "20"
  LANGUAGE: EN
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.ChemDraw
  POLICY_RUN_COMMAND: "echo 'Installation of %NAME% %MAJOR_VERSION% complete'"
  POLICY_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% (Testing)"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% (Testing)"
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% test version installed"
  TEST_USERS_GROUP_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% test users"
  SELFSERVICE_ICON: ChemDraw 20.png
  POLICY_TEMPLATE: Policy-untested-selfservice-forcedescription.xml
