Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.ChimeraX-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: ChimeraX
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.ChimeraX
  POLICY_RUN_COMMAND: "mv -f /Applications/ChimeraX-1.9.app /Applications/ChimeraX.app && echo 'Installation of %NAME% complete'"