Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.CiscoSecureClient-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-nodes
MinimumVersion: "2.3"

Input:
  NAME: Cisco Secure Client
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.CiscoSecureClient
  SCRIPT_NAME: CiscoSecureClient-postinstall.zsh
  SCRIPT_PATH: CiscoSecureClient-postinstall.zsh
