Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.CitrixWorkspace-nodes
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-scripts-2-nodes

Input:
  NAME: Citrix Workspace
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.CitrixWorkspace
  PREINSTALL_SCRIPT_NAME: jamf-policy-trigger.sh
  PREINSTALL_SCRIPT_PATH: jamf-policy-trigger.sh
  PREINSTALL_SCRIPT_CATEGORY: Administration
  PREINSTALL_SCRIPT_PRIORITY: Before
  PREINSTALL_PARAMETER4_LABEL: Trigger name
  PREINSTALL_PARAMETER4_VALUE: "%NAME%-uninstall"
  POSTINSTALL_SCRIPT_NAME: CitrixWorkspace-postinstall.zsh
  POSTINSTALL_SCRIPT_PATH: CitrixWorkspace-postinstall.zsh
  POSTINSTALL_SCRIPT_PRIORITY: After
  SELFSERVICE_ICON: Citrix Workspace 22.png
