Description: |
  Creates a Self-Service Policy available to members of a Testing group.

  Required overrides:
  - CLC_LICENSE_SERVER
  - CLC_LICENSE_PORT
Identifier: com.github.eth-its-recipes.jamf.CLCGenomicsWorkbench-arm64-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: CLC Genomics Workbench
  JSS_INVENTORY_NAME: "%NAME% %MAJOR_VERSION%.app"
  MAJOR_VERSION: "24"
  # CLC_LICENSE_SERVER: ++ REPLACE-ME ++
  # CLC_LICENSE_PORT: "++ REPLACE-ME ++"
  PLATFORM: arm64
  LANGUAGE: EN
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.CLCGenomicsWorkbench-arm64
  POLICY_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% %PLATFORM% (Testing)"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% %PLATFORM% (Testing)"
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% test version installed"
  TEST_USERS_GROUP_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% test users"
  POLICY_RUN_COMMAND: 'chown -R "$(stat -f%Su /dev/console):staff" "/Applications/%NAME% %MAJOR_VERSION%" && echo "Corrected permissions for %NAME% %MAJOR_VERSION%."'
  POLICY_TEMPLATE: Policy-untested-selfservice-platform-forcedescription.xml
