Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.Comsol-arm64-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-platform-nodes
MinimumVersion: "2.3"

Input:
  NAME: COMSOL Multiphysics
  PLATFORM: arm64
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Comsol-arm64
  MAJOR_VERSION: "62"
  MAJOR_VERSION_FOLDER_NAME: "62"
  POLICY_NAME: "%NAME% %MAJOR_VERSION_FOLDER_NAME% %PLATFORM% (Testing)"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %MAJOR_VERSION_FOLDER_NAME% %PLATFORM% (Testing)"
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION_FOLDER_NAME% test version installed"
  TEST_USERS_GROUP_NAME: "%NAME% %MAJOR_VERSION_FOLDER_NAME% test users"
  POLICY_RUN_COMMAND: "echo 'Installation of %NAME% %MAJOR_VERSION_FOLDER_NAME% complete'"
  POLICY_TEMPLATE: Policy-untested-selfservice-platform.xml
