Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.Comsol-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: COMSOL Multiphysics
  JSS_INVENTORY_NAME: "COMSOL%APP_FOLDER_VERSION%.app"
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Comsol
  APP_FOLDER_VERSION: "60"
  POLICY_NAME: "%NAME% %APP_FOLDER_VERSION% (Testing)"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %APP_FOLDER_VERSION% (Testing)"
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% %APP_FOLDER_VERSION% test version installed"
  TEST_USERS_GROUP_NAME: "%NAME% %APP_FOLDER_VERSION% test users"
  POLICY_RUN_COMMAND: "echo 'Installation of %NAME% %APP_FOLDER_VERSION% complete'"
