Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.Comsol-arm64-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-platform-script-parameter4-nodes
MinimumVersion: "2.3"

Input:
  NAME: COMSOL Multiphysics
  PLATFORM: arm64
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Comsol-arm64
  MAJOR_VERSION: "64"
  MAJOR_VERSION_FOLDER_NAME: "64"
  PLATFORM_EXCLUSION_GROUP_NAME: "Intel Mac"
  PLATFORM_EXCLUSION: x86_64
  POLICY_NAME: "%NAME% %MAJOR_VERSION_FOLDER_NAME% %PLATFORM% (Testing)"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %MAJOR_VERSION_FOLDER_NAME% %PLATFORM% (Testing)"
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION_FOLDER_NAME% %PLATFORM% test version installed"
  POLICY_RUN_COMMAND: "echo 'Installation of %NAME% %MAJOR_VERSION_FOLDER_NAME% complete'"
  SCRIPT_CATEGORY: Productivity
  SCRIPT_NAME: "Comsol-install.zsh"
  SCRIPT_PATH: "Comsol-install.zsh"
  SCRIPT_PRIORITY: After
  PARAMETER4_VALUE: "%COMSOL_DMG_URL%"
  SP_EXECUTABLE_COMMAND: open '/Applications/COMSOL%MAJOR_VERSION_FOLDER_NAME%/Multiphysics/COMSOL Multiphysics.app'
  SP_PROCESS_NAME: comsollauncher