Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.Comsol-x86_64-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-platform-script-parameter4-nodes
MinimumVersion: "2.3"

Input:
  NAME: COMSOL Multiphysics
  PLATFORM_EXCLUSION_GROUP_NAME: "Apple Silicon Mac"
  PLATFORM_EXCLUSION: arm64
  PLATFORM: x86_64
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Comsol-x86_64
  MAJOR_VERSION: "64"
  MAJOR_VERSION_FOLDER_NAME: "64"
  POLICY_NAME: "%NAME% %MAJOR_VERSION_FOLDER_NAME% %PLATFORM% (Testing)"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %MAJOR_VERSION_FOLDER_NAME% %PLATFORM% (Testing)"
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION_FOLDER_NAME% test version installed"
  POLICY_RUN_COMMAND: "echo 'Installation of %NAME% %MAJOR_VERSION_FOLDER_NAME% complete'"
  SCRIPT_NAME: "Comsol-install.zsh"
  SCRIPT_PRIORITY: After
  PARAMETER4_VALUE: "%COMSOL_DMG_URL%"