Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.CortexXDR-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: Cortex XDR
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.CortexXDR
