Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.DellDisplayAndPeripheralManager-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: Dell Display And Peripheral Manager
  JSS_INVENTORY_NAME: DDPM.app
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.DellDisplayAndPeripheralManager
