Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.DisplayLinkManager-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-OS-minimum-nodes
MinimumVersion: "2.3"

Input:
  NAME: DisplayLink Manager
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.DisplayLinkManager
  POLICY_RUN_COMMAND: "jamf policy -event 'DisplayLink Login Screen Extension-install'"
