Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.Dropbox-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-nodes
MinimumVersion: "2.3"

Input:
  NAME: Dropbox
  UNTESTED_RECIPE_IDENTIFIER: "local.jamf.Dropbox"
  SELFSERVICE_ICON: Dropbox 129.png
