Comment: COMPANY_NUMBER should be manually added in the RecipeOverride (recipe will fail otherwise).

Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.EndNote2025-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-nodes
MinimumVersion: "2.3"

Input:
  NAME: EndNote
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.EndNote2025
  JSS_INVENTORY_NAME: "%NAME% %MAJOR_VERSION%.app"
  MAJOR_VERSION: "2025"
  COMPANY_NAME: ETH ZUERICH
  POLICY_NAME: "%NAME% %MAJOR_VERSION% (Testing)"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %MAJOR_VERSION% (Testing)"
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% test version installed"
  SELFSERVICE_ICON: EndNote 2025.png
  POLICY_RUN_COMMAND: 'chown -R "$(stat -f%Su /dev/console):staff" "/Applications/%NAME% %MAJOR_VERSION%" && echo "Corrected permissions for %NAME% %MAJOR_VERSION%."'
