Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.EndNote-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-nodes
MinimumVersion: "2.3"

Input:
  NAME: EndNote
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.EndNote20
  JSS_INVENTORY_NAME: "%NAME% %MAJOR_VERSION%.app"
  LANGUAGE: EN
  MAJOR_VERSION: "20"
  COMPANY_NAME: ETH ZUERICH
  COMPANY_NUMBER: "++SECRET - TO BE OVERRIDDEN++"
  POLICY_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% (Testing)"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% (Testing)"
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% test version installed"
  TEST_USERS_GROUP_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% test users"
  SELFSERVICE_ICON: EndNote 20.png
  POLICY_RUN_COMMAND: 'chown -R "$(stat -f%Su /dev/console):staff" "/Applications/%NAME% %MAJOR_VERSION%" && echo "Corrected permissions for %NAME% %MAJOR_VERSION%."'
