Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.Enpass-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-nodes
MinimumVersion: "2.3"

Input:
  NAME: Enpass
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Enpass
  POLICY_RUN_COMMAND: chown -R "$(stat -f%Su /dev/console):staff" "/Applications/%NAME%.app" && echo "Corrected permissions for %NAME%."
  SCRIPT_NAME: "%NAME%-preinstall.zsh"
  SCRIPT_PATH: "%NAME%-preinstall.zsh"
  SCRIPT_PRIORITY: Before
  SELFSERVICE_ICON: Enpass 6.png
