Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.erase-install-nodes
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-EA-nodes

Input:
  NAME: erase-install.sh
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.erase-install
  EXTENSION_ATTRIBUTE_NAME: erase-install Version
  EXTENSION_ATTRIBUTE_SCRIPT: erase-install-EA.zsh
  SELFSERVICE_ICON: Erase and Reinstall macOS.png
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed-EA.xml
