Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.ETHDefenderMonitoringTool-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-EA-script-nodes
MinimumVersion: "2.3"

Input:
  NAME: ETH Defender Monitoring Tool
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.ETHDefenderMonitoringTool
  EXTENSION_ATTRIBUTE_NAME: ETH Defender Monitoring Tool Version
  EXTENSION_ATTRIBUTE_SCRIPT: ETHDefenderMonitoringTool-EA.sh
  SCRIPT_NAME: ETHDefenderMonitoringTool-postinstall.sh
  SCRIPT_PATH: ETHDefenderMonitoringTool-postinstall.sh
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed-EA.xml
  SELFSERVICE_ICON: Microsoft Defender.png
