Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.ETHDefenderMonitoringTool-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: ETH Defender Monitoring Tool
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.ETHDefenderMonitoringTool
