Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.Fiji-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-EA-scripts-2-nodes
MinimumVersion: "2.3"

Input:
  NAME: Fiji
  LANGUAGE: EN
  PKG_CATEGORY: Science & Math
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Fiji
  POLICY_NAME: "%NAME% %LANGUAGE% (Testing)"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %LANGUAGE% (Testing)"
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% %LANGUAGE% test version installed"
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed-EA.xml
  EXTENSION_ATTRIBUTE_NAME: "FijiVersion"
  EXTENSION_ATTRIBUTE_SCRIPT: Fiji-EA.zsh
  PREINSTALL_SCRIPT_NAME: "%NAME%-preinstall.zsh"
  PREINSTALL_SCRIPT_PATH: "%NAME%-preinstall.zsh"
  POSTINSTALL_SCRIPT_NAME: "%NAME%-postinstall.zsh"
  POSTINSTALL_SCRIPT_PATH: "%NAME%-postinstall.zsh"
  POLICY_TEMPLATE: Policy-untested-selfservice-scripts-2.xml
