Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.GarageBand-nodes
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-OS-exclude-max-nodes

Input:
  NAME: GarageBand
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.GarageBand
  OS_EXCLUDE_MAX: 10.15.8
