Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.GLPIAgent-arm64-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-EA-script-nodes
MinimumVersion: "2.3"

Input:
  NAME: GLPI-Agent
  #PLATFORM: arm64
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.GLPIAgent-arm64
  #POLICY_NAME: "%NAME% %PLATFORM% (Testing)"
  #SELFSERVICE_DISPLAY_NAME: "%SELFSERVICE_POLICY_NAME%"
  #POLICY_TEMPLATE: Policy-untested-selfservice-platform-script.xml
  #EXTENSION_ATTRIBUTE_NAME: GLPI-Agent Version
  #EXTENSION_ATTRIBUTE_SCRIPT: GLPIAgent-EA.sh
  #SELFSERVICE_ICON: "GLPI-Agent.png"
  #SELFSERVICE_POLICY_NAME: "%NAME% %PLATFORM% (Testing)"
  #TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed-EA.xml
  #PLATFORM_EXCLUSION_GROUP_NAME: "Intel Mac"
  #PLATFORM_EXCLUSION: x86_64
  #PLATFORM_EXCLUSION_GROUP_TEMPLATE: SmartGroup-platform.xml
  #SCRIPT_PATH: GLPIAgent-uninstall.sh
  #SCRIPT_NAME: GLPIAgent-uninstall.sh
  #SCRIPT_PRIORITY: Before
  #POLICY_RUN_COMMAND: "jamf policy -event GLPI-Agent-Configure && echo 'Installation of %NAME% complete'"

