Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.GLPIAgent-arm64-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-EA-script-nodes
MinimumVersion: "2.3"

Input:
  NAME: GLPI-Agent arm64
  POLICY_NAME: "%NAME% %PLATFORM% (Testing)"
  POLICY_TEMPLATE: Policy-untested-selfservice.xml
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.GLPIAgent-arm64
  EXTENSION_ATTRIBUTE_NAME: GLPI-Agent Version
  EXTENSION_ATTRIBUTE_SCRIPT: GLPIAgent-EA.sh
  SELFSERVICE_ICON: "%NAME%.png"
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed-EA.xml
  SCRIPT_PATH: GLPIAgent-uninstall.sh
  SCRIPT_NAME: GLPIAgent-uninstall.sh
  SCRIPT_PRIORITY: Before
  SCRIPT_CATEGORY: Uninstallers
  POLICY_RUN_COMMAND: "jamf policy -event GLPI-Agent-Configure"
  PLATFORM: arm64
