Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.GoogleChrome-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-nodes
MinimumVersion: "2.3"

Input:
  NAME: Google Chrome
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.GoogleChrome
  SELFSERVICE_ICON: Google Chrome 2020.png
  SCRIPT_NAME: GoogleChrome-postinstall.py
  SCRIPT_PATH: GoogleChrome-postinstall.py
