Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.GoogleDrive-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: Google Drive
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.GoogleDrive
  SELFSERVICE_ICON: Google Drive.png
