Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.GoogleChrome-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: 2.0.0

Input:
  NAME: Google Chrome
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.GoogleChrome
  SELFSERVICE_ICON: Google Chrome 2020.png
