Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.GPGSuite-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: GPG Suite
  JSS_INVENTORY_NAME: GPG Keychain.app
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.GPGSuite
  SELFSERVICE_ICON: GPG Keychain.png
