Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.GPGSuite-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-EA-nodes
MinimumVersion: "2.3"

Input:
  NAME: GPG Suite
  JSS_INVENTORY_NAME: GPG Keychain.app
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.GPGSuite
  SELFSERVICE_ICON: GPG Keychain.png
  EXTENSION_ATTRIBUTE_NAME: GPG Suite Version
  EXTENSION_ATTRIBUTE_SCRIPT: VersionStringOverrideFullPath-EA.sh
  VERSION_STRING_TYPE: CFBundleShortVersionString
  VERSION_PLIST: /Library/Application Support/GPGTools/version.plist
