Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.GrandPerspective-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-nodes
MinimumVersion: "2.3"

Input:
  NAME: GrandPerspective
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.GrandPerspective
  APPLICATION_NAME_HAS: GrandPerspective
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed-has.xml
  SELFSERVICE_ICON: GrandPerspective.png
