Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.GraphicConverter-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: GraphicConverter
  MAJOR_VERSION: "12"
  JSS_INVENTORY_NAME: "%NAME% %MAJOR_VERSION%.app"
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.GraphicConverter
  POLICY_RUN_COMMAND: "echo 'Installation of %NAME% %MAJOR_VERSION% complete'"
  POLICY_NAME: "%NAME% %MAJOR_VERSION% (Testing)"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %MAJOR_VERSION% (Testing)"
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% test version installed"
  SELFSERVICE_ICON: "%NAME% %MAJOR_VERSION%.png"
  SP_EXECUTABLE_COMMAND: "open '/Applications/%NAME% %MAJOR_VERSION%.app'"
  SP_PROCESS_NAME: "%NAME%"
