Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.Homebrew-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-EA-nodes
MinimumVersion: "2.3"

Input:
  NAME: Homebrew
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Homebrew
  EXTENSION_ATTRIBUTE_NAME: "Homebrew version"
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: does not match regex
  EXTENSION_ATTRIBUTE_VALUE: "^$"
  EXTENSION_ATTRIBUTE_SCRIPT: Homebrew_version-EA.zsh
  SP_EXECUTABLE_COMMAND: no_app_bundle
  SELFSERVICE_ICON: Homebrew.png
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed-EA.xml


Process: 

  - Processor: com.github.grahampugh.recipes.preprocessors/LastRecipeRunChecker
    Arguments:
      recipeoverride_identifier: "%UNTESTED_RECIPE_IDENTIFIER%"
      ignore_pkg_path: "True"

  - Processor: com.github.rtrouton.SharedProcessors/VariablePlaceholder
    Arguments:
      pkg_path: "%pathname%"
      pkg_version: "%version%"
