Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.IBMStorageProtect-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-scripts-2-nodes
MinimumVersion: "2.3"

Input:
  NAME: IBM Storage Protect
  LANGUAGE: EN
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.IBMStorageProtect
  POLICY_NAME: "%NAME% %LANGUAGE% (Testing)"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %LANGUAGE% (Testing)"
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% %LANGUAGE% test version installed"
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed.xml
  PREINSTALL_SCRIPT_NAME: IBMStorageProtect-preinstall.zsh
  PREINSTALL_SCRIPT_PATH: IBMStorageProtect-preinstall.zsh
  PREINSTALL_SCRIPT_PRIORITY: Before
  POSTINSTALL_SCRIPT_NAME: IBMStorageProtect-postinstall.zsh
  POSTINSTALL_SCRIPT_PATH: IBMStorageProtect-postinstall.zsh
  POSTINSTALL_SCRIPT_PRIORITY: After
  POLICY_TEMPLATE: Policy-untested-selfservice-scripts-2.xml
