Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.IMOD-arm64-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-platform-nodes
MinimumVersion: "2.3"

Input:
  NAME: IMOD
  PLATFORM: arm64
  PKG_CATEGORY: Science & Math
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.IMOD-arm64

  PLATFORM_EXCLUSION_GROUP_NAME: "Intel Mac"
  PLATFORM_EXCLUSION: x86_64
  PLATFORM_EXCLUSION_GROUP_TEMPLATE: SmartGroup-platform.xml

  SP_EXECUTABLE_COMMAND: no_app_bundle