Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.Inkscape-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-OS-minimum-nodes
MinimumVersion: "2.3"

Input:
  NAME: Inkscape
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Inkscape
  POLICY_RUN_COMMAND: 'chown -R "$(stat -f%Su /dev/console):staff" "/Applications/%NAME%.app" && echo "Corrected permissions for %NAME%."'
  SELFSERVICE_ICON: Inkscape 1.2.png
  TEST_VERSION_INELIGIBLE_GROUP_NAME: "%NAME% ineligible for test version"
  TEST_VERSION_INELIGIBLE_GROUP_TEMPLATE: SmartGroup-test-version-ineligible-max.xml
  INELIGIBLE_OS_VERSION: "13.0"
