Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.KeePassXC-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-nodes
MinimumVersion: 2.0.0

Input:
  NAME: KeePassXC
  PARAMETER4_LABEL: Trigger name
  PARAMETER4_VALUE: '%NAME%-uninstall'
  POLICY_NAME: '%NAME% (Testing)'
  POLICY_TEMPLATE: Policy-untested-selfservice-script-parameter4.xml
  SCRIPT_CATEGORY: Administration
  SCRIPT_NAME: jamf-policy-trigger.sh
  SCRIPT_PATH: jamf-policy-trigger.sh
  SCRIPT_PRIORITY: Before
  SELFSERVICE_DISPLAY_NAME: '%NAME% (Testing)'
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.KeePassXC
