Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.LibreOffice-arm64-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-platform-nodes
MinimumVersion: "2.3"

Input:
  NAME: LibreOffice
  PLATFORM: arm64
  ARCH: aarch64
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.LibreOffice-arm64
  POLICY_NAME: "%NAME% %PLATFORM% (Testing)"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %PLATFORM% (Testing)"
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% test version installed"
  PLATFORM_EXCLUSION_GROUP_NAME: "Apple Silicon Mac"
  PLATFORM_EXCLUSION: arm64
  PLATFORM_EXCLUSION_GROUP_TEMPLATE: SmartGroup-platform.xml
  POLICY_CATEGORY: Untested
  POLICY_TEMPLATE: Policy-untested-selfservice-platform.xml
  POLICY_RUN_COMMAND: "echo 'Installation of %NAME% complete'"
  POLICY_TEMPLATE: Policy-untested-selfservice-platform.xml