Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.LogitechPresentation-nodes
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-EA-nodes

Input:
  NAME: Logitech Presentation
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.LogitechPresentation
  EXTENSION_ATTRIBUTE_NAME: LogitechPresentationVersion
  EXTENSION_ATTRIBUTE_SCRIPT: LogitechPresentation-EA.zsh
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed-EA.xml
