Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.LogitechOptionsPlus-nodes
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes

Input:
  NAME: "LogitechOptionsPlus"
  POLICY_NAME: "LogitechOptionsPlus (Testing)"
  SELFSERVICE_DISPLAY_NAME: "LogitechOptionsPlus (Testing)"
  JSS_INVENTORY_NAME: "Logi Options+.app"
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.LogitechOptionsPlus
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed.xml
  LAST_RUN_SELFSERVICE_DESCRIPTION:  |
    Software to enable the configuration of **Logitech** devices.

    **Ensure that you install the software before plugging in the USB dongle or reboot.**

    Version: %version%
    Category: %PKG_CATEGORY%
