Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.LogitechOptionsPlus-nodes
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes

Input:
  NAME: "LogitechOptionsPlus"
  JSS_INVENTORY_NAME: "logioptionsplus.app"
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.LogitechOptionsPlus
  SP_EXECUTABLE_COMMAND: "open '/Applications/%JSS_INVENTORY_NAME%'"
  SP_PROCESS_NAME: "logioptionsplus"

  SCRIPT_NAME: LogitechOptionsPlus-uninstall.sh
  SCRIPT_PRIORITY: Before
  PARAMETER4_VALUE: "logirrelevantPlus"
  POLICY_TEMPLATE: Policy-untested-selfservice-script-parameter4.xml