Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.LogicProX-nodes
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-OS-minimum-nodes

Input:
  NAME: Logic Pro X
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.LogicProX
  SELFSERVICE_ICON: Logic Pro X 10.7.png
