Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.MacEvaluationUtility-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-OS-minimum-nodes
MinimumVersion: "2.3"

Input:
  NAME: Mac Evaluation Utility
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.MacEvaluationUtility
  minimum_os_version: "11.0"
