Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.macOSLAPS-nodes
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-EA-nodes

Input:
  NAME: macOSLAPS
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.macOSLAPS
  EXTENSION_ATTRIBUTE_NAME: macOSLAPS Version
  EXTENSION_ATTRIBUTE_SCRIPT: macOSLAPS-EA.zsh
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed-EA.xml
  PASSWORD_EXTENSION_ATTRIBUTE_NAME: macOSLAPS password
  PASSWORD_EXTENSION_ATTRIBUTE_SCRIPT: macOSLAPS-password-EA.sh
  EXPIRY_EXTENSION_ATTRIBUTE_NAME: macOSLAPS expiration
  EXPIRY_EXTENSION_ATTRIBUTE_SCRIPT: macOSLAPS-expieration-EA.sh

Process:
  # extra processors for the two EAs that are used to collect the password and expiration
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfExtensionAttributeUploader
    Arguments:
      ea_script_path: "%PASSWORD_EXTENSION_ATTRIBUTE_SCRIPT%"
      ea_name: "%PASSWORD_EXTENSION_ATTRIBUTE_NAME%"
      replace_ea: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfExtensionAttributeUploader
    Arguments:
      ea_script_path: "%EXPIRY_EXTENSION_ATTRIBUTE_SCRIPT%"
      ea_name: "%EXPIRY_EXTENSION_ATTRIBUTE_NAME%"
      replace_ea: "True"

