Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.macOSLAPS-nodes
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-EA-nodes

Input:
  NAME: macOSLAPS
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.macOSLAPS
  EXTENSION_ATTRIBUTE_NAME: macOSLAPS Version
  EXTENSION_ATTRIBUTE_SCRIPT: macOSLAPS-EA.sh
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed-EA.xml
