Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Comment: Requires adding the FLOATING_LICENSE_URL key to the override.
Identifier: com.github.eth-its-recipes.jamf.Maple-Node-nodes
ParentRecipe: com.github.eth-its-recipes.pkg.Maple
MinimumVersion: "2.3"

Input:
  NAME: Maple
  LICENSE: Node
  MAJOR_VERSION: "2021"
  LANGUAGE: EN
  POLICY_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% %LICENSE% (Testing)"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% %LICENSE% (Testing)"
  LIST_MAJOR_VERSION: "2021"
  PKG_CATEGORY: Science & Math
  POLICY_CATEGORY: Untested
  SELFSERVICE_DESCRIPTION: |
    # %NAME% %MAJOR_VERSION% (%LICENSE% license)

    Maple is mathematics software that combines the world's most powerful mathematics engine with an interface that makes it extremely easy to analyze, explore, visualize, and solve mathematical problems.

    Version: %version%
    Category: %PKG_CATEGORY%
  SCRIPT_PATH: Maple-license-activation.zsh
  SCRIPT_NAME: Maple-license-activation.zsh
  SCRIPT_PRIORITY: After
  PARAMETER4_TITLE: Major Version e.g. 2021
  PARAMETER5_TITLE: License type, Node or Floating
  PARAMETER4_VALUE: "%MAJOR_VERSION%"
  PARAMETER5_VALUE: "%LICENSE%"
  PARAMETER6_VALUE: " "
  PARAMETER7_VALUE: " "
  PARAMETER8_VALUE: " "
  PARAMETER9_VALUE: " "
  PARAMETER10_VALUE: " "
  PARAMETER11_VALUE: " "
  EXTENSION_ATTRIBUTE_NAME: Maple License Type
  EXTENSION_ATTRIBUTE_SCRIPT: Maple-EA.sh
  EXTENSION_ATTRIBUTE_VALUE: "%LICENSE%"
  TRIGGER_NAME: "Activate-%NAME%-%MAJOR_VERSION%-%LICENSE%-License"
  TRIGGER_POLICY_NAME: "Trigger Activate %NAME% %MAJOR_VERSION% %LANGUAGE% %LICENSE% License"
  TRIGGER_POLICY_TEMPLATE: Policy-script-triggeronly.xml
  TRIGGER_POLICY_CATEGORY: Triggered Installers
  TRIGGER_POLICY_RUN_COMMAND: "echo 'Installation of %TRIGGER_POLICY_NAME% complete'"
  LICENSE_SET_POLICY_NAME: "Activate %NAME% %MAJOR_VERSION% %LANGUAGE% %LICENSE% License"
  LICENSE_SET_POLICY_TEMPLATE: Policy-prod-selfservice-install-license-script.xml
  LICENSE_SET_SELFSERVICE_DISPLAY_NAME: "Activate %NAME% %MAJOR_VERSION% %LANGUAGE% %LICENSE% License"
  LICENSE_SET_SELFSERVICE_DESCRIPTION: "Activates the %NAME% %MAJOR_VERSION% %LANGUAGE% %LICENSE% License"
  LICENSE_SET_INSTALL_BUTTON_TEXT: Activate
  LICENSE_SET_REINSTALL_BUTTON_TEXT: Activate
  LICENSE_SET_MESSAGE_FINISH: "%NAME% %MAJOR_VERSION% %LANGUAGE% %LICENSE% License activated"
  LICENSE_INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% %LICENSE% License activated"
  LICENSE_INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-for-license-EA.xml
  MESSAGE_FINISH: "%NAME% %MAJOR_VERSION% %LANGUAGE% %LICENSE% License is now activated"
  SELFSERVICE_ICON: Maple 2021.png
  TESTING_GROUP_NAME: Testing
  TESTING_GROUP_TEMPLATE: StaticGroup-testing.xml
  INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% %LICENSE% installed"
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed.xml
  TEST_USERS_GROUP_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% %LICENSE% test users"
  TEST_USERS_GROUP_TEMPLATE: SmartGroup-test-users.xml
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% %LICENSE% test version installed"
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed.xml
  USERS_GROUP_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% %LICENSE% users"
  USERS_GROUP_TEMPLATE: SmartGroup-users.xml
  INSTALL_BUTTON_TEXT: "Install %version%"
  REINSTALL_BUTTON_TEXT: "Install %version%"
  POLICY_TEMPLATE: Policy-untested-selfservice.xml
  POLICY_RUN_COMMAND: "jamf policy -event '%TRIGGER_NAME%'"
  UPDATE_PREDICATE: "pkg_metadata_updated == False"

Process:
  - Processor: com.github.grahampugh.recipes.preprocessors/LastRecipeRunChecker
    Arguments:
      recipeoverride_identifier: "%UNTESTED_RECIPE_IDENTIFIER%"

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"

  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%PKG_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      replace_pkg: "False"
      replace_pkg_metadata: "True"
      pkg_category: "%PKG_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%TRIGGER_POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "%POLICY_CATEGORY%"
      script_name: "%SCRIPT_NAME%"
      script_path: "%SCRIPT_PATH%"
      script_priority: "%SCRIPT_PRIORITY%"
      script_parameter4: "%PARAMETER4_TITLE%"
      script_parameter5: "%PARAMETER5_TITLE%"
      replace_script: True

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfExtensionAttributeUploader
    Arguments:
      ea_script_path: "%EXTENSION_ATTRIBUTE_SCRIPT%"
      ea_name: "%EXTENSION_ATTRIBUTE_NAME%"
      replace_ea: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%TESTING_GROUP_TEMPLATE%"
      computergroup_name: "%TESTING_GROUP_NAME%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%TEST_USERS_GROUP_NAME%"
      computergroup_template: "%TEST_USERS_GROUP_TEMPLATE%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%TEST_VERSION_INSTALLED_GROUP_NAME%"
      computergroup_template: "%TEST_VERSION_INSTALLED_GROUP_TEMPLATE%"
      replace_group: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%USERS_GROUP_NAME%"
      computergroup_template: "%USERS_GROUP_TEMPLATE%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%INSTALLED_GROUP_NAME%"
      computergroup_template: "%INSTALLED_GROUP_TEMPLATE%"
      replace_group: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%LICENSE_INSTALLED_GROUP_NAME%"
      computergroup_template: "%LICENSE_INSTALLED_GROUP_TEMPLATE%"
      replace_group: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Comment: Trigger policy for activating the license
    Arguments:
      policy_template: "%TRIGGER_POLICY_TEMPLATE%"
      policy_name: "%TRIGGER_POLICY_NAME%"
      replace_policy: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Comment: Self Service policy for activating the license
    Arguments:
      policy_template: "%LICENSE_SET_POLICY_TEMPLATE%"
      policy_name: "%LICENSE_SET_POLICY_NAME%"
      replace_policy: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Comment: Untested Self Service policy
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      icon: "%SELFSERVICE_ICON%"
      replace_policy: "True"
