Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.Mathematica-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: Mathematica
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Mathematica
  POLICY_RUN_COMMAND: jamf policy -event Mathematica-license
