Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.Mathematica-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: Mathematica
  LANGUAGE: EN
  MAJOR_VERSION: 13
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Mathematica
  POLICY_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% (Testing)"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% (Testing)"
  POLICY_RUN_COMMAND: jamf policy -event Mathematica-license
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% test version installed"
  TEST_USERS_GROUP_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% test users"
