Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.MEGA-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: MEGA
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.MEGA
  JSS_INVENTORY_NAME: "MEGA 12.app"
  SP_EXECUTABLE_COMMAND: "open -a '%JSS_INVENTORY_NAME%'"
  SP_PROCESS_NAME: "MEGA 12"