Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.MendeleyReferenceManager-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: Mendeley Reference Manager
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.MendeleyReferenceManager
