Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.MestReNova-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-nodes
MinimumVersion: "2.3"

Input:
  NAME: MestReNova
  LANGUAGE: EN
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.MestReNova
  SCRIPT_NAME: "%NAME%-postinstall.zsh"
  SCRIPT_PATH: "%NAME%-postinstall.zsh"
  POLICY_NAME: "%NAME% %LANGUAGE% (Testing)"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %LANGUAGE% (Testing)"
  POLICY_RUN_COMMAND: "jamf policy -event 'MestReNova License-install'"
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% %LANGUAGE% test version installed"
  POLICY_TEMPLATE: Policy-untested-selfservice-script-forcedescription.xml
