Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftOfficeLicenseReset-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-noexclusions-nodes
MinimumVersion: "2.3"

Input:
  NAME: Microsoft Office License Reset
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.MicrosoftOfficeLicenseReset
  INSTALL_BUTTON_TEXT: "Reset License"
  REINSTALL_BUTTON_TEXT: "Reset License"
  SELFSERVICE_ICON: "Microsoft Office Factory Reset.png"
  POLICY_RUN_COMMAND: "echo '%NAME% complete'"
  POLICY_MESSAGE_START: "Resetting Microsoft Office License"
  POLICY_MESSAGE_FINISH: "Microsoft Office License has now been reset"
