Comment: FEED_URL must be added to the override.
Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftRemoteDesktop-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-nodes
MinimumVersion: "2.3"

Input:
  NAME: Microsoft Remote Desktop
  UNTESTED_RECIPE_IDENTIFIER: "local.jamf.MicrosoftRemoteDesktop"
  SCRIPT_NAME: MicrosoftRemoteDesktop-preinstall.sh
  SCRIPT_PATH: MicrosoftRemoteDesktop-preinstall.sh
  SCRIPT_PRIORITY: Before
  POLICY_RUN_COMMAND: sudo -u "$(stat -f%Su /dev/console)" -i /Applications/Microsoft\ Remote\ Desktop.app/Contents/MacOS/Microsoft\ Remote\ Desktop --script feed write "%FEED_URL%" --accept-certificates
  SELFSERVICE_ICON: "%NAME% 10.png"
