Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftOffice-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-OS-exclude-max-nodes
MinimumVersion: "2.3"

Input:
  NAME: Microsoft Office
  JSS_INVENTORY_NAME: Microsoft Word.app
  PKG_CATEGORY: Productivity
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.MicrosoftOffice
  OS_EXCLUDE_MAX: 10.14.6
  SELFSERVICE_ICON: "Microsoft Office 365.png"
