Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftTeamsWorkOrSchool-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: Microsoft Teams (work or school)
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.MicrosoftTeamsWorkOrSchool
  SELFSERVICE_ICON: Microsoft Teams 5.png
