Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftEdge-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: Microsoft Edge
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.MicrosoftEdge
  SELFSERVICE_ICON: Microsoft Edge 100.png
