Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftAutoUpdate-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-EA-nodes
MinimumVersion: "2.3"

Input:
  NAME: Microsoft AutoUpdate
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.AdoptOpenJDK11
  EXTENSION_ATTRIBUTE_NAME: "Microsoft AutoUpdate Version"
  EXTENSION_ATTRIBUTE_SCRIPT: MicrosoftAutoUpdate-EA.sh
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed-EA.xml
