Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftTeams-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: Microsoft Teams
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.MicrosoftTeams
  APPLICATION_NAME_HAS: Microsoft Teams
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed-has.xml
  SELFSERVICE_ICON: Microsoft Teams 5.png
