Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftOfficeRemoval-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-noexclusions-nodes
MinimumVersion: "2.3"

Input:
  NAME: Microsoft Office - Complete Removal
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.MicrosoftOfficeRemoval
  INSTALL_BUTTON_TEXT: "Uninstall"
  REINSTALL_BUTTON_TEXT: "Uninstall"
  POLICY_RUN_COMMAND: "echo '%NAME% complete'"
  POLICY_MESSAGE_START: "Completely removing Microsoft Office and all settings"
  POLICY_MESSAGE_FINISH: "Completely removed Microsoft Office and all settings"
  SELFSERVICE_ICON: "Microsoft Office Factory Reset.png"
