Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftOfficeSerializer-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-EA-2customexclusions-nodes
MinimumVersion: "2.3"

Input:
  NAME: Microsoft Office LTSC 2021 Volume License
  JSS_INVENTORY_NAME: Microsoft Word.app
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.MicrosoftOfficeSerializer
  INSTALL_BUTTON_TEXT: "Install License"
  REINSTALL_BUTTON_TEXT: "Install License"
  SELFSERVICE_ICON: Microsoft Office 365.png
  POLICY_RUN_COMMAND: "echo '%NAME% installation complete'"
  POLICY_MESSAGE_START: "Installing %NAME%"
  POLICY_MESSAGE_FINISH: "%NAME% has now been installed"
  EXTENSION_ATTRIBUTE_NAME: Microsoft Office License Type
  EXTENSION_ATTRIBUTE_SCRIPT: MicrosoftOfficeLicense-EA.zsh
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: matches regex
  EXTENSION_ATTRIBUTE_VALUE: "2021"
  TESTING_GROUP_NAME: Testing - Microsoft Office LTSC 2021
  TESTING_GROUP_TEMPLATE: StaticGroup-testing.xml
  TEST_USERS_GROUP_NAME: "Microsoft Office LTSC 2021 test users"
  TEST_USERS_GROUP_TEMPLATE: SmartGroup-test-users.xml
  EXCLUSION1_GROUP_NAME: "Microsoft Office LTSC 2021 installed"
  EXCLUSION1_GROUP_TEMPLATE: SmartGroup-exclusion-EA.xml
  EXCLUSION2_GROUP_NAME: "Microsoft Office not installed"
  EXCLUSION2_GROUP_TEMPLATE: SmartGroup-not-installed.xml
