Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftRemoteDesktop-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-nodes
MinimumVersion: "2.3"

Input:
  NAME: Microsoft Remote Desktop
  UNTESTED_RECIPE_IDENTIFIER: "local.jamf.MicrosoftRemoteDesktop"
  SCRIPT_NAME: MicrosoftRemoteDesktop-preinstall.sh
  SCRIPT_PATH: MicrosoftRemoteDesktop-preinstall.sh
  SCRIPT_PRIORITY: Before
