Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.MicrosotRemoteDesktop-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-nodes
MinimumVersion: "2.3"

Input:
  NAME: Microsot Remote Desktop
  UNTESTED_RECIPE_IDENTIFIER: "local.jamf.MicrosotRemoteDesktop"
  SCRIPT_NAME: MicrosotRemoteDesktop-preinstall.sh
  SCRIPT_PATH: MicrosotRemoteDesktop-preinstall.sh
  SCRIPT_PRIORITY: Before
