Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftOffice2019Serializer-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-EA-2customexclusions-nodes
MinimumVersion: "2.3"

Input:
  NAME: Microsoft Office 2019 Volume License
  JSS_INVENTORY_NAME: Microsoft Word.app
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.MicrosoftOffice2019Serializer
  INSTALL_BUTTON_TEXT: "Install License"
  REINSTALL_BUTTON_TEXT: "Install License"
  EXTENSION_ATTRIBUTE_NAME: Microsoft Office License Type
  EXTENSION_ATTRIBUTE_SCRIPT: MicrosoftOfficeLicense-EA.zsh
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: matches regex
  EXTENSION_ATTRIBUTE_VALUE: "2019"
  TESTING_GROUP_NAME: Testing - Microsoft Office 2019
  TESTING_GROUP_TEMPLATE: StaticGroup-testing.xml
  TEST_USERS_GROUP_NAME: "Microsoft Office 2019 test users"
  TEST_USERS_GROUP_TEMPLATE: SmartGroup-test-users.xml
  EXCLUSION1_GROUP_NAME: "Microsoft Office 2019 installed"
  EXCLUSION1_GROUP_TEMPLATE: SmartGroup-exclusion-EA.xml
  EXCLUSION2_GROUP_NAME: "Microsoft Office not installed"
  EXCLUSION2_GROUP_TEMPLATE: SmartGroup-not-installed.xml
  TRIGGER_POLICY_NAME: "Install %NAME% Serializer"
  TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly.xml
  TRIGGER_POLICY_CATEGORY: Triggered Installers
  TRIGGER_POLICY_RUN_COMMAND: "echo 'Installation of %NAME% complete'"
  TRIGGER_NAME: MSOffice2019-volumelicense
  SELFSERVICE_POLICY_NAME: "%NAME% (Testing)"
  SELFSERVICE_DISPLAY_NAME: "%NAME% (Testing)"
  SELFSERVICE_POLICY_TEMPLATE: Policy-untested-selfservice-runcommand-2customexclusions.xml
  SELFSERVICE_POLICY_CATEGORY: Untested
  SELFSERVICE_POLICY_RUN_COMMAND: "jamf policy -event '%TRIGGER_NAME%'"
  SELFSERVICE_POLICY_MESSAGE_START: "Installing %NAME%"
  SELFSERVICE_POLICY_MESSAGE_FINISH: "%NAME% has now been installed"
  SELFSERVICE_ICON: Microsoft Office 365.png
