Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.MindManager-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-scripts-2-nodes
MinimumVersion: "2.3"

Input:
  NAME: MindManager
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.MindManager
  SELFSERVICE_ICON: "%NAME% 23.png"
  PREINSTALL_SCRIPT_NAME: jamf-policy-trigger.sh
  PREINSTALL_SCRIPT_PATH: jamf-policy-trigger.sh
  PREINSTALL_SCRIPT_CATEGORY: Administration
  PREINSTALL_SCRIPT_PRIORITY: Before
  PREINSTALL_SCRIPT_PARAMETER4_LABEL: Trigger name
  PREINSTALL_SCRIPT_PARAMETER4_VALUE: "%NAME%-uninstall"
  POSTINSTALL_SCRIPT_NAME: "%NAME%-postinstall.sh"
  POSTINSTALL_SCRIPT_PATH: "%NAME%-postinstall.sh"
  POSTINSTALL_SCRIPT_PRIORITY: After
