Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.NiceUpdater2-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-EA-nodes
MinimumVersion: "2.3"

Input:
  NAME: macOS Managed Updates
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.NiceUpdater2
  EXTENSION_ATTRIBUTE_NAME: macOS Managed Updates Tool Version
  EXTENSION_ATTRIBUTE_SCRIPT: NiceUpdater2-EA.sh
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: is
  EXTENSION_ATTRIBUTE_SEARCH_VALUE: "%version%"
  SELFSERVICE_ICON: Software Update.png
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed-EA.xml
