Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.NotepadPlusPlus-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: NotepadPlusPlus
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.NotepadPlusPlus
  APPLICATION_NAME_HAS: Notepad++
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed-has.xml
  SELFSERVICE_ICON: NotepadPlusPlus.png
