Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftEdge-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: Nudge
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Nudge
  SELFSERVICE_ICON: Nudge.png
  TYPE: "_Suite"