Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.Nudge-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: Nudge
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Nudge
  SELFSERVICE_ICON: Nudge.png
  TYPE: "_Suite"
  SP_EXECUTABLE_COMMAND: "open -n /Applications/Utilities/Nudge.app --args -disable-random-delay -simulate-hardware-id J704AP -simulate-os-version 26.0.1"
  SP_PROCESS_NAME: "Nudge"