Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.OmnissaHorizonClient-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-scripts-2-nodes
MinimumVersion: "2.3"

Input:
  NAME: Omnissa Horizon Client
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.OmnissaHorizonClient
  PREINSTALL_SCRIPT_NAME: jamf-policy-trigger.sh
  PREINSTALL_SCRIPT_PATH: jamf-policy-trigger.sh
  PREINSTALL_SCRIPT_CATEGORY: Administration
  PREINSTALL_SCRIPT_PRIORITY: Before
  PREINSTALL_SCRIPT_PARAMETER4_LABEL: Trigger name
  PREINSTALL_SCRIPT_PARAMETER4_VALUE: "VMWareHorizonClient-uninstall"
  POSTINSTALL_SCRIPT_NAME: OmnissaHorizonClient-postinstall.zsh
  POSTINSTALL_SCRIPT_PATH: OmnissaHorizonClient-postinstall.zsh
  POSTINSTALL_SCRIPT_PRIORITY: After
  SELFSERVICE_ICON: "%NAME%.png"
