Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.OpenScapeClient-nodes
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-EA-nodes

Input:
  NAME: OpenScape Client
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.OpenScapeClient
  JSS_INVENTORY_NAME: UCDesktopApp.app
  VERSION_STRING_TYPE: CFBundleVersion
  EXTENSION_ATTRIBUTE_NAME: OpenScape Client Version
  EXTENSION_ATTRIBUTE_SCRIPT: VersionStringOverride-EA.sh
  SELFSERVICE_ICON: OpenScape Client.png
