Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.OxygenXMLEditor-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: Oxygen XML Editor
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.OxygenXMLEditor
  APPLICATION_NAME_HAS: "%NAME%"
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed-has.xml
  SELFSERVICE_ICON: OxygenXMLEditor.png
