Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.Papers-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-nodes
MinimumVersion: "2.3"

Input:
  NAME: Papers
  LANGUAGE: EN
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Papers
  POLICY_NAME: "%NAME% %LANGUAGE% (Testing)"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %LANGUAGE% (Testing)"
  POLICY_TEMPLATE: Policy-untested-selfservice-script-parameter4.xml
  SCRIPT_NAME: jamf-policy-trigger.sh
  SCRIPT_PATH: jamf-policy-trigger.sh
  SCRIPT_CATEGORY: Administration
  SCRIPT_PRIORITY: Before
  PARAMETER4_LABEL: Trigger name
  PARAMETER4_VALUE: "%NAME%-uninstall"
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% %LANGUAGE% test version installed"
  TEST_USERS_GROUP_NAME: "%NAME% %LANGUAGE% test users"
