Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.Papers-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-nodes
MinimumVersion: 2.0.0

Input:
  NAME: Papers
  LANGUAGE: EN
  PARAMETER4_LABEL: Trigger name
  PARAMETER4_VALUE: '%NAME%-uninstall'
  POLICY_NAME: '%NAME% %LANGUAGE% (Testing)'
  POLICY_TEMPLATE: Policy-untested-selfservice-script-parameter4.xml
  SCRIPT_CATEGORY: Administration
  SCRIPT_NAME: jamf-policy-trigger.sh
  SCRIPT_PATH: jamf-policy-trigger.sh
  SCRIPT_PRIORITY: Before
  SELFSERVICE_DISPLAY_NAME: '%NAME% %LANGUAGE% (Testing)'
  TEST_USERS_GROUP_NAME: '%NAME% %LANGUAGE% test users'
  TEST_VERSION_INSTALLED_GROUP_NAME: '%NAME% %LANGUAGE% test version installed'
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Papers
