Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.ParallelsDesktop-nodes
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes

Input:
  NAME: Parallels Desktop
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.ParallelsDesktop
  POLICY_TEMPLATE: Policy-untested-selfservice-forcedescription.xml
