Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.polybox-nodes
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes

Input:
  NAME: polybox
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.polybox
