Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.polybox-nodes
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-EA-nodes

Input:
  NAME: polybox
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.polybox
  JSS_INVENTORY_NAME: polybox.app
  VERSION_STRING_TYPE: CFBundleVersion
  EXTENSION_ATTRIBUTE_NAME: polybox Version
  EXTENSION_ATTRIBUTE_SCRIPT: VersionStringOverride-EA.sh
  SELFSERVICE_ICON: polybox 2.10.png
