Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.Prism-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: Prism
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Prism
  SELFSERVICE_ICON: "Prism 9.png"
  POLICY_TEMPLATE: Policy-untested-selfservice-script-forcedescription.xml