Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.Privileges-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-dockitem-nodes
MinimumVersion: "2.3"

Input:
  NAME: Privileges
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Privileges
  SELFSERVICE_ICON: "Privileges2.png"
  POLICY_RUN_COMMAND: sudo -u "$(stat -f%Su /dev/console)" "/Applications/Privileges.app/Contents/MacOS/PrivilegesCLI" -r
