Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.PyCharm-arm64-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-platform-nodes
MinimumVersion: "2.3"

Input:
  NAME: PyCharm
  PLATFORM: arm64
  PLATFORM_EXCLUSION: x86_64
  PLATFORM_EXCLUSION_GROUP_NAME: "Intel Mac"
  ARCH_TYPE: macM1 # use 'mac' for intel ; 'macM1' for silicon
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.PyCharm-arm64
  JSS_INVENTORY_NAME: "%NAME%.app"
  VERSION_STRING_TYPE: CFBundleVersion