Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.PyMOL-nodes
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes

Input:
  NAME: PyMOL
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.PyMOL
  POLICY_RUN_COMMAND: "jamf policy -event 'PyMOL License-install'"
