Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.Quicksilver-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: Quicksilver
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Quicksilver
  SELFSERVICE_ICON: Quicksilver 2.1.png
