
Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.R-arm64-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-platform-EA-scripts-2-nodes
MinimumVersion: "2.3"

Input:
  NAME: R
  PLATFORM: arm64
  ARCH: "%PLATFORM%"
  PLATFORM_EXCLUSION_GROUP_NAME: "Intel Mac"
  PLATFORM_EXCLUSION: x86_64
  PLATFORM_EXCLUSION_GROUP_TEMPLATE: SmartGroup-platform.xml
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.R-arm64
  EXTENSION_ATTRIBUTE_NAME: "R Version"
  EXTENSION_ATTRIBUTE_SCRIPT: R-EA.zsh
  PREINSTALL_SCRIPT_NAME: jamf-policy-trigger.sh
  PREINSTALL_SCRIPT_PATH: jamf-policy-trigger.sh
  PREINSTALL_SCRIPT_CATEGORY: Administration
  PREINSTALL_SCRIPT_PARAMETER4_LABEL: Trigger name
  PREINSTALL_SCRIPT_PARAMETER4_VALUE: XcodeCLTools-install
  POSTINSTALL_SCRIPT_NAME: R-postinstall.sh
  POSTINSTALL_SCRIPT_PATH: R-postinstall.sh
  POSTINSTALL_SCRIPT_PARAMETER4_VALUE: "None"
  skip_script_key_substitution: "True"
