Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.Rectangle-nodes
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes

Input:
  NAME: Rectangle
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Rectangle
  SELFSERVICE_ICON: Rectangle 0.5.png
