Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.RStudio-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: RStudio
  LANGUAGE: EN
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.RStudio
  POLICY_NAME: RStudio EN (Testing)
  SELFSERVICE_DISPLAY_NAME: RStudio EN (Testing)
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% %LANGUAGE% test version installed"
  POLICY_TEMPLATE: Policy-untested-selfservice-forcedescription.xml
  SELFSERVICE_ICON: "%NAME% 2021.png"
