Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.SeqMonk-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-nodes
MinimumVersion: "2.3"

Input:
  NAME: SeqMonk
  LANGUAGE: EN
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.SeqMonk
  POLICY_NAME: "%NAME% %LANGUAGE% (Testing)"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %LANGUAGE% (Testing)"
  POLICY_TEMPLATE: Policy-untested-selfservice-script.xml
  SCRIPT_NAME: JDK-preinstall-check.sh
  SCRIPT_PATH: JDK-preinstall-check.sh
  SCRIPT_CATEGORY: Administration
  SCRIPT_PRIORITY: Before
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% %LANGUAGE% test version installed"
  TEST_USERS_GROUP_NAME: "%NAME% %LANGUAGE% test users"
