Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.silnite-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-EA-script-nodes
MinimumVersion: "2.3"

Input:
  NAME: silnite
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.silnite
  SELFSERVICE_ICON: Terminal.png
  SCRIPT_NAME: "%NAME%-postinstall.zsh"
  SCRIPT_PATH: "%NAME%-postinstall.zsh"
  EXTENSION_ATTRIBUTE_NAME: silnite Version
  EXTENSION_ATTRIBUTE_SCRIPT: silnite-EA.zsh
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed-EA.xml
