Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.Skim-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: Skim
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Skim
  SELFSERVICE_ICON: Skim 1.6.png
