Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.SnapGene-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: SnapGene
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.SnapGene
  LAST_RUN_SELFSERVICE_DESCRIPTION:  |
    The Industry's Most Popular Molecular Cloning Tool 

    Version: %version%
    Category: %PKG_CATEGORY%
