Description: |
  Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.SPSSStatistics-nodes
MinimumVersion: "2.3"

Input:
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.SPSSStatistics
  NAME: SPSS Statistics
  MAJOR_VERSION: "29"
  PKG_CATEGORY: Science & Math
  POLICY_CATEGORY: Untested
  PREINSTALL_SCRIPT_PATH: SPSSStatistics-preinstall.sh
  PREINSTALL_SCRIPT_NAME: SPSSStatistics28-preinstall.sh
  PREINSTALL_SCRIPT_PRIORITY: Before
  POSTINSTALL_SCRIPT_PATH: SPSSStatistics-postinstall.sh
  POSTINSTALL_SCRIPT_NAME: SPSSStatistics28-postinstall.sh
  POSTINSTALL_SCRIPT_PRIORITY: After
  SCRIPT_PATH: SPSSStatistics-floating-license-activation.sh
  SCRIPT_NAME: SPSSStatistics28-floating-license-activation.sh
  SCRIPT_PRIORITY: After
  EXTENSION_ATTRIBUTE_NAME: "SPSSStatistics %MAJOR_VERSION% License"
  EXTENSION_ATTRIBUTE_SCRIPT: SPSSStatistics-EA.sh
  EXTENSION_ATTRIBUTE_VALUE: Floating
  TRIGGER_NAME: "Activate-SPSS-%MAJOR_VERSION%-Floating-License"
  TRIGGER_POLICY_NAME: "Trigger Activate SPSS Statistics %MAJOR_VERSION% Floating License"
  TRIGGER_POLICY_TEMPLATE: Policy-script-triggeronly.xml
  TRIGGER_POLICY_CATEGORY: Triggered Installers
  TRIGGER_POLICY_RUN_COMMAND: "echo 'Installation of %POLICY_NAME% complete'"
  SELFSERVICE_POLICY_CATEGORY: Science & Math
  LICENSE_SET_POLICY_NAME: "Activate SPSS Statistics %MAJOR_VERSION% Floating License"
  LICENSE_SET_POLICY_TEMPLATE: Policy-prod-selfservice-install-license.xml
  LICENSE_SET_SELFSERVICE_DISPLAY_NAME: "Activate SPSS Statistics %MAJOR_VERSION% Floating License"
  LICENSE_SET_SELFSERVICE_DESCRIPTION: "Activates the SPSS Statistics %MAJOR_VERSION% Floating License"
  LICENSE_SET_INSTALL_BUTTON_TEXT: Activate
  LICENSE_SET_REINSTALL_BUTTON_TEXT: Activate
  LICENSE_SET_MESSAGE_FINISH: "SPSS Statistics %MAJOR_VERSION% Floating License activated"
  LICENSE_INSTALLED_GROUP_NAME: "SPSS Statistics %MAJOR_VERSION% Floating License activated"
  LICENSE_INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-for-license-EA.xml
  MESSAGE_FINISH: "SPSS Statistics %MAJOR_VERSION% Floating License is now activated"
  SELFSERVICE_ICON: SPSS Statistics 28.png
  POLICY_NAME: "SPSS Statistics %MAJOR_VERSION% (Testing)"
  SELFSERVICE_DISPLAY_NAME: "SPSS Statistics %MAJOR_VERSION% (Testing)"
  TESTING_GROUP_NAME: Testing
  TESTING_GROUP_TEMPLATE: StaticGroup-testing.xml
  INSTALLED_GROUP_NAME: "SPSS Statistics %MAJOR_VERSION% installed"
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed.xml
  TEST_USERS_GROUP_NAME: "%NAME% %MAJOR_VERSION% test users"
  TEST_USERS_GROUP_TEMPLATE: SmartGroup-test-users.xml
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% test version installed"
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed.xml
  USERS_GROUP_NAME: "%NAME% %MAJOR_VERSION% users"
  USERS_GROUP_TEMPLATE: SmartGroup-users.xml
  INSTALL_BUTTON_TEXT: "Install %version%"
  REINSTALL_BUTTON_TEXT: "Install %version%"
  POLICY_TEMPLATE: Policy-untested-selfservice-scripts-2.xml
  POLICY_RUN_COMMAND: "jamf policy -event '%TRIGGER_NAME%'"
  UPDATE_PREDICATE: "pkg_metadata_updated == False"

Process:
  - Processor: com.github.grahampugh.recipes.preprocessors/LastRecipeRunChecker
    Arguments:
      recipeoverride_identifier: "%UNTESTED_RECIPE_IDENTIFIER%"

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"

  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%PKG_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      replace_pkg: "False"
      replace_pkg_metadata: "True"
      pkg_category: "%PKG_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%TRIGGER_POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "%POLICY_CATEGORY%"
      script_name: "%SCRIPT_NAME%"
      script_path: "%SCRIPT_PATH%"
      script_priority: "%SCRIPT_PRIORITY%"
      replace_script: True

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "%POLICY_CATEGORY%"
      script_name: "%PREINSTALL_SCRIPT_NAME%"
      script_path: "%PREINSTALL_SCRIPT_PATH%"
      script_priority: "%PREINSTALL_SCRIPT_PRIORITY%"
      replace_script: True

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "%POLICY_CATEGORY%"
      script_name: "%POSTINSTALL_SCRIPT_NAME%"
      script_path: "%POSTINSTALL_SCRIPT_PATH%"
      script_priority: "%POSTINSTALL_SCRIPT_PRIORITY%"
      replace_script: True

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfExtensionAttributeUploader
    Arguments:
      ea_script_path: "%EXTENSION_ATTRIBUTE_SCRIPT%"
      ea_name: "%EXTENSION_ATTRIBUTE_NAME%"
      replace_ea: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%TESTING_GROUP_TEMPLATE%"
      computergroup_name: "%TESTING_GROUP_NAME%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%TEST_USERS_GROUP_NAME%"
      computergroup_template: "%TEST_USERS_GROUP_TEMPLATE%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%TEST_VERSION_INSTALLED_GROUP_NAME%"
      computergroup_template: "%TEST_VERSION_INSTALLED_GROUP_TEMPLATE%"
      replace_group: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%USERS_GROUP_NAME%"
      computergroup_template: "%USERS_GROUP_TEMPLATE%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%INSTALLED_GROUP_NAME%"
      computergroup_template: "%INSTALLED_GROUP_TEMPLATE%"
      replace_group: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%LICENSE_INSTALLED_GROUP_NAME%"
      computergroup_template: "%LICENSE_INSTALLED_GROUP_TEMPLATE%"
      replace_group: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Comment: Trigger policy for activating the license
    Arguments:
      policy_template: "%TRIGGER_POLICY_TEMPLATE%"
      policy_name: "%TRIGGER_POLICY_NAME%"
      replace_policy: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Comment: Self Service policy for activating the license
    Arguments:
      policy_template: "%LICENSE_SET_POLICY_TEMPLATE%"
      policy_name: "%LICENSE_SET_POLICY_NAME%"
      replace_policy: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Comment: Untested Self Service policy
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      icon: "%SELFSERVICE_ICON%"
      replace_policy: "True"
