Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.SPSSStatistics28FixPack-nodes
MinimumVersion: "2.3"

Input:
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.SPSSStatistics28FixPack
  NAME: SPSS Statistics
  MAJOR_VERSION: "28"
  POLICY_NAME: "%NAME% %MAJOR_VERSION% Fix Pack (Testing)"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %MAJOR_VERSION% Fix Pack (Testing)"
  PKG_CATEGORY: Connect & Remote
  SELFSERVICE_DESCRIPTION: |
    Updates any existing installation of SPSS Statistics 28 (with Node or Floating license).

    Version: %version%
    Category: %PKG_CATEGORY%
  INSTALLED_AND_TEST_USER_GROUP_NAME: "%NAME% %MAJOR_VERSION% installed and test user"
  INSTALLED_AND_TEST_USER_GROUP_TEMPLATE: SmartGroup-installed-SPSSStatisticsFixPack.xml
  TEST_VERSION_NODE_LICENSE_INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% Node test version installed"
  TEST_VERSION_FLOATING_LICENSE_INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% Floating test version installed"
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed.xml
  TEST_USERS_FLOATING_LICENSE_GROUP_NAME: "%NAME% %MAJOR_VERSION% Floating test users"
  TEST_USERS_NODE_LICENSE_GROUP_NAME: "%NAME% %MAJOR_VERSION% Node test users"
  NODE_LICENSE_INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% Node installed"
  FLOATING_LICENSE_INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% Floating installed"
  POLICY_CATEGORY: Untested
  POLICY_TEMPLATE: Policy-untested-selfservice-SPSSStatisticsFixPack.xml
  SELFSERVICE_ICON: "SPSS Statistics 28.png"
  TESTING_GROUP_NAME: Testing
  TESTING_GROUP_TEMPLATE: StaticGroup-testing.xml
  INSTALL_BUTTON_TEXT: "Install %version%"
  REINSTALL_BUTTON_TEXT: "Install %version%"
  POLICY_RUN_COMMAND: "echo 'Installation of %NAME% %MAJOR_VERSION% complete'"
  UPDATE_PREDICATE: "pkg_metadata_updated == False"

Process:
  - Processor: com.github.grahampugh.recipes.preprocessors/LastRecipeRunChecker
    Arguments:
      recipeoverride_identifier: "%UNTESTED_RECIPE_IDENTIFIER%"

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"

  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%PKG_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      replace_pkg: "False"
      replace_pkg_metadata: "True"
      pkg_category: "%PKG_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%TESTING_GROUP_TEMPLATE%"
      computergroup_name: "%TESTING_GROUP_NAME%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%INSTALLED_AND_TEST_USER_GROUP_NAME%"
      computergroup_template: "%INSTALLED_AND_TEST_USER_GROUP_TEMPLATE%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      TEST_VERSION_INSTALLED_GROUP_NAME: "%TEST_VERSION_NODE_LICENSE_INSTALLED_GROUP_NAME%"
      TEST_USERS_GROUP_NAME: "%TEST_USERS_NODE_LICENSE_GROUP_NAME%"
      computergroup_name: "%TEST_VERSION_INSTALLED_GROUP_NAME%"
      computergroup_template: "%TEST_VERSION_INSTALLED_GROUP_TEMPLATE%"
      replace_group: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      TEST_VERSION_INSTALLED_GROUP_NAME: "%TEST_VERSION_FLOATING_LICENSE_INSTALLED_GROUP_NAME%"
      TEST_USERS_GROUP_NAME: "%TEST_USERS_FLOATING_LICENSE_GROUP_NAME%"
      computergroup_name: "%TEST_VERSION_INSTALLED_GROUP_NAME%"
      computergroup_template: "%TEST_VERSION_INSTALLED_GROUP_TEMPLATE%"
      replace_group: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      icon: "%SELFSERVICE_ICON%"
      replace_policy: "True"
