Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.StataSE-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: StataSE
  MAJOR_VERSION: "18"
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.StataSE
  POLICY_RUN_COMMAND: "echo 'Installation of %NAME% %MAJOR_VERSION% complete'"
  POLICY_NAME: "%NAME% %MAJOR_VERSION% (Testing)"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %MAJOR_VERSION% (Testing)"
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% test version installed"
  TEST_USERS_GROUP_NAME: "%NAME% %MAJOR_VERSION% test users"
  SELFSERVICE_ICON: "%NAME% %MAJOR_VERSION%.png"
