Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.Support-v2-nodes
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-OS-minimum-nodes

Input:
  NAME: ETH Support App v2
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Support-v2
  SELFSERVICE_DISPLAY_NAME: "ETH Support App v2 (Testing)"
  minimum_os_version: "13.0"
  SELFSERVICE_ICON: "ETH.png"
  POLICY_RUN_COMMAND: "jamf policy -event 'Support App Customisation v2-install' & killall Support"
