Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.Support-nodes
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes

Input:
  NAME: Support
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Support
  SELFSERVICE_ICON: "ETH.png"
