Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.swiftDialog-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-EA-nodes
MinimumVersion: "2.3"

Input:
  NAME: swiftDialog
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.swiftDialog
  EXTENSION_ATTRIBUTE_NAME: swiftDialog Version
  EXTENSION_ATTRIBUTE_SCRIPT: swiftDialog-EA.zsh
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed-EA.xml
  SP_EXECUTABLE_COMMAND: "open '/Library/Application Support/Dialog/Dialog.app'"
  SP_PROCESS_NAME: "Dialog.app"