Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.switchdrive-nodes
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-EA-nodes

Input:
  NAME: switchdrive
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.switchdrive
  EXTENSION_ATTRIBUTE_NAME: switchdrive Version
  EXTENSION_ATTRIBUTE_SCRIPT: VersionStringOverride-EA.sh
  JSS_INVENTORY_NAME: "%NAME%.app"
  VERSION_STRING_TYPE: CFBundleVersion
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed-EA.xml
