Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.TeamViewer-nodes
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes

Input:
  NAME: TeamViewer
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.TeamViewer
