Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.texmaker-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-platform-nodes
MinimumVersion: "2.3"

Input:
  NAME: texmaker
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.texmaker
  SELFSERVICE_ICON: texmaker 5.png
  SELFSERVICE_POLICY_NAME: "%NAME%"
  SELFSERVICE_DISPLAY_NAME: "%NAME% (Testing)"
  POLICY_NAME: "%NAME% (Testing)"

