Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.TorBrowser-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: Tor Browser
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.TorBrowser
  SP_EXECUTABLE_COMMAND: "open '/Applications/Tor Browser.app'"
  SP_PROCESS_NAME: "firefox"
