Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.UTM-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: UTM
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.UTM
  APPLICATION_NAME_HAS: UTM
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed-has.xml
  SELFSERVICE_ICON: UTM.png
