Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.VisualStudioCode-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-nodes
MinimumVersion: "2.3"

Input:
  NAME: Visual Studio Code
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.VisualStudioCode
  POLICY_RUN_COMMAND: "echo 'Installation of %NAME% complete'"
  SCRIPT_NAME: VisualStudioCode-postinstall.zsh
  SCRIPT_PATH: VisualStudioCode-postinstall.zsh
  SELFSERVICE_ICON: "%NAME% 1.65.png"
