Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.VMwareHorizonClient-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-nodes
MinimumVersion: "2.3"

Input:
  NAME: VMware Horizon Client
  LANGUAGE: EN
  SCRIPT_NAME: VMwareHorizonClient-postinstall.zsh
  SCRIPT_PATH: VMwareHorizonClient-postinstall.zsh
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.VMwareHorizonClient
  POLICY_NAME: "%NAME% %LANGUAGE% (Testing)"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %LANGUAGE% (Testing)"
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% %LANGUAGE% test version installed"
  TEST_USERS_GROUP_NAME: "%NAME% %LANGUAGE% test users"
  SELFSERVICE_ICON: "%NAME% 5.png"
