Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.XQuartz-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-OS-exclude-max-nodes
MinimumVersion: "2.3"

Input:
  NAME: XQuartz
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.XQuartz
