Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.Zoom-nodes
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-EA-nodes

Input:
  NAME: Zoom Client
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Zoom
  EXTENSION_ATTRIBUTE_NAME: Zoom Version
  EXTENSION_ATTRIBUTE_SCRIPT: VersionStringOverride-EA.sh
  JSS_INVENTORY_NAME: zoom.us.app
  VERSION_STRING_TYPE: CFBundleVersion
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed-EA.xml
  SELFSERVICE_ICON: zoom.us 5.png
  SP_EXECUTABLE_COMMAND: "open '/Applications/%JSS_INVENTORY_NAME%'"
  SP_PROCESS_NAME: "%JSS_INVENTORY_NAME%"
