<?xml version="1.0" encoding="UTF-8"?>
<policy>
    <general>
        <name>%AUTOINSTALL_POLICY_NAME%</name>
        <enabled>true</enabled>
        <trigger>EVENT</trigger>
        <trigger_checkin>true</trigger_checkin>
        <trigger_enrollment_complete>true</trigger_enrollment_complete>
        <trigger_login>false</trigger_login>
        <trigger_logout>false</trigger_logout>
        <trigger_network_state_changed>false</trigger_network_state_changed>
        <trigger_startup>false</trigger_startup>
        <frequency>%AUTOINSTALL_POLICY_FREQUENCY%</frequency>
        <category>
            <name>%AUTOINSTALL_POLICY_CATEGORY%</name>
        </category>
    </general>
     <scope>
        <all_computers>false</all_computers>
        <computer_groups>
            <computer_group>
                <name>%AUTOINSTALL_GROUP_NAME%</name>
            </computer_group>
        </computer_groups>
        <exclusions>
            <computers/>
            <computer_groups>
                <computer_group>
                    <name>%INSTALLED_GROUP_NAME%</name>
                </computer_group>
            </computer_groups>
        </exclusions>
    </scope>
    <scripts>
        <size>1</size>
        <script>
            <name>%SCRIPT_NAME_1%</name>
            <priority>%SCRIPT_PRIORITY%</priority>
            <parameter4>%PARAMETER4_VALUE%</parameter4>
            <parameter5>%PARAMETER5_VALUE%</parameter5>
            <parameter6>%PARAMETER6_VALUE%</parameter6>
            <parameter7>%PARAMETER7_VALUE%</parameter7>
            <parameter7>%PARAMETER8_VALUE%</parameter7>
            <parameter9/>
            <parameter10/>
            <parameter11/>
        </script>
    </scripts>
    <self_service>
        <use_for_self_service>false</use_for_self_service>
    </self_service>
    <maintenance>
        <recon>false</recon>
    </maintenance>
</policy>

