<?xml version="1.0" encoding="UTF-8"?>
<policy>
    <general>
        <name>%POLICY_NAME%</name>
        <enabled>true</enabled>
        <trigger>EVENT</trigger>
        <trigger_checkin>true</trigger_checkin>
        <trigger_enrollment_complete>false</trigger_enrollment_complete>
        <trigger_login>false</trigger_login>
        <trigger_logout>false</trigger_logout>
        <trigger_network_state_changed>false</trigger_network_state_changed>
        <trigger_startup>false</trigger_startup>
        <frequency>Once per computer</frequency>
        <category>
            <name>%POLICY_CATEGORY%</name>
        </category>
    </general>
    <scope>
        <all_computers>false</all_computers>
        <computer_groups>
            <computer_group>
                <name>%INSTALLED_GROUP_NAME1%</name>
            </computer_group>
            <computer_group>
                <name>%INSTALLED_GROUP_NAME2%</name>
            </computer_group>
        </computer_groups>
        <exclusions>
            <computers/>
            <computer_groups/>
        </exclusions>
    </scope>
    <self_service>
        <use_for_self_service>false</use_for_self_service>
    </self_service>
    <maintenance>
        <recon>false</recon>
    </maintenance>
    <files_processes>
        <run_command>jamf policy -event "%TRIGGER_NAME%"</run_command>
    </files_processes>
</policy>
