<?xml version="1.0" encoding="UTF-8"?>
<policy>
    <general>
        <name>%AUTOUPDATE_POLICY_NAME%</name>
        <enabled>true</enabled>
        <trigger>EVENT</trigger>
        <trigger_checkin>true</trigger_checkin>
        <trigger_enrollment_complete>true</trigger_enrollment_complete>
        <trigger_login>false</trigger_login>
        <trigger_logout>false</trigger_logout>
        <trigger_network_state_changed>false</trigger_network_state_changed>
        <trigger_startup>false</trigger_startup>
        <frequency>%AUTOUPDATE_POLICY_FREQUENCY%</frequency>
        <category>
            <name>%AUTOUPDATE_POLICY_CATEGORY%</name>
        </category>
    </general>
    <scope>
        <all_computers>false</all_computers>
        <computer_groups>
            <computer_group>
                <name>%INSTALLED_GROUP_NAME%</name>
            </computer_group>
        </computer_groups>
        <exclusions>
            <computers/>
            <computer_groups>
                <computer_group>
                    <name>%PROD_VERSION_INSTALLED_GROUP_NAME%</name>
                </computer_group>
                <computer_group>
                    <name>%AUTOUPDATE_EXCLUDED_GROUP_NAME%</name>
                </computer_group>
            </computer_groups>
        </exclusions>
    </scope>
    <package_configuration>
        <packages>
            <size>0</size>
        </packages>
    </package_configuration>
    <scripts>
        <size>1</size>
        <script>
            <name>%UPDATE_SCRIPT_NAME%</name>
            <priority>%UPDATE_SCRIPT_PRIORITY%</priority>
            <parameter4>%UPDATE_POLICY_PARAMETER4_VALUE%</parameter4>
            <parameter5>%AUTOUPDATE_POLICY_PARAMETER5_VALUE%</parameter5>
            <parameter6>%UPDATE_POLICY_PARAMETER6_VALUE%</parameter6>
            <parameter7>%UPDATE_POLICY_PARAMETER7_VALUE%</parameter7>
            <parameter8>%UPDATE_POLICY_PARAMETER8_VALUE%</parameter8>
            <parameter9>%UPDATE_POLICY_PARAMETER9_VALUE%</parameter9>
            <parameter10>%UPDATE_POLICY_PARAMETER10_VALUE%</parameter10>
            <parameter11>%UPDATE_POLICY_PARAMETER11_VALUE%</parameter11>
        </script>
    </scripts>
    <self_service>
        <use_for_self_service>false</use_for_self_service>
    </self_service>
    <maintenance>
        <recon>false</recon>
    </maintenance>
    <files_processes>
        <run_command>%AUTOUPDATE_POLICY_RUN_COMMAND%</run_command>
    </files_processes>
</policy>
