<?xml version="1.0" encoding="UTF-8"?>
<policy>
    <general>
        <name>%AUTOUPDATE_POLICY_NAME%</name>
        <enabled>true</enabled>
        <trigger>EVENT</trigger>
        <trigger_checkin>true</trigger_checkin>
        <trigger_enrollment_complete>true</trigger_enrollment_complete>
        <trigger_login>false</trigger_login>
        <trigger_logout>false</trigger_logout>
        <trigger_network_state_changed>false</trigger_network_state_changed>
        <trigger_startup>false</trigger_startup>
        <frequency>%AUTOUPDATE_POLICY_FREQUENCY%</frequency>
        <category>
            <name>%AUTOUPDATE_POLICY_CATEGORY%</name>
        </category>
    </general>
    <scope>
        <all_computers>false</all_computers>
        <computer_groups>
            <computer_group>
                <name>Adobe Creative Cloud auto-update</name>
            </computer_group>
            <computer_group>
                <name>Adobe Acrobat DC SDL installed</name>
            </computer_group>
            <computer_group>
                <name>Adobe After Effects CC 2022 SDL installed</name>
            </computer_group>
            <computer_group>
                <name>Adobe Illustrator 2022 SDL installed</name>
            </computer_group>
            <computer_group>
                <name>Adobe InDesign 2022 SDL installed</name>
            </computer_group>
            <computer_group>
                <name>Adobe Lightroom Classic SDL installed</name>
            </computer_group>
            <computer_group>
                <name>Adobe Photoshop 2022 SDL installed</name>
            </computer_group>
            <computer_group>
                <name>Adobe Premiere Pro 2022 SDL installed</name>
            </computer_group>
        </computer_groups>
        <exclusions>
            <computers/>
            <computer_groups/>
        </exclusions>
    </scope>
    <package_configuration>
        <packages>
            <size>0</size>
        </packages>
    </package_configuration>
    <scripts>
        <size>0</size>
    </scripts>
    <self_service>
        <use_for_self_service>false</use_for_self_service>
    </self_service>
    <maintenance>
        <recon>true</recon>
    </maintenance>
    <files_processes>
        <run_command>%TRIGGER_POLICY_RUN_COMMAND%</run_command>
    </files_processes>
</policy>
