<?xml version="1.0" encoding="UTF-8"?>
<policy>
    <general>
        <name>%TRIGGER_POLICY_NAME%</name>
        <enabled>true</enabled>
        <trigger>EVENT</trigger>
        <trigger_checkin>false</trigger_checkin>
        <trigger_enrollment_complete>false</trigger_enrollment_complete>
        <trigger_login>false</trigger_login>
        <trigger_logout>false</trigger_logout>
        <trigger_network_state_changed>false</trigger_network_state_changed>
        <trigger_startup>false</trigger_startup>
        <trigger_other>%TRIGGER_NAME%</trigger_other>
        <frequency>Ongoing</frequency>
        <category>
            <name>%TRIGGER_POLICY_CATEGORY%</name>
        </category>
    </general>
    <scope>
        <all_computers>true</all_computers>
        <computer_groups></computer_groups>
        <exclusions>
            <computer_groups></computer_groups>
        </exclusions>
    </scope>
    <scripts>
        <size>1</size>
        <script>
            <name>%SCRIPT_NAME%</name>
            <priority>%SCRIPT_PRIORITY%</priority>
            <parameter4/>
            <parameter5/>
            <parameter6/>
            <parameter7/>
            <parameter8/>
            <parameter9/>
            <parameter10/>
            <parameter11/>
        </script>
    </scripts>
    <self_service>
        <use_for_self_service>false</use_for_self_service>
    </self_service>
    <maintenance>
        <recon>true</recon>
    </maintenance>
</policy>
