<?xml version="1.0" encoding="UTF-8"?>
<policy>
    <general>
        <name>%UPDATES_POLICY_NAME%</name>
        <enabled>true</enabled>
        <frequency>Ongoing</frequency>
        <category>
            <name>%POLICY_CATEGORY%</name>
        </category>
    </general>
    <scope>
        <computer_groups>
            <computer_group>
                <name>%GROUP_NAME%</name>
            </computer_group>
        </computer_groups>
    </scope>
    <package_configuration>
        <packages>
            <size>0</size>
        </packages>
    </package_configuration>
    <scripts>
        <size>0</size>
    </scripts>
    <self_service>
        <use_for_self_service>true</use_for_self_service>
        <install_button_text>%UPDATES_INSTALL_BUTTON_TEXT%</install_button_text>
        <reinstall_button_text>%UPDATES_REINSTALL_BUTTON_TEXT%</reinstall_button_text>
        <self_service_display_name>%UPDATES_SELFSERVICE_DISPLAY_NAME%</self_service_display_name>
        <self_service_description>%UPDATES_SELFSERVICE_DESCRIPTION%</self_service_description>
        <force_users_to_view_description>%FORCE_DESCRIPTION%</force_users_to_view_description>
    </self_service>
    <maintenance>
        <recon>true</recon>
    </maintenance>
    <files_processes>
        <run_command>%UPDATES_RUN_COMMAND%</run_command>
    </files_processes>
</policy>
