<?xml version="1.0" encoding="UTF-8"?>
<policy>
    <general>
        <name>%FLOATING_POLICY_NAME%</name>
        <enabled>true</enabled>
        <trigger>EVENT</trigger>
        <trigger_checkin>false</trigger_checkin>
        <trigger_enrollment_complete>false</trigger_enrollment_complete>
        <trigger_login>false</trigger_login>
        <trigger_logout>false</trigger_logout>
        <trigger_network_state_changed>false</trigger_network_state_changed>
        <trigger_startup>false</trigger_startup>
        <trigger_other/>
        <frequency>Ongoing</frequency>
        <category>
            <name>%SELFSERVICE_POLICY_CATEGORY%</name>
        </category>
    </general>
    <scope>
        <all_computers>false</all_computers>
        <computer_groups>
            <computer_group>
                <name>%FLOATING_USERS_GROUP_NAME%</name>
            </computer_group>
        </computer_groups>
        <exclusions>
            <computers/>
            <computer_groups>
                <computer_group>
                    <name>%FLOATING_INSTALLED_GROUP_NAME%</name>
                </computer_group>
                <computer_group>
                    <name>Apple Silicon Mac</name>
                </computer_group>
            </computer_groups>
        </exclusions>
    </scope>
    <package_configuration>
        <packages>
            <size>0</size>
        </packages>
    </package_configuration>
    <scripts>
        <size>1</size>
        <script>
            <name>%SCRIPT_NAME%</name>
            <priority>%SCRIPT_PRIORITY%</priority>
            <parameter4>%PARAMETER4_VALUE%</parameter4>
            <parameter5>%PARAMETER5_VALUE%</parameter5>
            <parameter6>%PARAMETER6_VALUE%</parameter6>
            <parameter7>%FLOATING_PARAMETER7_VALUE%</parameter7>
            <parameter8>%PARAMETER8_VALUE%</parameter8>
            <parameter9/>
            <parameter10/>
            <parameter11/>
        </script>
    </scripts>
    <self_service>
        <use_for_self_service>true</use_for_self_service>
        <force_users_to_view_description>true</force_users_to_view_description>
        <install_button_text>%INSTALL_BUTTON_TEXT%</install_button_text>
        <reinstall_button_text>%REINSTALL_BUTTON_TEXT%</reinstall_button_text>
        <self_service_display_name>%FLOATING_SELFSERVICE_DISPLAY_NAME%</self_service_display_name>
        <self_service_description>%FLOATING_SELFSERVICE_DESCRIPTION%</self_service_description>
        <self_service_categories>
            <category>
                <name>%SELFSERVICE_POLICY_CATEGORY%</name>
                <display_in>true</display_in>
                <feature_in>false</feature_in>
            </category>
        </self_service_categories>
    </self_service>
    <user_interaction>
        <message_start>%FLOATING_POLICY_NAME% is being installed.</message_start>
        <message_finish>%FLOATING_POLICY_NAME% has now been installed.</message_finish>
    </user_interaction>
    <maintenance>
        <recon>true</recon>
    </maintenance>
    <files_processes>
        <run_command>%POLICY_RUN_COMMAND%</run_command>
    </files_processes>
</policy>
