<?xml version="1.0" encoding="UTF-8"?>
<policy>
	<general>
		<name>%NO_UPDATES_POLICY_NAME%</name>
		<enabled>true</enabled>
		<frequency>Ongoing</frequency>
		<category>
			<name>%POLICY_CATEGORY%</name>
		</category>
	</general>
	<scope>
		<all_computers>true</all_computers>
		<computer_groups/>
		<exclusions>
			<computers/>
			<computer_groups>
				<computer_group>
					<name>%GROUP_NAME%</name>
				</computer_group>
			</computer_groups>
		</exclusions>
	</scope>
	<package_configuration>
		<packages>
			<size>0</size>
		</packages>
	</package_configuration>
	<scripts>
		<size>1</size>
		<script>
			<name>%SCRIPT_NAME%</name>
			<priority>%SCRIPT_PRIORITY%</priority>
			<parameter4>%PARAMETER4_VALUE%</parameter4>
			<parameter5>%PARAMETER5_VALUE%</parameter5>
			<parameter6/>
			<parameter7/>
			<parameter8/>
			<parameter9/>
			<parameter10/>
			<parameter11/>
		</script>
	</scripts>
	<self_service>
		<use_for_self_service>true</use_for_self_service>
		<install_button_text>%INSTALL_BUTTON_TEXT%</install_button_text>
		<reinstall_button_text>%REINSTALL_BUTTON_TEXT%</reinstall_button_text>
		<self_service_display_name>%NO_UPDATES_SELFSERVICE_DISPLAY_NAME%</self_service_display_name>
		<self_service_description>%NO_UPDATES_UPDATES_SELFSERVICE_DESCRIPTION%</self_service_description>
		<force_users_to_view_description>%FORCE_DESCRIPTION%</force_users_to_view_description>
	</self_service>
	<maintenance>
		<recon>false</recon>
	</maintenance>
	<files_processes>
		<run_command/>
	</files_processes>
</policy>
