Description: |
  Creates a Once per week policy to set a user identity for 802.1X.
Identifier: com.github.eth-its-recipes.jamf.script.8021XLanIdentity
MinimumVersion: "2.3"

Input:
  NAME: 802.1X LAN Identity
  POLICY_CATEGORY: Administration
  POLICY_TEMPLATE: Policy-script-recurring-noscope.xml
  POLICY_NAME: "%NAME%"
  POLICY_FREQUENCY: Once every week
  SCRIPT_NAME: 8021X-lan-identity.sh
  SCRIPT_PRIORITY: After

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "%POLICY_CATEGORY%"
      script_path: "%SCRIPT_NAME%"
      script_priority: "%SCRIPT_PRIORITY%"
      replace_script: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      replace_policy: "True"
