Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.grahampugh.recipes.jamf.FileVaultReissueKey-script
MinimumVersion: "2.3"

Input:
  NAME: Reissue FileVault Key
  FILEVAULT_OFF_GROUP_NAME: FileVault Enabled
  FILEVAULT_OFF_GROUP_TEMPLATE: SmartGroup-FileVaultOn.xml
  FILEVAULT_ON_GROUP_NAME: FileVault Off
  FILEVAULT_ON_GROUP_TEMPLATE: SmartGroup-FileVaultOn.xml
  POLICY_CATEGORY: Tools & Accessories
  POLICY_TEMPLATE: Policy-script-selfservice-parameters.xml
  USERS_GROUP_NAME: "%FILEVAULT_ON_GROUP_NAME%"
  POLICY_NAME: "%NAME%"
  SCRIPT_NAME: "FileVaultReissueKey.sh"
  SCRIPT_PRIORITY: After
  SELFSERVICE_DISPLAY_NAME: "%NAME%"
  SELFSERVICE_DESCRIPTION: |
    Generate a new FileVault key and upload to the Mac management system. 

    **Run this only if asked to do so by your IT administrator.**
  SELFSERVICE_ICON: FileVault.png
  INSTALL_BUTTON_TEXT: Reissue key
  REINSTALL_BUTTON_TEXT: Reissue key
  FORCE_DESCRIPTION: "true"
  PARAMETER4_LABEL: Org Name
  PARAMETER5_LABEL: No of attempts
  PARAMETER6_LABEL: Contact information
  PARAMETER7_LABEL: Icon path
  PARAMETER8_LABEL: Parameter 8
  PARAMETER9_LABEL: Parameter 9
  PARAMETER10_LABEL: Parameter 10
  PARAMETER11_LABEL: Parameter 11
  PARAMETER4_VALUE: "ETH Zürich"
  PARAMETER5_VALUE: "3"
  PARAMETER6_VALUE: Please contact your IT support administrators if you have any problems.
  PARAMETER7_VALUE: ""
  PARAMETER8_VALUE: ""
  PARAMETER9_VALUE: ""
  PARAMETER10_VALUE: ""
  PARAMETER11_VALUE: ""

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "%POLICY_CATEGORY%"
      script_path: "%SCRIPT_NAME%"
      script_priority: "%SCRIPT_PRIORITY%"
      replace_script: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%FILEVAULT_OFF_GROUP_NAME%"
      computergroup_name: "%FILEVAULT_OFF_GROUP_TEMPLARE%"
      replace_group: "True"
  
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%FILEVAULT_ON_GROUP_NAME%"
      computergroup_name: "%FILEVAULT_ON_GROUP_TEMPLARE%"
      replace_group: "True"
  
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      icon: "%SELFSERVICE_ICON%"
      replace_policy: "True"
