Description: Creates a trigger-only policy.
Identifier: com.github.eth-its-recipes.jamf.script.GLPIAgent-configure-update-script
MinimumVersion: "2.3"

Input:
  NAME: "mac.ethos.GLPI-Agent-config-update"
  TRIGGER_NAME: GLPI-Agent-Configure
  TRIGGER_POLICY_RUN_COMMAND: "echo 'GLPI Agent configuration update complete'"
  POLICY_CATEGORY: Triggered Installers
  POLICY_FREQUENCY: Once per Computer
  POLICY_TEMPLATE: Policy-prod-once-per-computer-trigger-2groups.xml
  POLICY_NAME: "mac.ethos.GLPI-Agent-config-update"
  INSTALLED_GROUP_NAME1: "GLPI-Agent arm64 installed"
  INSTALLED_GROUP_NAME2:  "GLPI-Agent x86_64 installed"


Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      replace_policy: "True"
