Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.grahampugh.recipes.jamf.ScreenshotDisableDropShadow-script
MinimumVersion: "2.3"

Input:
  NAME: Screenshots - Disable Drop-Shadow
  USERS_GROUP_NAME: "%NAME% users"
  USERS_GROUP_TEMPLATE: SmartGroup-script-selfservice.xml
  TESTING_GROUP_NAME: Testing
  POLICY_CATEGORY: Tools & Accessories
  POLICY_TEMPLATE: Policy-script-selfservice.xml
  POLICY_NAME: "%NAME%"
  SCRIPT_NAME: ScreenshotDisableDropShadow.sh
  SCRIPT_PRIORITY: After
  SELFSERVICE_DISPLAY_NAME: Screenshots - Disable Drop-Shadow
  SELFSERVICE_DESCRIPTION: Disables the drop shadow when making screenshots of application windows.
  SELFSERVICE_ICON: Screenshot.png
  INSTALL_BUTTON_TEXT: Disable
  REINSTALL_BUTTON_TEXT: Disable
  FORCE_DESCRIPTION: "false"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "%POLICY_CATEGORY%"
      script_path: "%SCRIPT_NAME%"
      script_priority: "%SCRIPT_PRIORITY%"
      replace_script: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%USERS_GROUP_TEMPLATE%"
      computergroup_name: "%USERS_GROUP_NAME%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      icon: "%SELFSERVICE_ICON%"
      replace_policy: "True"
