<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>PayloadContent</key>
        <array>
            <dict>
                <key>PayloadDisplayName</key>
                <string>Cortex XDR Privacy Preferences Policy Control</string>
                <key>PayloadIdentifier</key>
                <string>com.apple.TCC.configuration-profile-policy.213ACE76-4F58-483F-8F6F-6F165158F087</string>
                <key>PayloadType</key>
                <string>com.apple.TCC.configuration-profile-policy</string>
                <key>PayloadUUID</key>
                <string>213ACE76-4F58-483F-8F6F-6F165158F087</string>
                <key>PayloadVersion</key>
                <integer>1</integer>
                <key>Services</key>
                <dict>
                    <key>AppleEvents</key>
                    <array>
                        <dict>
                            <key>AEReceiverCodeRequirement</key>
                            <string>identifier "com.apple.finder" and anchor apple</string>
                            <key>AEReceiverIdentifier</key>
                            <string>com.apple.finder</string>
                            <key>AEReceiverIdentifierType</key>
                            <string>bundleID</string>
                            <key>Allowed</key>
                            <true/>
                            <key>CodeRequirement</key>
                            <string>identifier "com.paloaltonetworks.traps-agent" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = PXPZ95SK77</string>
                            <key>Comment</key>
                            <string></string>
                            <key>Identifier</key>
                            <string>com.paloaltonetworks.traps-agent</string>
                            <key>IdentifierType</key>
                            <string>bundleID</string>
                            <key>StaticCode</key>
                            <false/>
                        </dict>
                        <dict>
                            <key>AEReceiverCodeRequirement</key>
                            <string>identifier "com.apple.systemuiserver" and anchor apple</string>
                            <key>AEReceiverIdentifier</key>
                            <string>com.apple.systemuiserver</string>
                            <key>AEReceiverIdentifierType</key>
                            <string>bundleID</string>
                            <key>Allowed</key>
                            <true/>
                            <key>CodeRequirement</key>
                            <string>identifier "com.paloaltonetworks.traps-agent" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = PXPZ95SK77</string>
                            <key>Comment</key>
                            <string></string>
                            <key>Identifier</key>
                            <string>com.paloaltonetworks.traps-agent</string>
                            <key>IdentifierType</key>
                            <string>bundleID</string>
                            <key>StaticCode</key>
                            <false/>
                        </dict>
                        <dict>
                            <key>AEReceiverCodeRequirement</key>
                            <string>identifier "com.apple.systemevents" and anchor apple</string>
                            <key>AEReceiverIdentifier</key>
                            <string>com.apple.systemevents</string>
                            <key>AEReceiverIdentifierType</key>
                            <string>bundleID</string>
                            <key>Allowed</key>
                            <true/>
                            <key>CodeRequirement</key>
                            <string>identifier "com.paloaltonetworks.traps-agent" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = PXPZ95SK77</string>
                            <key>Comment</key>
                            <string></string>
                            <key>Identifier</key>
                            <string>com.paloaltonetworks.traps-agent</string>
                            <key>IdentifierType</key>
                            <string>bundleID</string>
                            <key>StaticCode</key>
                            <false/>
                        </dict>
                    </array>
                    <key>SystemPolicyAllFiles</key>
                    <array>
                        <dict>
                            <key>Allowed</key>
                            <true/>
                            <key>CodeRequirement</key>
                            <string>identifier "com.paloaltonetworks.traps.securityextension" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = PXPZ95SK77</string>
                            <key>Comment</key>
                            <string></string>
                            <key>Identifier</key>
                            <string>com.paloaltonetworks.traps.securityextension</string>
                            <key>IdentifierType</key>
                            <string>bundleID</string>
                            <key>StaticCode</key>
                            <false/>
                        </dict>
                        <dict>
                            <key>Allowed</key>
                            <true/>
                            <key>CodeRequirement</key>
                            <string>identifier pmd and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = PXPZ95SK77</string>
                            <key>Comment</key>
                            <string></string>
                            <key>Identifier</key>
                            <string>/Library/Application Support/PaloAltoNetworks/Traps/bin/pmd</string>
                            <key>IdentifierType</key>
                            <string>path</string>
                            <key>StaticCode</key>
                            <false/>
                        </dict>
                    </array>
                </dict>
            </dict>
            <dict>
                <key>PayloadUUID</key>
                <string>29CD608E-42FC-4FCA-A07B-D3C6FF932CA5</string>
                <key>PayloadType</key>
                <string>com.apple.system-extension-policy</string>
                <key>PayloadIdentifier</key>
                <string>com.apple.system-extension-policy.29CD608E-42FC-4FCA-A07B-D3C6FF932CA5</string>
                <key>PayloadDisplayName</key>
                <string>Cortex XDR System Extensions</string>
                <key>PayloadVersion</key>
                <integer>1</integer>
                <key>PayloadEnabled</key>
                <true/>
                <key>AllowUserOverrides</key>
                <true/>
                <key>AllowedSystemExtensions</key>
                <dict>
                    <key>PXPZ95SK77</key>
                    <array>
                        <string>com.paloaltonetworks.traps.securityextension</string>
                        <string>com.paloaltonetworks.traps.networkextension</string>
                    </array>
                </dict>
            </dict>
            <dict>
                <key>FilterDataProviderBundleIdentifier</key>
                <string>com.paloaltonetworks.traps.networkextension</string>
                <key>FilterDataProviderDesignatedRequirement</key>
                <string>anchor apple generic and identifier "com.paloaltonetworks.traps.networkextension"</string>
                <key>FilterPacketProviderBundleIdentifier</key>
                <string>com.paloaltonetworks.traps.networkextension</string>
                <key>FilterPacketProviderDesignatedRequirement</key>
                <string>anchor apple generic and identifier "com.paloaltonetworks.traps.networkextension"</string>
                <key>FilterGrade</key>
                <string>firewall</string>
                <key>FilterPackets</key>
                <true/>
                <key>FilterSockets</key>
                <true/>
                <key>FilterType</key>
                <string>Plugin</string>
                <key>PayloadDescription</key>
                <string>Content Filter for the Cortex XDR agent network extension</string>
                <key>PayloadDisplayName</key>
                <string>Cortex XDR Network Content Filter</string>
                <key>PayloadIdentifier</key>
                <string>com.apple.webcontent-filter.C9BF4213-282C-4D7A-89F8-DC19A5EC6136</string>
                <key>PayloadType</key>
                <string>com.apple.webcontent-filter</string>
                <key>PayloadUUID</key>
                <string>C9BF4213-282C-4D7A-89F8-DC19A5EC6136</string>
                <key>PayloadVersion</key>
                <integer>1</integer>
                <key>PluginBundleID</key>
                <string>com.paloaltonetworks.cortex.app</string>
                <key>UserDefinedName</key>
                <string>Cortex XDR Network Filter</string>
            </dict>
            <dict>
                <key>NotificationSettings</key>
                <array>
                    <dict>
                        <key>AlertType</key>
                        <integer>1</integer>
                        <key>BadgesEnabled</key>
                        <true/>
                        <key>BundleIdentifier</key>
                        <string>com.paloaltonetworks.traps-agent</string>
                        <key>CriticalAlertEnabled</key>
                        <true/>
                        <key>GroupingType</key>
                        <integer>0</integer>
                        <key>NotificationsEnabled</key>
                        <true/>
                        <key>PreviewType</key>
                        <integer>0</integer>
                        <key>ShowInCarPlay</key>
                        <true/>
                        <key>ShowInLockScreen</key>
                        <true/>
                        <key>ShowInNotificationCenter</key>
                        <true/>
                        <key>SoundsEnabled</key>
                        <true/>
                    </dict>
                </array>
                <key>PayloadDisplayName</key>
                <string>Cortex XDR Notifications</string>
                <key>PayloadIdentifier</key>
                <string>com.apple.notificationsettings.37703D68-C703-4A94-9A1B-D3BB4B7ECAFD</string>
                <key>PayloadType</key>
                <string>com.apple.notificationsettings</string>
                <key>PayloadUUID</key>
                <string>37703D68-C703-4A94-9A1B-D3BB4B7ECAFD</string>
                <key>PayloadVersion</key>
                <integer>1</integer>
            </dict>
        </array>
        <key>PayloadDescription</key>
        <string>Cortex XDR Configuration (M1): PPPC + KEXT + SEs + Content Filter + Notifications</string>
        <key>PayloadDisplayName</key>
        <string>Cortex XDR Settings</string>
        <key>PayloadIdentifier</key>
        <string>com.paloaltonetworks.cortex.D2F1500E-C460-41F3-9851-AB390EA99CEF</string>
        <key>PayloadOrganization</key>
        <string>Palo Alto Networks</string>
        <key>PayloadEnabled</key>
        <true/>
        <key>PayloadRemovalDisallowed</key>
        <true/>
        <key>PayloadScope</key>
        <string>System</string>
        <key>PayloadType</key>
        <string>Configuration</string>
        <key>PayloadUUID</key>
        <string>D2F1500E-C460-41F3-9851-AB390EA99CEF</string>
        <key>PayloadVersion</key>
        <integer>1</integer>
        <key>TargetDeviceType</key>
        <integer>5</integer>
    </dict>
</plist>