<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>PayloadContent</key>
        <array>
            <dict>
                <key>PayloadDescription</key>
                <string></string>
                <key>PayloadDisplayName</key>
                <string>Privacy Preferences Policy Control</string>
                <key>PayloadEnabled</key>
                <true/>
                <key>PayloadIdentifier</key>
                <string>A6309FDF-E26E-4E22-A70C-B78FFF06A55F</string>
                <key>PayloadOrganization</key>
                <string>eawag</string>
                <key>PayloadType</key>
                <string>com.apple.TCC.configuration-profile-policy</string>
                <key>PayloadUUID</key>
                <string>A6309FDF-E26E-4E22-A70C-B78FFF06A55F</string>
                <key>PayloadVersion</key>
                <integer>1</integer>
                <key>Services</key>
                <dict>
                    <key>AppleEvents</key>
                    <array>
                        <dict>
                            <key>AEReceiverCodeRequirement</key>
                            <string>identifier "com.apple.finder" and anchor apple</string>
                            <key>AEReceiverIdentifier</key>
                            <string>com.apple.finder</string>
                            <key>AEReceiverIdentifierType</key>
                            <string>bundleID</string>
                            <key>Allowed</key>
                            <integer>1</integer>
                            <key>CodeRequirement</key>
                            <string>identifier "com.paloaltonetworks.traps-agent" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = PXPZ95SK77</string>
                            <key>Identifier</key>
                            <string>com.paloaltonetworks.traps-agent</string>
                            <key>IdentifierType</key>
                            <string>bundleID</string>
                            <key>StaticCode</key>
                            <integer>0</integer>
                        </dict>
                        <dict>
                            <key>AEReceiverCodeRequirement</key>
                            <string>identifier "com.apple.systemuiserver" and anchor apple</string>
                            <key>AEReceiverIdentifier</key>
                            <string>com.apple.systemuiserver</string>
                            <key>AEReceiverIdentifierType</key>
                            <string>bundleID</string>
                            <key>Allowed</key>
                            <integer>1</integer>
                            <key>CodeRequirement</key>
                            <string>identifier "com.paloaltonetworks.traps-agent" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = PXPZ95SK77</string>
                            <key>Identifier</key>
                            <string>com.paloaltonetworks.traps-agent</string>
                            <key>IdentifierType</key>
                            <string>bundleID</string>
                            <key>StaticCode</key>
                            <integer>0</integer>
                        </dict>
                        <dict>
                            <key>AEReceiverCodeRequirement</key>
                            <string>identifier "com.apple.systemevents" and anchor apple</string>
                            <key>AEReceiverIdentifier</key>
                            <string>com.apple.systemevents</string>
                            <key>AEReceiverIdentifierType</key>
                            <string>bundleID</string>
                            <key>Allowed</key>
                            <integer>1</integer>
                            <key>CodeRequirement</key>
                            <string>identifier "com.paloaltonetworks.traps-agent" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = PXPZ95SK77</string>
                            <key>Identifier</key>
                            <string>com.paloaltonetworks.traps-agent</string>
                            <key>IdentifierType</key>
                            <string>bundleID</string>
                            <key>StaticCode</key>
                            <integer>0</integer>
                        </dict>
                    </array>
                    <key>SystemPolicyAllFiles</key>
                    <array>
                        <dict>
                            <key>Allowed</key>
                            <integer>1</integer>
                            <key>CodeRequirement</key>
                            <string>identifier "com.paloaltonetworks.traps.securityextension" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = PXPZ95SK77</string>
                            <key>Identifier</key>
                            <string>com.paloaltonetworks.traps.securityextension</string>
                            <key>IdentifierType</key>
                            <string>bundleID</string>
                            <key>StaticCode</key>
                            <integer>0</integer>
                        </dict>
                        <dict>
                            <key>Allowed</key>
                            <integer>1</integer>
                            <key>CodeRequirement</key>
                            <string>identifier pmd and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = PXPZ95SK77</string>
                            <key>Identifier</key>
                            <string>/Library/Application Support/PaloAltoNetworks/Traps/bin/pmd</string>
                            <key>IdentifierType</key>
                            <string>path</string>
                            <key>StaticCode</key>
                            <integer>0</integer>
                        </dict>
                    </array>
                </dict>
            </dict>
            <dict>
                <key>AllowUserOverrides</key>
                <true/>
                <key>AllowedSystemExtensions</key>
                <dict>
                    <key>PXPZ95SK77</key>
                    <array>
                        <string>com.paloaltonetworks.traps.securityextension</string>
                        <string>com.paloaltonetworks.traps.networkextension</string>
                    </array>
                </dict>
                <key>PayloadDescription</key>
                <string></string>
                <key>PayloadDisplayName</key>
                <string>System Extensions</string>
                <key>PayloadEnabled</key>
                <true/>
                <key>PayloadIdentifier</key>
                <string>088F68B2-1EA6-4BF2-B878-3E02777B0665</string>
                <key>PayloadOrganization</key>
                <string>ETH Zurich</string>
                <key>PayloadType</key>
                <string>com.apple.system-extension-policy</string>
                <key>PayloadUUID</key>
                <string>088F68B2-1EA6-4BF2-B878-3E02777B0665</string>
                <key>PayloadVersion</key>
                <integer>1</integer>
            </dict>
            <dict>
                <key>FilterDataProviderBundleIdentifier</key>
                <string>com.paloaltonetworks.traps.networkextension</string>
                <key>FilterDataProviderDesignatedRequirement</key>
                <string>anchor apple generic and identifier "com.paloaltonetworks.traps.networkextension"</string>
                <key>FilterPacketProviderBundleIdentifier</key>
                <string>com.paloaltonetworks.traps.networkextension</string>
                <key>FilterPacketProviderDesignatedRequirement</key>
                <string>anchor apple generic and identifier "com.paloaltonetworks.traps.networkextension"</string>
                <key>FilterPackets</key>
                <true/>
                <key>FilterSockets</key>
                <true/>
                <key>FilterType</key>
                <string>Plugin</string>
                <key>PayloadDisplayName</key>
                <string>Web Content Filter Payload</string>
                <key>PayloadIdentifier</key>
                <string>12E0249C-8A39-43FA-B2A3-19D12D632549</string>
                <key>PayloadOrganization</key>
                <string>JAMF Software</string>
                <key>PayloadType</key>
                <string>com.apple.webcontent-filter</string>
                <key>PayloadUUID</key>
                <string>12E0249C-8A39-43FA-B2A3-19D12D632549</string>
                <key>PayloadVersion</key>
                <integer>1</integer>
                <key>PluginBundleID</key>
                <string>com.paloaltonetworks.cortex.app</string>
                <key>UserDefinedName</key>
                <string>Cortex XDR Network Filter</string>
                <key>VendorConfig</key>
                <dict/>
            </dict>
            <dict>
                <key>NotificationSettings</key>
                <array>
                    <dict>
                        <key>AlertType</key>
                        <integer>1</integer>
                        <key>BadgesEnabled</key>
                        <true/>
                        <key>BundleIdentifier</key>
                        <string>com.paloaltonetworks.traps-agent</string>
                        <key>CriticalAlertEnabled</key>
                        <true/>
                        <key>NotificationsEnabled</key>
                        <true/>
                        <key>ShowInLockScreen</key>
                        <true/>
                        <key>ShowInNotificationCenter</key>
                        <true/>
                        <key>SoundsEnabled</key>
                        <true/>
                    </dict>
                </array>
                <key>PayloadDisplayName</key>
                <string>Notifications Payload</string>
                <key>PayloadIdentifier</key>
                <string>A4297673-5180-4CBD-BA45-C30BCBD19BC6</string>
                <key>PayloadOrganization</key>
                <string>JAMF Software</string>
                <key>PayloadType</key>
                <string>com.apple.notificationsettings</string>
                <key>PayloadUUID</key>
                <string>54E15809-9DF6-4E96-A025-0D23BC69C588</string>
                <key>PayloadVersion</key>
                <integer>1</integer>
            </dict>
        </array>
        <key>PayloadDescription</key>
        <string></string>
        <key>PayloadDisplayName</key>
        <string>Cortex XDR Settings - eawag</string>
        <key>PayloadEnabled</key>
        <true/>
        <key>PayloadIdentifier</key>
        <string>1953F385-D863-41CC-8170-A2F2F79AFE25</string>
        <key>PayloadOrganization</key>
        <string>eawag</string>
        <key>PayloadRemovalDisallowed</key>
        <true/>
        <key>PayloadScope</key>
        <string>System</string>
        <key>PayloadType</key>
        <string>Configuration</string>
        <key>PayloadUUID</key>
        <string>1953F385-D863-41CC-8170-A2F2F79AFE25</string>
        <key>PayloadVersion</key>
        <integer>1</integer>
    </dict>
</plist>
