Description: Uploads a Mac App Store app configuration to the Jamf Pro Server.
Identifier: com.github.eth-its-recipes.jamf.Bitwarden-macapp
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.SelfServiceMacApps-macapp

Input:
  NAME: Bitwarden
