Description: Uploads a Mac App Store app configuration to the Jamf Pro Server.
Identifier: com.github.eth-its-recipes.jamf.Mattermost-macapp
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.FreeMacApps-macapp-no-users

Input:
  NAME: Mattermost Desktop
  JSS_INVENTORY_NAME: Mattermost.app
  AUTOINSTALL_GROUP_NAME: Mattermost auto-install
