Description: Uploads a Mac App Store app configuration to the Jamf Pro Server.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftToDo-macapp
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.FreeMacApps-macapp-no-users

Input:
  NAME: Microsoft To Do
  JSS_INVENTORY_NAME: "Microsoft To Do.app"
  AUTOINSTALL_GROUP_NAME: "Microsoft To Do auto-install"
