Description: Uploads a Mac App Store app configuration to the Jamf Pro Server.
Identifier: com.github.eth-its-recipes.jamf.Slack-macapp
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.FreeMacApps-macapp-no-users

Input:
  NAME: Slack
  JSS_INVENTORY_NAME: Slack.app
  AUTOINSTALL_GROUP_NAME: Slack auto-install
