<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>PayloadContent</key>
        <array>
            <dict>
                <key>NotificationSettings</key>
                <array>
                    <dict>
                        <key>AlertType</key>
                        <integer>1</integer>
                        <key>BadgesEnabled</key>
                        <false/>
                        <key>BundleIdentifier</key>
                        <string>com.jamfsoftware.selfservice.mac</string>
                        <key>CriticalAlertEnabled</key>
                        <false/>
                        <key>NotificationsEnabled</key>
                        <true/>
                        <key>PreviewType</key>
                        <integer>2</integer>
                        <key>ShowInCarPlay</key>
                        <false/>
                        <key>ShowInLockScreen</key>
                        <true/>
                        <key>ShowInNotificationCenter</key>
                        <true/>
                        <key>SoundsEnabled</key>
                        <false/>
                    </dict>
                    <dict>
                        <key>AlertType</key>
                        <integer>1</integer>
                        <key>BadgesEnabled</key>
                        <false/>
                        <key>BundleIdentifier</key>
                        <string>com.jamfsoftware.Management-Action</string>
                        <key>CriticalAlertEnabled</key>
                        <false/>
                        <key>NotificationsEnabled</key>
                        <true/>
                        <key>PreviewType</key>
                        <integer>2</integer>
                        <key>ShowInCarPlay</key>
                        <false/>
                        <key>ShowInLockScreen</key>
                        <true/>
                        <key>ShowInNotificationCenter</key>
                        <true/>
                        <key>SoundsEnabled</key>
                        <false/>
                    </dict>
                </array>
                <key>PayloadDisplayName</key>
                <string>Notifications</string>
                <key>PayloadIdentifier</key>
                <string>com.apple.notificationsettings.BA564405-8EBC-4FAD-9589-24A2C2267499</string>
                <key>PayloadType</key>
                <string>com.apple.notificationsettings</string>
                <key>PayloadUUID</key>
                <string>BA564405-8EBC-4FAD-9589-24A2C2267499</string>
                <key>PayloadVersion</key>
                <integer>1</integer>
            </dict>
        </array>
        <key>PayloadDisplayName</key>
        <string>%PROFILE_NAME%</string>
        <key>PayloadDescription</key>
        <string>%PROFILE_DESCRIPTION%</string>
        <key>PayloadOrganization</key>
        <string>%ORGANIZATION%</string>
        <key>PayloadIdentifier</key>
        <string>com.jamfsoftware.notifications</string>
        <key>PayloadType</key>
        <string>Configuration</string>
        <key>PayloadUUID</key>
        <string>6AE13AB4-FDFC-4B73-A9EA-2194C80E7007</string>
        <key>PayloadVersion</key>
        <integer>1</integer>
    </dict>
</plist>
