<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>PayloadContent</key>
		<array>
			<dict>
				<key>PayloadDescription</key>
				<string>Configures Privacy Preferences Policy Control settings</string>
				<key>PayloadDisplayName</key>
				<string>Privacy Preferences Policy Control</string>
				<key>PayloadIdentifier</key>
				<string>ch.ethz.A9FC8DC5-1957-4B02-8B93-586E6BC5CD28</string>
				<key>PayloadType</key>
				<string>com.apple.TCC.configuration-profile-policy</string>
				<key>PayloadUUID</key>
				<string>A9FC8DC5-1957-4B02-8B93-586E6BC5CD28</string>
				<key>PayloadVersion</key>
				<integer>1</integer>
				<key>Services</key>
				<dict>
					<key>Accessibility</key>
					<array>
						<dict>
							<key>Allowed</key>
							<true/>
							<key>CodeRequirement</key>
							<string>identifier "com.blacktree.Quicksilver" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = ATVCND8EAP</string>
							<key>Comment</key>
							<string></string>
							<key>Identifier</key>
							<string>com.blacktree.Quicksilver</string>
							<key>IdentifierType</key>
							<string>bundleID</string>
							<key>StaticCode</key>
							<false/>
						</dict>
					</array>
				</dict>
			</dict>
		</array>
		<key>PayloadDescription</key>
		<string>Gives Quicksilver Accessibility permissions</string>
		<key>PayloadDisplayName</key>
		<string>Quicksilver Privacy Preferences</string>
		<key>PayloadIdentifier</key>
		<string>ch.ethz.35F1C758-7993-45CE-AA37-72C6CC997E8D</string>
		<key>PayloadOrganization</key>
		<string>ETH Zürich</string>
		<key>PayloadScope</key>
		<string>System</string>
		<key>PayloadType</key>
		<string>Configuration</string>
		<key>PayloadUUID</key>
		<string>35F1C758-7993-45CE-AA37-72C6CC997E8D</string>
		<key>PayloadVersion</key>
		<integer>1</integer>
	</dict>
</plist>
