Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.Compressor-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-OS-exclude-max-prod

Input:
  NAME: Compressor
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Compressor
  SELFSERVICE_ICON: Compressor 4.png
