Description: Creates the trigger policy for a particular title.
Identifier: com.github.eth-its-recipes.jamf.erase-install-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-triggeronly-prod

Input:
  NAME: erase-install.sh
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.erase-install
  TRIGGER_NAME: "erase-install-install"
