Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.Grammarly-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-preset-prod

Input:
  NAME: Grammarly Desktop
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Grammarly
  EXTENSION_ATTRIBUTE_NAME: Grammarly Desktop Version
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: does not match regex
  EXTENSION_ATTRIBUTE_VALUE: ^None$|^$
  JSS_INVENTORY_NAME: "%NAME%.app"
  VERSION_STRING_TYPE: CFBundleVersion
  PROD_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed-EA.xml
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-EA.xml