Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.Xcode-prod
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-OS-exclude-max-prod

Input:
  NAME: Xcode
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Xcode
  OS_EXCLUDE_MAX: 10.15.1
