Description: |
  Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.AdobePremiereProSDL-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.AdobeCreativeCloudApps-Template
MinimumVersion: "2.3"

Input:
  NAME: Adobe Premiere Pro 2022 SDL
  LIST_NAME: Adobe_Premiere_Pro_CC_EN_NUL
  JSS_INVENTORY_NAME: Adobe Premiere Pro 2022.app
  SELF_SERVICE_DESCRIPTION: |
    Installs Adobe Premiere Pro with a Shared Device License. This is intended only for labs.

    Version: %version%
    Category: %PKG_CATEGORY%
  SELFSERVICE_ICON: Adobe Premiere Pro 22 SDL.png
