Description: |
  Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.AdobeInDesignSDL-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.AdobeCreativeCloudApps-Template
MinimumVersion: "2.3"

Input:
  NAME: Adobe InDesign 2022 SDL
  LIST_NAME: Adobe_InDesign_CC_EN_NUL
  JSS_INVENTORY_NAME: Adobe InDesign 2022.app
  SELF_SERVICE_DESCRIPTION: |
    Installs Adobe InDesign with a Shared Device License. This is intended only for labs.

    Version: %version%
    Category: %PKG_CATEGORY%
  SELFSERVICE_ICON: Adobe InDesign 23 SDL.png
