Description: |
  Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.AdobePhotoshopSDL
ParentRecipe: com.github.eth-its-recipes.jamf.AdobeCreativeCloudApps-Template
MinimumVersion: "2.3"

Input:
  NAME: Adobe Photoshop 2022 SDL
  LIST_NAME: Adobe_Photoshop_CC_EN_NUL
  JSS_INVENTORY_NAME: Adobe Photoshop 2022.app
  SELFSERVICE_DESCRIPTION: |
    Installs Adobe Photoshop 2022 with a Shared Device License. This is intended only for labs.

    Version: %version%
    Category: %PKG_CATEGORY%
  SELFSERVICE_ICON: Adobe Photoshop 23 SDL.png
