Description: |
  Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.AdobeLightroomClassicSDL
ParentRecipe: com.github.eth-its-recipes.jamf.AdobeCreativeCloudApps-Template
MinimumVersion: "2.3"

Input:
  NAME: Adobe Lightroom Classic SDL
  LIST_NAME: Adobe_Lightroom_Classic_CC_EN_NUL
  JSS_INVENTORY_NAME: Adobe Lightroom Classic.app
  SELFSERVICE_DESCRIPTION: |
    Installs Adobe Lightroom Classic with a Shared Device License. This is intended only for labs.

    Version: %version%
    Category: %PKG_CATEGORY%
  SELFSERVICE_ICON: Adobe Lightroom Classic SDL 11.png
