Description: |
  Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.AdobeIllustratorSDL
ParentRecipe: com.github.eth-its-recipes.jamf.AdobeCreativeCloudApps-Template
MinimumVersion: "2.3"

Input:
  NAME: Adobe Illustrator 2023 SDL
  LIST_NAME: Adobe_Illustrator_CC_EN_NUL
  JSS_INVENTORY_NAME: Adobe Illustrator.app
  SELFSERVICE_DESCRIPTION: |
    Installs Adobe Illustrator with a Shared Device License. This is intended only for labs.

    Version: %version%
    Category: %PKG_CATEGORY%
  SELFSERVICE_ICON: Adobe Illustrator 26 SDL.png
