Description: |
  Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.AdobeIllustratorSDL-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.AdobeCreativeCloudApps-Template
MinimumVersion: "2.3"

Input:
  NAME: Adobe Illustrator SDL
  MAJOR_VERSION: "2022"
  JSS_INVENTORY_NAME: Adobe Illustrator %MAJOR_VERSION%.app
  SELFSERVICE_ICON: "Adobe Illustrator 2022 SDL.png"
