Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.AdoptOpenJDK8
ParentRecipe: com.github.grahampugh.recipes.pkg.AdoptOpenJDK8
MinimumVersion: 2.0.0

Input:
  NAME: AdoptOpenJDK 8
  EXTENSION_ATTRIBUTE_NAME: AdoptOpenJDK8Version
  EXTENSION_ATTRIBUTE_SCRIPT: AdoptOpenJDK-EA.sh
  EXTENSION_ATTRIBUTE_VALUE: '8'
  INSTALL_BUTTON_TEXT: Install %version%
  PARAMETER4_LABEL: JDK major version
  PARAMETER4_VALUE: '8'
  PKG_CATEGORY: Development & Computing
  POLICY_CATEGORY: Untested
  POLICY_NAME: '%NAME% (Testing)'
  POLICY_RUN_COMMAND: echo 'Installation of %NAME% complete'
  POLICY_TEMPLATE: Policy-untested-selfservice-script-parameter4.xml
  REINSTALL_BUTTON_TEXT: Install %version%
  SCRIPT_CATEGORY: Uninstallers
  SCRIPT_NAME: AdoptOpenJDK-uninstall.sh
  SCRIPT_PATH: AdoptOpenJDK-uninstall.sh
  SCRIPT_PRIORITY: Before
  SELFSERVICE_DESCRIPTION: |
    \u200EThe AdoptOpenJDK Java Developement Toolkit, version 8.
    
    Version: %version%
    Category: %PKG_CATEGORY%
  SELFSERVICE_DISPLAY_NAME: '%NAME% (Testing)'
  SELFSERVICE_ICON: AdoptOpenJDK.png
  TESTING_GROUP_NAME: Testing
  TESTING_GROUP_TEMPLATE: StaticGroup-testing.xml
  TEST_USERS_GROUP_NAME: '%NAME% test users'
  TEST_USERS_GROUP_TEMPLATE: SmartGroup-test-users.xml
  TEST_VERSION_INSTALLED_GROUP_NAME: '%NAME% test version installed'
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed-EA.xml
  UPDATE_PREDICATE: pkg_uploaded != True

Process:
- Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%PKG_CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%PKG_CATEGORY%'

- Processor: com.github.grahampugh.recipes.commonprocessors/WritePkgResultToJson

- Processor: StopProcessingIf
  Arguments:
    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%POLICY_CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%SCRIPT_CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
  Arguments:
    replace_script: true
    script_category: '%SCRIPT_CATEGORY%'
    script_name: '%SCRIPT_NAME%'
    script_parameter4: '%PARAMETER4_LABEL%'
    script_path: '%SCRIPT_PATH%'
    script_priority: '%SCRIPT_PRIORITY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfExtensionAttributeUploader
  Arguments:
    ea_name: '%EXTENSION_ATTRIBUTE_NAME%'
    ea_script_path: '%EXTENSION_ATTRIBUTE_SCRIPT%'
    replace_ea: 'True'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%TESTING_GROUP_NAME%'
    computergroup_template: '%TESTING_GROUP_TEMPLATE%'
    replace_group: 'False'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%TEST_USERS_GROUP_NAME%'
    computergroup_template: '%TEST_USERS_GROUP_TEMPLATE%'
    replace_group: 'False'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%TEST_VERSION_INSTALLED_GROUP_NAME%'
    computergroup_template: '%TEST_VERSION_INSTALLED_GROUP_TEMPLATE%'
    replace_group: 'True'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    icon: '%SELFSERVICE_ICON%'
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
    replace_policy: 'True'

- Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult
