Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group. The CLC_LICENSE_SERVER and CLC_LICENSE_PORT keys should be overridden.
Identifier: com.github.eth-its-recipes.jamf.CLCGenomicsWorkbench
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.pkg.CLCGenomicsWorkbench

Input:
  NAME: CLC Genomics Workbench
  LANGUAGE: EN
  LIST_NAME: CLC Genomics Workbench
  JSS_INVENTORY_NAME: "CLC Genomics Workbench 20.app"
  LIST_LANGUAGE: EN
  MAJOR_VERSION: "20"
  CLC_LICENSE_SERVER: ++ REPLACE-ME ++
  CLC_LICENSE_PORT: '6200'
  POLICY_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% (Testing)"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% (Testing)"
  PKG_CATEGORY: Science & Math
  SELFSERVICE_DESCRIPTION: |
    **CLC Genomics Workbench 20** - a software package supporting your daily bioinformatics work.

    **Note**
    On macOS 10.14+, during installation you may be asked to allow "Installer.app" to control "System Events.app". This is required for installation to proceed. It does not require administrator rights.
    After installation is complete, as a security measure you can disallow access by going to **System Preferences - Security and Privacy - Privacy - Automation** and un-checking "System Events.app" in the "Installer.app" item.

    Version: %version%
    Category: %PKG_CATEGORY%
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% test version installed"
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed.xml
  TESTING_GROUP_NAME: Testing
  TESTING_GROUP_TEMPLATE: StaticGroup-testing.xml
  TEST_USERS_GROUP_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% test users"
  TEST_USERS_GROUP_TEMPLATE: SmartGroup-test-users.xml
  POLICY_CATEGORY: Untested
  INSTALL_BUTTON_TEXT: "Install %version%"
  REINSTALL_BUTTON_TEXT: "Install %version%"
  POLICY_TEMPLATE: Policy-untested-selfservice.xml
  SELFSERVICE_ICON: "%NAME%.png"
  POLICY_RUN_COMMAND: 'chown -R "$(stat -f%Su /dev/console):staff" "/Applications/%NAME% %MAJOR_VERSION%" && echo "Corrected permissions for %NAME% %MAJOR_VERSION%."'
  UPDATE_PREDICATE: "pkg_uploaded != True"

Process:
  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%PKG_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%PKG_CATEGORY%"

  - Processor: com.github.grahampugh.recipes.commonprocessors/WritePkgResultToJson

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%TESTING_GROUP_TEMPLATE%"
      computergroup_name: "%TESTING_GROUP_NAME%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%TEST_USERS_GROUP_NAME%"
      computergroup_template: "%TEST_USERS_GROUP_TEMPLATE%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%TEST_VERSION_INSTALLED_GROUP_NAME%"
      computergroup_template: "%TEST_VERSION_INSTALLED_GROUP_TEMPLATE%"
      replace_group: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      icon: "%SELFSERVICE_ICON%"
      replace_policy: "True"

  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult
