Description: |
  Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.

  Required overrides:
  - COMSOL_LICENSE_URL
  - COMSOL_LICENSE_NAME
  - COMSOL_LICENSE_COMPANY
  - COMSOL_LICENSE_TYPE
Identifier: com.github.eth-its-recipes.jamf.Comsol-arm64
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.pkg.Comsol

Input:
  NAME: COMSOL Multiphysics
  PLATFORM: arm64
  PKG_PLATFORM_ID: arm64
  LIST_FILTER: "64"
  MAJOR_VERSION: "6.4"
  MAJOR_VERSION_FOLDER_NAME: "64"
  POLICY_NAME: "%NAME% %MAJOR_VERSION_FOLDER_NAME% %PLATFORM% (Testing)"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %MAJOR_VERSION_FOLDER_NAME% %PLATFORM% (Testing)"
  PKG_CATEGORY: Science & Math
  SELFSERVICE_DESCRIPTION: |
    **Important: COMSOL can only be installed while connected to the ETH network, because the license server must be accessible during the installation process. Please connect to a VPN if you are offsite.**

    COMSOL Multiphysics is a general-purpose simulation software for modelling designs, devices, and processes in all fields of engineering, manufacturing, and scientific research. In addition to using multiphysics modelling for your own projects, you can also turn your models into simulation applications and digital twins for use by other design teams, manufacturing departments, test labs, customers, and more.

    The platform product can be used on its own or expanded with functionality from any combination of add-on modules for simulating electromagnetics, structural mechanics, acoustics, fluid flow, heat transfer, and chemical engineering. The add-on modules and LiveLink products connect seamlessly for a modelling workflow that remains the same regardless of what you are modelling.

    Version: %version%
    Category: %PKG_CATEGORY%
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION_FOLDER_NAME% test version installed"
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed.xml
  PLATFORM_EXCLUSION_GROUP_NAME: "Intel Mac"
  PLATFORM_EXCLUSION: x86_64
  PLATFORM_EXCLUSION_GROUP_TEMPLATE: SmartGroup-platform.xml
  TESTING_GROUP_NAME: Testing
  TESTING_GROUP_TEMPLATE: StaticGroup-testing.xml
  POLICY_CATEGORY: Untested
  INSTALL_BUTTON_TEXT: "Install %version%"
  REINSTALL_BUTTON_TEXT: "Install %version%"
  POLICY_TEMPLATE: Policy-untested-selfservice-platform.xml
  SELFSERVICE_ICON: "%NAME%.png"
  POLICY_RUN_COMMAND: "echo 'Installation of %NAME% %MAJOR_VERSION_FOLDER_NAME% complete'"
  UPDATE_PREDICATE: "pkg_uploaded != True"

Process:
  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%PKG_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%PKG_CATEGORY%"

  - Processor: com.github.grahampugh.recipes.commonprocessors/WritePkgResultToJson

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%TESTING_GROUP_TEMPLATE%"
      computergroup_name: "%TESTING_GROUP_NAME%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%PLATFORM_EXCLUSION_GROUP_NAME%"
      computergroup_template: "%PLATFORM_EXCLUSION_GROUP_TEMPLATE%"
      replace_group: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%TEST_VERSION_INSTALLED_GROUP_NAME%"
      computergroup_template: "%TEST_VERSION_INSTALLED_GROUP_TEMPLATE%"
      replace_group: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      icon: "%SELFSERVICE_ICON%"
      replace_policy: "True"

  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult
