Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.ETHDefenderMonitoringTool
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.pkg.ETHDefenderMonitoringTool

Input:
  NAME: ETH Defender Monitoring Tool
  POLICY_NAME: "%NAME% (Testing)"
  SELFSERVICE_DISPLAY_NAME: "%NAME% (Testing)"
  PKG_CATEGORY: Tools & Accessories
  SELFSERVICE_DESCRIPTION: |
    This tool is designed to be used in conjunction with Microsoft Defender ATP at ETH Zürich.

    Version: %version%
    Category: %PKG_CATEGORY%
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% test version installed"
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed-EA.xml
  TESTING_GROUP_NAME: Testing
  TESTING_GROUP_TEMPLATE: StaticGroup-testing.xml
  EXTENSION_ATTRIBUTE_NAME: ETH Defender Monitoring Tool Version
  EXTENSION_ATTRIBUTE_SCRIPT: ETHDefenderMonitoringTool-EA.sh
  SCRIPT_NAME: ETHDefenderMonitoringTool-postinstall.sh
  SCRIPT_PATH: ETHDefenderMonitoringTool-postinstall.sh
  SCRIPT_PRIORITY: After
  POLICY_CATEGORY: Untested
  INSTALL_BUTTON_TEXT: "Install %version%"
  REINSTALL_BUTTON_TEXT: "Install %version%"
  POLICY_TEMPLATE: Policy-untested-selfservice-script.xml
  SELFSERVICE_ICON: Microsoft Defender.png
  POLICY_RUN_COMMAND: "echo 'Installation of %NAME% complete'"
  UPDATE_PREDICATE: "pkg_uploaded != True"

Process:
  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%PKG_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%PKG_CATEGORY%"

  - Processor: com.github.grahampugh.recipes.commonprocessors/WritePkgResultToJson

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "%PKG_CATEGORY%"
      script_name: "%SCRIPT_NAME%"
      script_path: "%SCRIPT_PATH%"
      script_priority: "%SCRIPT_PRIORITY%"
      replace_script: True

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfExtensionAttributeUploader
    Arguments:
      ea_script_path: "%EXTENSION_ATTRIBUTE_SCRIPT%"
      ea_name: "%EXTENSION_ATTRIBUTE_NAME%"
      replace_ea: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%TESTING_GROUP_TEMPLATE%"
      computergroup_name: "%TESTING_GROUP_NAME%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%TEST_VERSION_INSTALLED_GROUP_NAME%"
      computergroup_template: "%TEST_VERSION_INSTALLED_GROUP_TEMPLATE%"
      replace_group: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      icon: "%SELFSERVICE_ICON%"
      replace_policy: "True"

  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult
