Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.ETHOfficeTemplates
MinimumVersion: "2.3"
ParentRecipe: com.github.grahampugh.recipes.pkg.ETHOfficeTemplates

Input:
  NAME: ETH Templates MSOffice
  PKG_CATEGORY: Productivity
  POLICY_NAME: "%NAME% (Testing)"
  POLICY_TEMPLATE: Policy-untested-selfservice.xml
  EXTENSION_ATTRIBUTE_NAME: ETH Templates MSOffice Version
  EXTENSION_ATTRIBUTE_SCRIPT: ETHOfficeTemplates-EA.sh
  PREINSTALL_SCRIPT_PATH: ETHOfficeTemplates-preinstall.sh
  PREINSTALL_SCRIPT_NAME: ETHOfficeTemplates-preinstall.sh
  PREINSTALL_SCRIPT_PRIORITY: Before
  POSTINSTALL_SCRIPT_PATH: ETHOfficeTemplates-postinstall.sh
  POSTINSTALL_SCRIPT_NAME: ETHOfficeTemplates-postinstall.sh
  POSTINSTALL_SCRIPT_PRIORITY: After
  SELFSERVICE_DISPLAY_NAME: "%NAME% (Testing)"
  SELFSERVICE_DESCRIPTION: |
    Installs the ETH Zuerich templates for Microsoft Word and PowerPoint.

    Version: %version%
    Category: %PKG_CATEGORY%
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% test version installed"
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed-EA.xml
  TESTING_GROUP_NAME: Testing
  TESTING_GROUP_TEMPLATE: StaticGroup-testing.xml
  TEST_USERS_GROUP_NAME: "%NAME% test users"
  TEST_USERS_GROUP_TEMPLATE: SmartGroup-test-users.xml
  POLICY_CATEGORY: Untested
  INSTALL_BUTTON_TEXT: "Install %version%"
  REINSTALL_BUTTON_TEXT: "Install %version%"
  SELFSERVICE_ICON: "%NAME%.png"
  POLICY_RUN_COMMAND: "echo 'Installation of %NAME% complete'"
  UPDATE_PREDICATE: "pkg_uploaded != True"

Process:
  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%PKG_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%PKG_CATEGORY%"

  - Processor: com.github.grahampugh.recipes.commonprocessors/WritePkgResultToJson

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "%POLICY_CATEGORY%"
      script_name: "%PREINSTALL_SCRIPT_NAME%"
      script_path: "%PREINSTALL_SCRIPT_PATH%"
      script_priority: "%PREINSTALL_SCRIPT_PRIORITY%"
      replace_script: True

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "%POLICY_CATEGORY%"
      script_name: "%POSTINSTALL_SCRIPT_NAME%"
      script_path: "%POSTINSTALL_SCRIPT_PATH%"
      script_priority: "%POSTINSTALL_SCRIPT_PRIORITY%"
      replace_script: True

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfExtensionAttributeUploader
    Arguments:
      ea_script_path: "%EXTENSION_ATTRIBUTE_SCRIPT%"
      ea_name: "%EXTENSION_ATTRIBUTE_NAME%"
      replace_ea: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%TESTING_GROUP_TEMPLATE%"
      computergroup_name: "%TESTING_GROUP_NAME%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%TEST_USERS_GROUP_NAME%"
      computergroup_template: "%TEST_USERS_GROUP_TEMPLATE%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%TEST_VERSION_INSTALLED_GROUP_NAME%"
      computergroup_template: "%TEST_VERSION_INSTALLED_GROUP_TEMPLATE%"
      replace_group: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      icon: "%SELFSERVICE_ICON%"
      replace_policy: "True"

  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult
