Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.ETHPrinterDrivers-Ricoh-Vol3
ParentRecipe: com.github.eth-its-recipes.jamf.ETHPrinterDrivers-Ricoh-Template
MinimumVersion: "2.3"

Comment: |
  The SMB share credentials (ETH_PRINTERS_SMB_URL, ETH_PRINTERS_SMB_USERNAME, ETH_PRINTERS_SMB_PASSWORD) must be overridden.

Input:
  NAME: ETH Printer Drivers Ricoh Vol3
  DRIVER_TYPE: Vol3
  PKG_ID: com.RICOH.print.PS_Printers_Vol3_EXP.ppds.pkg
  EXTENSION_ATTRIBUTE_NAME: ETH Printer Drivers Ricoh Vol3 Version
