Description: Downloads the latest version of Firefox and makes a pkg of it then uploads it to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.Firefox
ParentRecipe: com.github.autopkg.pkg.Firefox_EN
MinimumVersion: 2.0.0

Input:
  NAME: Firefox
  INSTALL_BUTTON_TEXT: Install %version%
  LOCALE: en-GB
  ORG_NAME: ETH
  PKG_CATEGORY: Browsers & Players
  PKG_ID: ch.ethz.id.Firefox.pkg
  POLICY_CATEGORY: Untested
  POLICY_NAME: '%NAME% (Testing)'
  POLICY_RUN_COMMAND: chown -R "$(stat -f%Su /dev/console):staff" "/Applications/%NAME%.app" && echo "Corrected permissions for %NAME%."
  POLICY_TEMPLATE: Policy-untested-selfservice.xml
  REINSTALL_BUTTON_TEXT: Install %version%
  RELEASE: latest
  REPLACE_PKG: 'False'
  SELFSERVICE_DESCRIPTION: |
    Firefox is a free and open-source web browser developed by Mozilla. 
    Version: %version%
    Category: %PKG_CATEGORY%
  SELFSERVICE_DISPLAY_NAME: '%NAME% (Testing)'
  SELFSERVICE_ICON: Firefox.png
  TESTING_GROUP_NAME: Testing
  TESTING_GROUP_TEMPLATE: StaticGroup-testing.xml
  TEST_USERS_GROUP_NAME: '%NAME% test users'
  TEST_USERS_GROUP_TEMPLATE: SmartGroup-test-users.xml
  TEST_VERSION_INSTALLED_GROUP_NAME: '%NAME% test version installed'
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed.xml
  UPDATE_PREDICATE: pkg_uploaded != True

Process:
- Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%PKG_CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%PKG_CATEGORY%'
    replace_pkg: '%REPLACE_PKG%'

- Processor: com.github.grahampugh.recipes.commonprocessors/WritePkgResultToJson

- Processor: StopProcessingIf
  Arguments:
    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%POLICY_CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%TESTING_GROUP_NAME%'
    computergroup_template: '%TESTING_GROUP_TEMPLATE%'
    replace_group: 'False'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%TEST_USERS_GROUP_NAME%'
    computergroup_template: '%TEST_USERS_GROUP_TEMPLATE%'
    replace_group: 'False'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%TEST_VERSION_INSTALLED_GROUP_NAME%'
    computergroup_template: '%TEST_VERSION_INSTALLED_GROUP_TEMPLATE%'
    replace_group: 'True'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    icon: '%SELFSERVICE_ICON%'
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
    replace_policy: 'True'

- Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult
