Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.Gimp
MinimumVersion: "2.3"
ParentRecipe: com.github.grahampugh.pkg.GIMP

Input:
  NAME: GIMP
  POLICY_NAME: "%NAME% (Testing)"
  SELFSERVICE_DISPLAY_NAME: "%NAME% (Testing)"
  PKG_CATEGORY: Creativity
  SELFSERVICE_DESCRIPTION: |
    GIMP is a cross-platform image editor available for GNU/Linux, macOS, Windows and more operating systems. Whether you are a graphic designer, photographer, illustrator, or scientist, GIMP provides you with sophisticated tools to get your job done. You can further enhance your productivity with GIMP thanks to many customization options and 3rd party plugins.

    Version: %version%
    Category: %PKG_CATEGORY%
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% test version installed"
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed.xml
  TESTING_GROUP_NAME: Testing
  TESTING_GROUP_TEMPLATE: StaticGroup-testing.xml
  TEST_USERS_GROUP_NAME: "%NAME% test users"
  TEST_USERS_GROUP_TEMPLATE: SmartGroup-test-users.xml
  POLICY_CATEGORY: Untested
  INSTALL_BUTTON_TEXT: "Install %version%"
  REINSTALL_BUTTON_TEXT: "Install %version%"
  POLICY_TEMPLATE: Policy-untested-selfservice.xml
  SELFSERVICE_ICON: "%NAME%.png"
  POLICY_RUN_COMMAND: "echo 'Installation of %NAME% complete'"
  UPDATE_PREDICATE: "pkg_uploaded != True"

Process:
  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%PKG_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%PKG_CATEGORY%"

  - Processor: com.github.grahampugh.recipes.commonprocessors/WritePkgResultToJson

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%TESTING_GROUP_TEMPLATE%"
      computergroup_name: "%TESTING_GROUP_NAME%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%TEST_USERS_GROUP_NAME%"
      computergroup_template: "%TEST_USERS_GROUP_TEMPLATE%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%TEST_VERSION_INSTALLED_GROUP_NAME%"
      computergroup_template: "%TEST_VERSION_INSTALLED_GROUP_TEMPLATE%"
      replace_group: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      icon: "%SELFSERVICE_ICON%"
      replace_policy: "True"

  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult
