Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.JamfSetupManager
MinimumVersion: "2.3"
ParentRecipe: com.github.homebysix.pkg.JamfSetupManager

Input:
  NAME: JamfSetupManager
  # TRIGGER_POLICY_NAME: "%NAME%"
  PKG_CATEGORY: Administration
  # TRIGGER_POLICY_CATEGORY: Triggered Installers
  # TRIGGER_POLICY_TEMPLATE: Policy-prod-triggeronly-nonotification.xml
  # TRIGGER_NAME: "%NAME%-install"
  # TRIGGER_POLICY_RUN_COMMAND: "echo 'Installation of %NAME% complete'"
  # UPDATE_PREDICATE: "pkg_uploaded != True"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%PKG_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Comment: This processor uploads the package with the custom icon in it
    Arguments:
      pkg_category: "%PKG_CATEGORY%"

#  - Processor: com.github.grahampugh.recipes.commonprocessors/WritePkgResultToJson

  # - Processor: StopProcessingIf
  #   Arguments:
  #     predicate: "%UPDATE_PREDICATE%"

  # - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  #   Arguments:
  #     category_name: "%TRIGGER_POLICY_CATEGORY%"

  # - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  #   Arguments:
  #     policy_template: "%TRIGGER_POLICY_TEMPLATE%"
  #     TRIGGER_POLICY_NAME: "%TRIGGER_POLICY_NAME%"
  #     replace_policy: "True"

  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult
