Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.erase-install
ParentRecipe: com.github.grahampugh.recipes.pkg.erase-install
MinimumVersion: 1.0.0

Input:
  NAME: Erase and Reinstall macOS
  INELIGIBLE_GROUP_NAME: '%NAME% ineligible'
  INELIGIBLE_GROUP_TEMPLATE: SmartGroup-macOS-erase-install-ineligible.xml
  INSTALL_BUTTON_TEXT: ERASE!
  PKG_CATEGORY: Administration
  POLICY_CATEGORY: Untested
  POLICY_NAME: '%NAME% (Testing)'
  POLICY_RUN_COMMAND: /Library/Management/erase-install/erase-install.sh --update --erase --sameos
  POLICY_TEMPLATE: Policy-untested-selfservice-macOS.xml
  REINSTALL_BUTTON_TEXT: ERASE!
  SELFSERVICE_DESCRIPTION: |
    WARNING! This will completely erase the device and reinstall macOS to the latest version.
  SELFSERVICE_DISPLAY_NAME: '%NAME% (Testing)'
  SELFSERVICE_ICON: Erase and Reinstall macOS.png
  TESTING_GROUP_NAME: Testing
  TESTING_GROUP_TEMPLATE: StaticGroup-testing.xml
  TEST_USERS_GROUP_NAME: '%NAME% test users'
  TEST_USERS_GROUP_TEMPLATE: SmartGroup-test-users.xml
  UPDATE_PREDICATE: pkg_uploaded == False

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%PKG_CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%PKG_CATEGORY%'

- Processor: com.github.grahampugh.recipes.commonprocessors/WritePkgResultToJson

- Processor: StopProcessingIf
  Arguments:
    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%POLICY_CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%TESTING_GROUP_NAME%'
    computergroup_template: '%TESTING_GROUP_TEMPLATE%'
    replace_group: 'False'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%TEST_USERS_GROUP_NAME%'
    computergroup_template: '%TEST_USERS_GROUP_TEMPLATE%'
    replace_group: 'False'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%INELIGIBLE_GROUP_NAME%'
    computergroup_template: '%INELIGIBLE_GROUP_TEMPLATE%'
    replace_group: 'True'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    icon: '%SELFSERVICE_ICON%'
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
    replace_policy: 'True'

- Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult
