Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftOutlookDataRemoval
MinimumVersion: "2.3"
ParentRecipe: com.github.grahampugh.recipes.pkg.MicrosoftOutlookDataRemoval

Input:
  NAME: Microsoft Outlook Data Removal
  PKG_CATEGORY: Tools & Accessories
  POLICY_NAME: "%NAME% (Testing)"
  SELFSERVICE_DISPLAY_NAME: "%NAME% (Testing)"
  SELFSERVICE_DESCRIPTION: |
    Microsoft Outlook Data Removal deletes all synchronized and local messages/folders from your Mac. If you're using an email service such as Office 365 or Exchange, your mailbox content will resynchronize from the server the next time you start Outlook. 

    WARNING! If you have messages stored in 'On my computer' folders, those will be permanently lost. Only run this tool if the "Microsot Outlook Reset" tool still does not allow you to relaunch Outlook.

    Version: %version%
    Category: %PKG_CATEGORY%
  TESTING_GROUP_NAME: Testing
  TESTING_GROUP_TEMPLATE: StaticGroup-testing.xml
  TEST_USERS_GROUP_NAME: "%NAME% test users"
  TEST_USERS_GROUP_TEMPLATE: SmartGroup-test-users.xml
  POLICY_CATEGORY: Untested
  INSTALL_BUTTON_TEXT: "Delete all email!"
  REINSTALL_BUTTON_TEXT: "Delete all email!"
  POLICY_TEMPLATE: Policy-untested-selfservice-noexclusions.xml
  SELFSERVICE_ICON: "Microsoft Outlook Reset.png"
  POLICY_RUN_COMMAND: "echo '%NAME% complete'"
  POLICY_MESSAGE_START: "Resetting Microsoft Outlook to factory settings"
  POLICY_MESSAGE_FINISH: "Microsoft Outlook has now been reset to factory settings"
  UPDATE_PREDICATE: "pkg_uploaded != True"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%PKG_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%PKG_CATEGORY%"

  - Processor: com.github.grahampugh.recipes.commonprocessors/WritePkgResultToJson

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%TESTING_GROUP_TEMPLATE%"
      computergroup_name: "%TESTING_GROUP_NAME%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%TEST_USERS_GROUP_NAME%"
      computergroup_template: "%TEST_USERS_GROUP_TEMPLATE%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      icon: "%SELFSERVICE_ICON%"
      replace_policy: "True"

  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult
