Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.NiceUpdater2
MinimumVersion: "2.3"
ParentRecipe: com.github.grahampugh.recipes.pkg.NiceUpdater2

Input:
  NAME: macOS Managed Updates
  PKG_CATEGORY: Updates
  POLICY_NAME: "%NAME% (Testing)"
  POLICY_TEMPLATE: Policy-untested-selfservice-script-parameters.xml
  EXTENSION_ATTRIBUTE_NAME: macOS Managed Updates Tool Version
  EXTENSION_ATTRIBUTE_SCRIPT: NiceUpdater2-EA.sh
  STATUS_EXTENSION_ATTRIBUTE_NAME: macOS Managed Updates Status
  STATUS_EXTENSION_ATTRIBUTE_SCRIPT: NiceUpdater2-status-EA.sh
  SCRIPT_NAME: "%NAME%-postinstall.sh"
  SCRIPT_PATH: "NiceUpdater2-postinstall.sh"
  SCRIPT_PRIORITY: After
  PARAMETER4_LABEL: Start hr 0-23
  PARAMETER5_LABEL: Start min 0-59
  PARAMETER6_LABEL: Alert timeout sec
  PARAMETER7_LABEL: Max deferrals
  PARAMETER8_LABEL: Days wait after no updates
  PARAMETER9_LABEL: Days wait after update
  PARAMETER10_LABEL: Custom icon path
  PARAMETER11_LABEL: Parameter 11
  PARAMETER4_VALUE: "13"
  PARAMETER5_VALUE: "00"
  PARAMETER6_VALUE: "3540"
  PARAMETER7_VALUE: "7"
  PARAMETER8_VALUE: "3"
  PARAMETER9_VALUE: "3"
  PARAMETER10_VALUE: /Library/Scripts/nice_updater_custom_icon.png
  PARAMETER11_VALUE: " "
  SELFSERVICE_DISPLAY_NAME: "%NAME% (Testing)"
  SELFSERVICE_DESCRIPTION: |
    Installs a tool maintained by ETH IT Services which encourages you to keep your computer up to date through reminder notifications.

    You are allowed to defer the installation up to ten times before you are required to install the updates.

    Version: %version%
    Category: %PKG_CATEGORY%
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% test version installed"
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed-EA.xml
  TESTING_GROUP_NAME: Testing
  TESTING_GROUP_TEMPLATE: StaticGroup-testing.xml
  TEST_USERS_GROUP_NAME: "%NAME% test users"
  TEST_USERS_GROUP_TEMPLATE: SmartGroup-test-users.xml
  POLICY_CATEGORY: Untested
  INSTALL_BUTTON_TEXT: "Install %version%"
  REINSTALL_BUTTON_TEXT: "Install %version%"
  SELFSERVICE_ICON: Software Update.png
  POLICY_RUN_COMMAND: "echo 'Installation of %NAME% complete'"
  UPDATE_PREDICATE: "pkg_uploaded != True"

Process:
  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%PKG_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%PKG_CATEGORY%"

  - Processor: com.github.grahampugh.recipes.commonprocessors/WritePkgResultToJson

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "%PKG_CATEGORY%"
      script_name: "%SCRIPT_NAME%"
      script_path: "%SCRIPT_PATH%"
      script_priority: "%SCRIPT_PRIORITY%"
      script_parameter4: "%PARAMETER4_LABEL%"
      script_parameter5: "%PARAMETER5_LABEL%"
      script_parameter6: "%PARAMETER6_LABEL%"
      script_parameter7: "%PARAMETER7_LABEL%"
      script_parameter8: "%PARAMETER8_LABEL%"
      script_parameter9: "%PARAMETER9_LABEL%"
      script_parameter10: "%PARAMETER10_LABEL%"
      script_parameter11: "%PARAMETER11_LABEL%"
      replace_script: True

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfExtensionAttributeUploader
    Arguments:
      ea_script_path: "%EXTENSION_ATTRIBUTE_SCRIPT%"
      ea_name: "%EXTENSION_ATTRIBUTE_NAME%"
      replace_ea: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%TESTING_GROUP_TEMPLATE%"
      computergroup_name: "%TESTING_GROUP_NAME%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%TEST_USERS_GROUP_NAME%"
      computergroup_template: "%TEST_USERS_GROUP_TEMPLATE%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%TEST_VERSION_INSTALLED_GROUP_NAME%"
      computergroup_template: "%TEST_VERSION_INSTALLED_GROUP_TEMPLATE%"
      replace_group: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      icon: "%SELFSERVICE_ICON%"
      replace_policy: "True"

  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfExtensionAttributeUploader
    Comment: This EA is not used in smart groups but is a convenience tool for creating an Advanced Search
    Arguments:
      ea_script_path: "%STATUS_EXTENSION_ATTRIBUTE_SCRIPT%"
      ea_name: "%STATUS_EXTENSION_ATTRIBUTE_NAME%"
      replace_ea: "True"
