Description: Downloads the latest version of ETH Printers and makes a pkg of it then uploads it to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.SeqMonk
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.pkg.SeqMonk

Input:
  NAME: SeqMonk
  LANGUAGE: EN
  POLICY_NAME: "%NAME% %LANGUAGE% (Testing)"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %LANGUAGE% (Testing)"
  PKG_CATEGORY: Science & Math
  SELFSERVICE_DESCRIPTION: |
    A tool to visualise and analyse high throughput mapped sequence data.

    Note: this tool requires an R installation. 

    Version: %version%
    Category: %PKG_CATEGORY%
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% %LANGUAGE% test version installed"
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed.xml
  TESTING_GROUP_NAME: Testing
  TESTING_GROUP_TEMPLATE: StaticGroup-testing.xml
  POLICY_CATEGORY: Untested
  POLICY_TEMPLATE: Policy-untested-selfservice-scripts-2-parameter4.xml
  SELFSERVICE_ICON: "%NAME%.png"
  PREINSTALL_SCRIPT_NAME: JDK-preinstall-check.sh
  PREINSTALL_SCRIPT_PATH: JDK-preinstall-check.sh
  SCRIPT_CATEGORY: Administration
  PREINSTALL_SCRIPT_PRIORITY: Before
  PREINSTALL_SCRIPT_PARAMETER4_VALUE: "None"
  POSTINSTALL_SCRIPT_NAME: jamf-policy-trigger.sh
  POSTINSTALL_SCRIPT_PATH: jamf-policy-trigger.sh
  POSTINSTALL_SCRIPT_PRIORITY: Before
  POSTINSTALL_SCRIPT_PARAMETER4_LABEL: Trigger name
  POSTINSTALL_SCRIPT_PARAMETER4_VALUE: R-install
  INSTALL_BUTTON_TEXT: "Install %version%"
  REINSTALL_BUTTON_TEXT: "Install %version%"
  POLICY_RUN_COMMAND: "echo 'Installation of %NAME% %LANGUAGE% complete'"
  UPDATE_PREDICATE: "pkg_uploaded != True"

Process:
  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%PKG_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%PKG_CATEGORY%"

  - Processor: com.github.grahampugh.recipes.commonprocessors/WritePkgResultToJson

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "%SCRIPT_CATEGORY%"
      script_name: "%PREINSTALL_SCRIPT_NAME%"
      script_path: "%PREINSTALL_SCRIPT_PATH%"
      script_priority: "%PREINSTALL_SCRIPT_PRIORITY%"
      replace_script: True

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "%SCRIPT_CATEGORY%"
      script_name: "%POSTINSTALL_SCRIPT_NAME%"
      script_path: "%POSTINSTALL_SCRIPT_PATH%"
      script_priority: "%POSTINSTALL_SCRIPT_PRIORITY%"
      script_parameter4: "%POSTINSTALL_PARAMETER4_LABEL%"
      replace_script: True

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%TESTING_GROUP_TEMPLATE%"
      computergroup_name: "%TESTING_GROUP_NAME%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%TEST_VERSION_INSTALLED_GROUP_NAME%"
      computergroup_template: "%TEST_VERSION_INSTALLED_GROUP_TEMPLATE%"
      replace_group: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      icon: "%SELFSERVICE_ICON%"
      replace_policy: "True"

  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult
