<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>PayloadContent</key>
        <array>
            <dict>
                <key>PayloadDescription</key>
                <string>%PROFILE_DESCRIPTION%</string>
                <key>PayloadDisplayName</key>
                <string>Privacy Preferences Policy Control Payload</string>
                <key>PayloadOrganization</key>
                <string>%ORGANIZATION%</string>
                <key>PayloadIdentifier</key>
                <string>org.bsd7.techserv.60D5F9A0-EE5F-41DF-87CC-C9F620BD005B.com.apple.TCC.configuration-profile-policy.E3A8A2AC-5B19-44BD-A6ED-16465C955C71</string>
                <key>PayloadType</key>
                <string>com.apple.TCC.configuration-profile-policy</string>
                <key>PayloadUUID</key>
                <string>E3A8A2AC-5B19-44BD-A6ED-16465C955C71</string>
                <key>PayloadVersion</key>
                <integer>1</integer>
                <key>Services</key>
                <dict>
                    <key>SystemPolicyAllFiles</key>
                    <array>
                        <dict>
                            <key>Allowed</key>
                            <true/>
                            <key>CodeRequirement</key>
                            <string>anchor apple generic and identifier "com.sqwarq.DetectX-Swift" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = MAJ5XBJSG3)</string>
                            <key>Comment</key>
                            <string></string>
                            <key>Identifier</key>
                            <string>com.sqwarq.DetectX-Swift</string>
                            <key>IdentifierType</key>
                            <string>bundleID</string>
                            <key>StaticCode</key>
                            <false/>
                        </dict>
                    </array>
                </dict>
            </dict>
        </array>
        <key>PayloadDescription</key>
        <string>%PROFILE_DESCRIPTION%</string>
        <key>PayloadDisplayName</key>
        <string>%PROFILE_NAME%</string>
        <key>PayloadIdentifier</key>
        <string>org.bsd7.techserv.60D5F9A0-EE5F-41DF-87CC-C9F620BD005B</string>
        <key>PayloadOrganization</key>
        <string>%ORGANIZATION%</string>
        <key>PayloadScope</key>
        <string>System</string>
        <key>PayloadType</key>
        <string>Configuration</string>
        <key>PayloadUUID</key>
        <string>60D5F9A0-EE5F-41DF-87CC-C9F620BD005B</string>
        <key>PayloadVersion</key>
        <integer>1</integer>
    </dict>
</plist>
