<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>PayloadContent</key>
	<array>
		<dict>
			<key>PayloadDisplayName</key>
			<string>Service Management - Managed Login Items</string>
			<key>PayloadIdentifier</key>
			<string>com.apple.servicemanagement.C668DEB1-5E87-43C9-95E0-68D7FC449B61</string>
			<key>PayloadType</key>
			<string>com.apple.servicemanagement</string>
			<key>PayloadUUID</key>
			<string>C668DEB1-5E87-43C9-95E0-68D7FC449B61</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Rules</key>
			<array>
				<dict>
					<key>Comment</key>
					<string>GLPI-Agent LaunchDaemon</string>
					<key>RuleType</key>
					<string>Label</string>
					<key>RuleValue</key>
					<string>org.glpi-project.glpi-agent</string>
				</dict>
				<dict>
					<key>Comment</key>
					<string>GLPI-Agent LaunchDaemon</string>
					<key>RuleType</key>
					<string>Label</string>
					<key>RuleValue</key>
					<string>com.teclib.glpi-agent</string>
				</dict>
			</array>
		</dict>
	</array>
	<key>PayloadDisplayName</key>
	<string>GLPI-Agent - Login Item</string>
	<key>PayloadIdentifier</key>
	<string>876C3970-29E3-4C94-9102-CC644F64219C</string>
	<key>PayloadOrganization</key>
	<string>ETH Zürich</string>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string>876C3970-29E3-4C94-9102-CC644F64219C</string>
	<key>PayloadVersion</key>
	<integer>1</integer>
</dict>
</plist>
