Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.AdobeObsoleteApps-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-EA-purge

Input:
  NAME: Adobe Obsolete Apps
  SCRIPT_PATH: AdobeObsoleteApps-uninstall.zsh
  SCRIPT_NAME: AdobeObsoleteApps-uninstall.zsh
  EXTENSION_ATTRIBUTE_NAME: AdobeObsoleteApps
  EXTENSION_ATTRIBUTE_SCRIPT_PATH: AdobeObsoleteApps.zsh
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: does not match regex
  EXTENSION_ATTRIBUTE_VALUE: ^$
  INSTALLED GROUP NAME: "%USERS_GROUP_NAME%"
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-EA.xml
  USERS_GROUP_NAME: "Adobe Obsolete Apps can be auto-uninstalled"
  SELFSERVICE_ICON: "Adobe Obsolete Apps.png"
