Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.AdobeAir-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Adobe AIR
  SCRIPT_PATH: AdobeAir-uninstall.sh
  SCRIPT_NAME: AdobeAir-uninstall.sh
  EXTENSION_ATTRIBUTE_NAME: AdobeAIRVersion
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: does not match regex
  EXTENSION_ATTRIBUTE_SEARCH_VALUE: "^$"
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-EA.xml
