Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.AdobeAir-autouninstall
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-autouninstall
MinimumVersion: 2.0.0

Input:
  NAME: Adobe AIR
  EXTENSION_ATTRIBUTE_NAME: AdobeAIRVersion
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: does not match regex
  EXTENSION_ATTRIBUTE_SEARCH_VALUE: ^$
  INSTALLED_FOR_AUTOUNINSTALL_GROUP_TEMPLATE: SmartGroup-installed-for-autouninstall-EA.xml
  SCRIPT_NAME: AdobeAir-uninstall.sh
  SCRIPT_PATH: AdobeAir-uninstall.sh
