Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.AdobeObsoleteApps-autouninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-autouninstall

Input:
  NAME: Adobe Obsolete Apps
  SCRIPT_PATH: AdobeObsoleteApps-uninstall.sh
  SCRIPT_NAME: AdobeObsoleteApps-uninstall.sh
  INSTALLED_FOR_AUTOUNINSTALL_GROUP_TEMPLATE: SmartGroup-installed-for-autouninstall-EA.xml
  EXTENSION_ATTRIBUTE_NAME: AdobeObsoleteApps
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: does not match regex
  EXTENSION_ATTRIBUTE_VALUE: "^$"
