Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.AdobeAcrobatReaderDC-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-runcommand-uninstall

Input:
  NAME: Adobe Creative Cloud
  POLICY_RUN_COMMAND: "jamf policy -event Run-AdobeCCCleaner"
  SELFSERVICE_ICON: "%NAME% 5.3.png"
