Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.AffinityDesigner-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Affinity Designer
  SELFSERVICE_DESCRIPTION: "Uninstalls %NAME%"
  PARAMETER5_LABEL: Package Receipt
  PARAMETER5_VALUE: com.seriflabs.affinitydesigner
  TRIGGER_UNINSTALL_POLICY_RUN_COMMAND: "jamf policy 'AffinityLicense-uninstall'"
  SELFSERVICE_ICON: "%NAME% 1.10.png"
