Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.AmazonCorretto-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-EA-no-app-uninstall

Input:
  NAME: "Amazon Corretto"
  UNINSTALL_SELFSERVICE_DISPLAY_NAME: "Uninstall Amazon Corretto"
  SCRIPT_NAME: AmazonCorretto-uninstall.sh
  SCRIPT_PATH: AmazonCorretto-uninstall.sh
  SELFSERVICE_ICON: "AmazonCorretto.png"
  INSTALLED_GROUP_NAME: "AmazonCorretto installed"
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-EA-no-users.xml
  EXTENSION_ATTRIBUTE_NAME: Java-check
  EXTENSION_ATTRIBUTE_SCRIPT: Java-check.sh
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: is
  EXTENSION_ATTRIBUTE_VALUE: Amazon
