Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.AmazonCorretto-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Amazon Corretto
  UNINSTALL_SELFSERVICE_DISPLAY_NAME: "Uninstall Amazon Corretto"
  SCRIPT_NAME: AmazonCorretto-uninstall.sh
  SCRIPT_PATH: AmazonCorretto-uninstall.sh
  SELFSERVICE_ICON: "AmazonCorretto.png"
