Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.AtegraWebFileHandler-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall-no-users

Input:
  NAME: "Ategra Web File Handler"
  SELFSERVICE_DESCRIPTION: "Uninstalls %NAME%"
  JSS_INVENTORY_NAME: "ATEGRA Web File Handler.app"
  TRIGGER_UNINSTALL_POLICY_RUN_COMMAND: "jamf policy -event 'AtegraWebFileHandler-uninstall'"
  SELFSERVICE_ICON: "%NAME%.png"
  SCRIPT_NAME: AtegraWebFileHandler-uninstall.sh
  SCRIPT_PATH: AtegraWebFileHandler-uninstall.sh
