Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.Bartender-autouninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-autouninstall-noexclusion-force

Input:
  NAME: Bartender 5
  PARAMETER5_LABEL: Package Receipt
  PARAMETER5_VALUE: com.surteestudios.Bartender
  AUTOUNINSTALL_POLICY_FREQUENCY: Once every day

