Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.BBEdit-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: BBEdit
  SELFSERVICE_DESCRIPTION: "Uninstalls %NAME%"
  PARAMETER5_LABEL: Package Receipt
  PARAMETER5_VALUE: com.barebones.bbedit.pkg

  SCRIPT_ITSHOP: "ITShop_uninstall.sh"
  PARAMETER_ITSHOP_NAME: "BBEdit Basic"
  PARAMETER_ITSHOP_VERSION: "NONE"

  TRIGGER_UNINSTALL_POLICY_TEMPLATE: Policy-uninstall-triggeronly-script-parameters-ITShop.xml
