Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.Blender-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  PLATFORM: arm64
  NAME: Blender
  SELFSERVICE_DESCRIPTION: "Uninstalls %NAME% %PLATFORM%"
  PARAMETER5_LABEL: Package Receipt
  PARAMETER5_VALUE: org.blenderfoundation.blender
  UNINSTALL_POLICY_NAME: "Uninstall %NAME% %PLATFORM%"
  UNINSTALL_SELFSERVICE_DISPLAY_NAME: "Uninstall %NAME% %PLATFORM%"
  SELFSERVICE_DISPLAY_NAME: "Uninstall %NAME% %PLATFORM%"
  AUTOINSTALL_GROUP_NAME: "%NAME% %PLATFORM% auto-install"
  INSTALLED_GROUP_NAME: "%NAME% %PLATFORM% installed"
  TRIGGER_UNINSTALL_POLICY_NAME: "Trigger-uninstall %NAME% %PLATFORM%"
