Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.CarbonCopyCloner-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Carbon Copy Cloner
  LANGUAGE: EN
  SCRIPT_PATH: CarbonCopyCloner-uninstall.sh
  SCRIPT_NAME: CarbonCopyCloner-uninstall.sh
  SELFSERVICE_DESCRIPTION: Uninstalls Carbon Copy Cloner.
  AUTOINSTALL_GROUP_NAME: "%NAME% %LANGUAGE% auto-install"
  INSTALLED_GROUP_NAME: "%NAME% %LANGUAGE% installed"
  TEST_USERS_GROUP_NAME: "%NAME% %LANGUAGE% test users"
  USERS_GROUP_NAME: "%NAME% %LANGUAGE% users"
  TRIGGER_UNINSTALL_POLICY_NAME: "Trigger-uninstall %NAME% %LANGUAGE%"
  UNINSTALL_POLICY_NAME: "Uninstall %NAME% %LANGUAGE%"
  UNINSTALL_SELFSERVICE_DISPLAY_NAME: "Uninstall %NAME% %LANGUAGE%"
  SELFSERVICE_DISPLAY_NAME: "Uninstall %NAME% %LANGUAGE%"
