Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.ChemDraw23-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-majorversion-script-uninstall

Input:
  NAME: ChemDraw
  JSS_INVENTORY_NAME: ChemDraw 23.app
  MAJOR_VERSION: "23"
  SCRIPT_PATH: ChemDraw-uninstall.zsh
  SCRIPT_NAME: ChemDraw-uninstall.zsh
  PARAMETER4_LABEL: Major version
  PARAMETER4_VALUE: "23"
  LANGUAGE: EN
  UNINSTALL_POLICY_NAME: "Uninstall %NAME% %MAJOR_VERSION% %LANGUAGE%"
  INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% installed"
  TRIGGER_UNINSTALL_POLICY_NAME: "Trigger-uninstall %NAME% %MAJOR_VERSION% %LANGUAGE%"
  UNINSTALL_SELFSERVICE_DESCRIPTION: "Uninstalls %NAME% %MAJOR_VERSION% %LANGUAGE%"
  UNINSTALL_SELFSERVICE_DISPLAY_NAME: "Uninstall %NAME% %MAJOR_VERSION% %LANGUAGE%"
  UNINSTALL_TRIGGER_NAME: "%NAME% %MAJOR_VERSION%-uninstall"
  USERS_GROUP_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% users"
  AUTOINSTALL_GROUP_NAME: "%NAME% %MAJOR_VERSION% %LANGUAGE% auto-install"
  SELFSERVICE_ICON: ChemDraw 20.png

  SCRIPT_ITSHOP: "ITShop_uninstall.sh"
  PARAMETER_ITSHOP_NAME: "ChemDraw"
  PARAMETER_ITSHOP_VERSION: "NONE"

  TRIGGER_UNINSTALL_POLICY_TEMPLATE: Policy-uninstall-triggeronly-script-parameters-ITShop.xml