Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.Chimera-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Chimera (legacy)
  PARAMETER5_LABEL: Package Receipt
  PARAMETER5_VALUE: edu.ucsf.cgl.chimera
