Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.CiscoSecureClient-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Cisco Secure Client
  SCRIPT_PATH: CiscoSecureClient-uninstall.sh
  SCRIPT_NAME: CiscoSecureClient-uninstall.sh
