Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.CitrixReceiver-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Citrix Receiver
  SCRIPT_NAME: CitrixWorkspace-uninstall.sh
  SCRIPT_PATH: CitrixWorkspace-uninstall.sh
  SELFSERVICE_ICON: Citrix Workspace.png
  UNINSTALL_SELFSERVICE_DISPLAY_NAME: "Uninstall Citrix Workspace / Receiver"
  UNINSTALL_SELFSERVICE_DESCRIPTION: "Uninstalls Citrix Workspace / Receiver"
