Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.CitrixWorkspace-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Citrix Workspace
  SCRIPT_NAME: CitrixWorkspace-uninstall.sh
  SCRIPT_PATH: CitrixWorkspace-uninstall.sh
