Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.Comsol64-arm64-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-majorversion-script-uninstall-platform-no-users

Input:
  NAME: COMSOL Multiphysics
  PLATFORM: arm64
  MAJOR_VERSION: "6.4"
  MAJOR_VERSION_FOLDER_NAME: "64"
  SCRIPT_PATH: Comsol-uninstall.zsh
  SCRIPT_NAME: Comsol-uninstall.zsh
  PARAMETER4_TITLE: Comsol Version
  PARAMETER4_VALUE: "%MAJOR_VERSION_FOLDER_NAME%"
