Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.Comsol-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-majorversion-script-uninstall

Input:
  NAME: COMSOL Multiphysics
  APP_FOLDER_VERSION: "60"
  UNINSTALL_POLICY_NAME: "Uninstall %NAME% %APP_FOLDER_VERSION%"
  SCRIPT_PATH: Comsol-uninstall.sh
  SCRIPT_NAME: Comsol-uninstall.sh
  PARAMETER4_TITLE: Comsol Version
  PARAMETER4_VALUE: "%APP_FOLDER_VERSION%"
  INSTALLED_GROUP_NAME: "%NAME% %APP_FOLDER_VERSION% installed"
  TEST_USERS_GROUP_NAME: "%NAME% %APP_FOLDER_VERSION% test users"
  TRIGGER_UNINSTALL_POLICY_NAME: "Trigger-uninstall %NAME% %APP_FOLDER_VERSION%"
  UNINSTALL_SELFSERVICE_DESCRIPTION: "Uninstalls %NAME% %APP_FOLDER_VERSION%"
  UNINSTALL_SELFSERVICE_DISPLAY_NAME: "Uninstall %NAME% %APP_FOLDER_VERSION%"
  UNINSTALL_TRIGGER_NAME: "%NAME% %APP_FOLDER_VERSION%-uninstall"
  USERS_GROUP_NAME: "%NAME% %APP_FOLDER_VERSION% users"
  AUTOINSTALL_GROUP_NAME: "%NAME% %APP_FOLDER_VERSION% auto-install"
  SELFSERVICE_ICON: "%NAME%.png"
