Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.CortexXDR-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Cortex XDR
  SELFSERVICE_DESCRIPTION: "Uninstalls %NAME%"
  SCRIPT_PATH: CortexXDR-uninstall.zsh
  SCRIPT_NAME: CortexXDR-uninstall.zsh
