Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.CSDS2022-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: CSD Suite
  MAJOR_VERSION: "2022"
  SCRIPT_NAME: CSDS-uninstall.zsh
  SCRIPT_PATH: CSDS-uninstall.zsh
  PARAMETER4_LABEL: Major Version
  PARAMETER4_VALUE: "%MAJOR_VERSION%"
  EXTENSION_ATTRIBUTE_NAME: CSDS Version
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: does not match regex
  EXTENSION_ATTRIBUTE_VALUE: "%MAJOR_VERSION%"
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-EA.xml
  TRIGGER_UNINSTALL_POLICY_TEMPLATE: Policy-uninstall-triggeronly-script-parameter4.xml
  SELFSERVICE_ICON: CSDS.png
  UNINSTALL_POLICY_NAME: "Uninstall %NAME% %MAJOR_VERSION%"
  INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% installed"
  TEST_USERS_GROUP_NAME: "%NAME% %MAJOR_VERSION% test users"
  TRIGGER_UNINSTALL_POLICY_NAME: "Trigger-uninstall %NAME% %MAJOR_VERSION%"
  UNINSTALL_SELFSERVICE_DESCRIPTION: "Uninstalls %NAME% %MAJOR_VERSION%"
  UNINSTALL_SELFSERVICE_DISPLAY_NAME: "Uninstall %NAME% %MAJOR_VERSION%"
  UNINSTALL_TRIGGER_NAME: "%NAME% %MAJOR_VERSION%-uninstall"
  USERS_GROUP_NAME: "%NAME% %MAJOR_VERSION% users"
  AUTOINSTALL_GROUP_NAME: "%NAME% %MAJOR_VERSION% auto-install"
