Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.Cytoscape-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Cytoscape
  INSTALLED_GROUP_NAME: "%NAME% EN installed"
  TRIGGER_UNINSTALL_POLICY_NAME: "Trigger-uninstall %NAME% EN"
  UNINSTALL_POLICY_NAME: "Uninstall %NAME% EN"
  UNINSTALL_SELFSERVICE_DISPLAY_NAME: "Uninstall %NAME% EN"
  SELFSERVICE_DISPLAY_NAME: "Uninstall %NAME% EN"
  SCRIPT_NAME: Cytoscape-uninstall.sh
  SCRIPT_PATH: Cytoscape-uninstall.sh
  PARAMETER5_LABEL: Package Receipt
  PARAMETER5_VALUE: org.cytoscape.installer
  SELFSERVICE_ICON: "%NAME%.png"
