Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.Docker-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Docker
  SELFSERVICE_DESCRIPTION: "Uninstalls %NAME%"
  SELFSERVICE_ICON: Docker.png