Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.Docker-arm64-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Docker arm64
  JSS_INVENTORY_NAME: "Docker.app"
  PARAMETER5_LABEL: Package Receipt
  PARAMETER5_VALUE: com.docker.docker
  SELFSERVICE_ICON: Docker.png
