Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.Dropbox-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Dropbox
  SELFSERVICE_DESCRIPTION: "Uninstalls %NAME%"
  PARAMETER5_LABEL: Package Receipt
  PARAMETER5_VALUE: com.getdropbox.dropbox.pkg
  TRIGGER_UNINSTALL_POLICY_TEMPLATE: Policy-uninstall-triggeronly-script-parameters-runcommand.xml
  TRIGGER_UNINSTALL_POLICY_RUN_COMMAND: /bin/rm -rf "/Library/DropboxHelperTools"
  SELFSERVICE_ICON: Dropbox 129.png
