Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.EclipseTemurin-8-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Eclipse Temurin 8
  SCRIPT_PATH: EclipseTemurin-uninstall.sh
  SCRIPT_NAME: EclipseTemurin-uninstall.sh
  PARAMETER4_LABEL: JDK major version
  PARAMETER4_VALUE: "8"
  PKG_ID: "net.temurin-8-x64-hotspot.jdk"
  EXTENSION_ATTRIBUTE_NAME: EclipseTemurin8Version
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: does not match regex
  EXTENSION_ATTRIBUTE_SEARCH_VALUE: "^None$"
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-EA.xml
  SELFSERVICE_ICON: Eclipse Temurin.png
