Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.Enpass-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Enpass
  SELFSERVICE_DESCRIPTION: "Uninstalls %NAME%"
  SCRIPT_PATH: Enpass-uninstall.zsh
  SCRIPT_NAME: Enpass-uninstall.zsh
  SELFSERVICE_ICON: Enpass 6.png
