Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.erase-install-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-runcommand-EA-uninstall

Input:
  NAME: erase-install.sh
  SELFSERVICE_ICON: Erase and Reinstall macOS.png
  TRIGGER_UNINSTALL_POLICY_RUN_COMMAND: rm -rf /Library/Management/erase-install
  EXTENSION_ATTRIBUTE_NAME: erase-install Version
  EXTENSION_ATTRIBUTE_SCRIPT: erase-install-EA.zsh
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: does not match regex
  EXTENSION_ATTRIBUTE_VALUE: "^None$"
