Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.ETHOfficeTemplates-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: ETH Templates MSOffice
  PKG_ID: ch.ethz.id.pkg.ETHTemplatesMSOffice
  SCRIPT_NAME: ETHOfficeTemplates-uninstall.sh
  SCRIPT_PATH: ETHOfficeTemplates-uninstall.sh
  EXTENSION_ATTRIBUTE_NAME: ETH Templates MSOffice Version
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: does not match regex
  EXTENSION_ATTRIBUTE_VALUE: "^None$"
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-pkgreceipt.xml
  SELFSERVICE_ICON: Microsoft Word Template 2021.png
