Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.Fantastical-uninstall
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall
MinimumVersion: 2.0.0

Input:
  NAME: Fantastical
  PARAMETER5_LABEL: Package Receipt
  PARAMETER5_VALUE: com.flexibits.fantastical2.mac
  SELFSERVICE_DESCRIPTION: Uninstalls %NAME%
