Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.Fiji-arm64-uninstall
MinimumVersion: "2.3"
#ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall-platform

Input:
  NAME: Fiji
  PLATFORM: arm64
  SCRIPT_PATH: Fiji-uninstall.sh
  SCRIPT_NAME: Fiji-uninstall.sh
  AUTOINSTALL_GROUP_NAME: "%NAME% %PLATFORM% auto-install"
  INSTALLED_GROUP_NAME: "%NAME% %PLATFORM% installed"
  USERS_GROUP_NAME: "%NAME% %PLATFORM% users"
  TRIGGER_UNINSTALL_POLICY_NAME: "Trigger-uninstall %NAME% %PLATFORM%"
  UNINSTALL_POLICY_NAME: "Uninstall %NAME% %PLATFORM%"
  UNINSTALL_SELFSERVICE_DISPLAY_NAME: "Uninstall %NAME% %PLATFORM%"
  SELFSERVICE_DISPLAY_NAME: "Uninstall %NAME% %PLATFORM%"

#below should be temporary
Input:
  JSS_INVENTORY_NAME: "%NAME%.app"
  SCRIPT_NAME: Application-uninstall.sh
  SCRIPT_PATH: Application-uninstall.sh
  PARAMETER4_LABEL: "Application Name"
  PARAMETER5_LABEL: "Parameter 5"
  PARAMETER6_LABEL: "Parameter 6"
  PARAMETER7_LABEL: "Parameter 7"
  PARAMETER8_LABEL: "Parameter 8"
  PARAMETER9_LABEL: "Parameter 9"
  PARAMETER10_LABEL: "Parameter 10"
  PARAMETER11_LABEL: "Parameter 11"
  PARAMETER4_VALUE: "%JSS_INVENTORY_NAME%"
  PARAMETER5_VALUE: "None"
  PARAMETER6_VALUE: "None"
  PARAMETER7_VALUE: "None"
  PARAMETER8_VALUE: "None"
  PARAMETER9_VALUE: "None"
  PARAMETER10_VALUE: "None"
  PARAMETER11_VALUE: "None"
  SELFSERVICE_ICON: "%NAME%.png"
  AUTOINSTALL_ALL_SOFTWARE_GROUP_NAME: Software Gets Auto-installed
  AUTOINSTALL_GROUP_NAME: "%NAME% %PLATFORM% auto-install"
  AUTOINSTALL_GROUP_TEMPLATE: SmartGroup-autoinstall.xml
  INSTALLED_GROUP_NAME: "%NAME% %PLATFORM% installed"
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-platform.xml
  TESTING_GROUP_NAME: Testing
  TESTING_GROUP_TEMPLATE: StaticGroup-testing.xml
  USERS_GROUP_NAME: "%NAME% %PLATFORM% users"
  USERS_GROUP_TEMPLATE: SmartGroup-users.xml
  UNINSTALL_POLICY_CATEGORY: Uninstallers
  UNINSTALL_POLICY_NAME: "Uninstall %NAME% %PLATFORM%"
  UNINSTALL_POLICY_TEMPLATE: Policy-uninstall-selfservice.xml
  TRIGGER_UNINSTALL_POLICY_CATEGORY: Triggered Uninstallers
  TRIGGER_UNINSTALL_POLICY_NAME: "Trigger-uninstall %NAME% %PLATFORM%"
  TRIGGER_UNINSTALL_POLICY_TEMPLATE: Policy-uninstall-triggeronly-script-parameters.xml
  TRIGGER_UNINSTALL_POLICY_RUN_COMMAND: "echo 'Uninstallation of %NAME% %PLATFORM% complete'"
  UNINSTALL_SELFSERVICE_DESCRIPTION: "Uninstalls %NAME% %PLATFORM%"
  UNINSTALL_SELFSERVICE_DISPLAY_NAME: "Uninstall %NAME% %PLATFORM%"
  UNINSTALL_SELFSERVICE_INSTALL_BUTTON: Uninstall
  UNINSTALL_SELFSERVICE_REINSTALL_BUTTON: Uninstall
  UNINSTALL_TRIGGER_NAME: "%NAME% %PLATFORM%-uninstall"
  SCRIPT_PRIORITY: After
  INSTALL_BUTTON_TEXT: Uninstall
  REINSTALL_BUTTON_TEXT: Uninstall
  SELFSERVICE_FORCE_DESCRIPTION: "false"


Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%UNINSTALL_POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "%UNINSTALL_POLICY_CATEGORY%"
      script_name: "%SCRIPT_NAME%"
      script_path: "%SCRIPT_PATH%"
      script_priority: "%SCRIPT_PRIORITY%"
      script_parameter4: "%PARAMETER4_LABEL%"
      script_parameter5: "%PARAMETER5_LABEL%"
      script_parameter6: "%PARAMETER6_LABEL%"
      script_parameter7: "%PARAMETER7_LABEL%"
      script_parameter8: "%PARAMETER8_LABEL%"
      script_parameter9: "%PARAMETER9_LABEL%"
      script_parameter10: "%PARAMETER10_LABEL%"
      script_parameter11: "%PARAMETER11_LABEL%"
      replace_script: True

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%TESTING_GROUP_TEMPLATE%"
      computergroup_name: "%TESTING_GROUP_NAME%"
      replace_group: False

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%USERS_GROUP_TEMPLATE%"
      computergroup_name: "%USERS_GROUP_NAME%"
      replace_group: False

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%AUTOINSTALL_GROUP_TEMPLATE%"
      computergroup_name: "%AUTOINSTALL_GROUP_NAME%"
      replace_group: False

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%INSTALLED_GROUP_TEMPLATE%"
      computergroup_name: "%INSTALLED_GROUP_NAME%"
      replace_group: True

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%UNINSTALL_POLICY_TEMPLATE%"
      policy_name: "%UNINSTALL_POLICY_NAME%"
      icon: "%SELFSERVICE_ICON%"
      replace_policy: True

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%TRIGGER_UNINSTALL_POLICY_TEMPLATE%"
      policy_name: "%TRIGGER_UNINSTALL_POLICY_NAME%"
      replace_policy: True
