Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.Fiji-x86_64-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall-platform-no-users

Input:
  NAME: Fiji
  PLATFORM: x86_64
  SCRIPT_PATH: Fiji-uninstall.sh
  SCRIPT_NAME: Fiji-uninstall.sh
