Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.FileMakerPro-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: FileMaker Pro
  SCRIPT_PATH: FileMakerPro-uninstall.sh
  SCRIPT_NAME: FileMakerPro-uninstall.sh
  SELFSERVICE_ICON: FileMaker Pro 2023.png
