Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.Firefox-uninstall
MinimumVersion: 2.0.0
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Firefox
  PARAMETER5_LABEL: Package Receipt
  PARAMETER5_VALUE: org.mozilla.firefox.pkg
