Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.FusionInventoryAgent-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: FusionInventory Agent
  SCRIPT_NAME: FusionInventoryAgent-uninstall.sh
  SCRIPT_PATH: FusionInventoryAgent-uninstall.sh
  EXTENSION_ATTRIBUTE_NAME: FusionInventory Agent Version
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: does not match regex
  EXTENSION_ATTRIBUTE_SEARCH_VALUE: "^None$"
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-EA.xml
