Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.GlobalProtect-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: GlobalProtect
  SCRIPT_NAME: GlobalProtect-uninstall.sh
  SCRIPT_PATH: GlobalProtect-uninstall.sh
