Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.GoogleDrive-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Google Drive
  SCRIPT_NAME: GoogleDrive-uninstall.sh
  SCRIPT_PATH: GoogleDrive-uninstall.sh
