Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.GrandPerspective-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: GrandPerspective
  JSS_INVENTORY_NAME: "%NAME%.app"
  PARAMETER5_LABEL: Package Receipt
  PARAMETER5_VALUE: net.sourceforge.grandperspectiv
  SELFSERVICE_ICON: "%NAME%.png"
