Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.GraphicConverter12-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-majorversion-script-uninstall

Input:
  NAME: GraphicConverter
  MAJOR_VERSION: "12"
  JSS_INVENTORY_NAME: "%NAME% %MAJOR_VERSION%.app"
  PARAMETER5_LABEL: Package Receipt
  PARAMETER5_VALUE: com.lemkesoft.graphicconverter12
  SELFSERVICE_ICON: "%NAME% %MAJOR_VERSION%.png"


  SCRIPT_ITSHOP: "ITShop_uninstall.sh"  
  PARAMETER_ITSHOP_NAME: "GraphicConverter"
  PARAMETER_ITSHOP_VERSION: "%MAJOR_VERSION%"
  PARAMETER5_VALUE: ""
  PARAMETER6_VALUE: ""
  PARAMETER7_VALUE: ""
  PARAMETER8_VALUE: ""
  PARAMETER9_VALUE: ""
  PARAMETER10_VALUE: ""
  PARAMETER11_VALUE: ""
  TRIGGER_UNINSTALL_POLICY_TEMPLATE: Policy-uninstall-triggeronly-script-parameters-ITShop.xml