Description: Uploads an uninstaller script to the Jamf Pro Server and creates a Self Service Uninstall Policy and Smart Group, with an EA that is needed to detect installation.
Identifier: com.github.eth-its-recipes.jamf.Homebrew-uninstall
MinimumVersion: "2.3"

Input:
  NAME: Homebrew
  SCRIPT_NAME: Homebrew-uninstall.sh
  SCRIPT_PATH: Homebrew-uninstall.sh
  PARAMETER4_VALUE: ""
  SCRIPT_PRIORITY: After
  EXTENSION_ATTRIBUTE_NAME: "Homebrew version"
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: is not
  EXTENSION_ATTRIBUTE_VALUE: "None"
  EXTENSION_ATTRIBUTE_SCRIPT: Homebrew_version-EA.zsh
  INSTALLED_GROUP_NAME: "Homebrew installed"
  INSTALLED_GROUP_TEMPLATE: SmartGroup-generic-EA-not-empty.xml
  SELFSERVICE_ICON: Homebrew.png
  UNINSTALL_POLICY_NAME: "Uninstall Homebrew"
  UNINSTALL_POLICY_TEMPLATE: Policy-uninstall-selfservice-noexclusion-script.xml
  UNINSTALL_POLICY_CATEGORY: Uninstallers
  INSTALL_BUTTON_TEXT: Uninstall
  REINSTALL_BUTTON_TEXT: Uninstall
  UNINSTALL_SELFSERVICE_INSTALL_BUTTON: "Uninstall"
  UNINSTALL_SELFSERVICE_REINSTALL_BUTTON: "Uninstall"
  UNINSTALL_SELFSERVICE_DISPLAY_NAME: "Uninstall Homebrew (requires admin)"
  UNINSTALL_SELFSERVICE_DESCRIPTION: "This will open a Terminal window and run a script which will uninstall Homebrew. Non-interactive methods of deinstallation are not supported by the developers of Homebrew. This can not be run by users without administrator rights. Contact your local IT Support if you wish to request admin rights in order to uninstall Homebrew."
  SELFSERVICE_FORCE_DESCRIPTION:  "true"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%UNINSTALL_POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "%UNINSTALL_POLICY_CATEGORY%"
      script_name: "%SCRIPT_NAME%"
      script_path: "%SCRIPT_PATH%"
      script_priority: "%SCRIPT_PRIORITY%"
      replace_script: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfExtensionAttributeUploader
    Arguments:
      ea_script_path: "%EXTENSION_ATTRIBUTE_SCRIPT%"
      ea_name: "%EXTENSION_ATTRIBUTE_NAME%"
      replace_ea: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%INSTALLED_GROUP_TEMPLATE%"
      computergroup_name: "%INSTALLED_GROUP_NAME%"
      GROUP_NAME: "%INSTALLED_GROUP_NAME%"
      replace_group: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%UNINSTALL_POLICY_TEMPLATE%"
      policy_name: "%UNINSTALL_POLICY_NAME%"
      icon: "%SELFSERVICE_ICON%"
      replace_policy: "True"