Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.ilastik-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: ilastik
  PARAMETER5_LABEL: Package Receipt
  PARAMETER5_VALUE: ch.ethz.id.pkg.ilastik
  SELFSERVICE_ICON: ilastik.png
