Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.ImageStudio-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall-no-users

Input:
  NAME: ImageStudio
  PARAMETER5_LABEL: Package Receipt
  PARAMETER5_VALUE: ch.ethz.id.pkg.ImageStudio
  SELFSERVICE_ICON: ImageStudio.png
