Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.ISLLightClient-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: ISL Light Client
  LANGUAGE: EN
  PARAMETER5_LABEL: Package Receipt
  PARAMETER5_VALUE: om.islonline.isllight.client.pkg
  PARAMETER6_LABEL: Additional Package Receipt
  PARAMETER6_VALUE: om.islonline.isllight.client
  AUTOINSTALL_GROUP_NAME: "%NAME% %LANGUAGE% auto-install"
  INSTALLED_GROUP_NAME: "%NAME% %LANGUAGE% installed"
  USERS_GROUP_NAME: "%NAME% %LANGUAGE% users"
  TRIGGER_UNINSTALL_POLICY_NAME: "Trigger-uninstall %NAME% %LANGUAGE%"
  UNINSTALL_POLICY_NAME: "Uninstall %NAME% %LANGUAGE%"
  UNINSTALL_SELFSERVICE_DISPLAY_NAME: "Uninstall %NAME% %LANGUAGE%"
  SELFSERVICE_DISPLAY_NAME: "Uninstall %NAME% %LANGUAGE%"
