Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.JabraDirect-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Jabra Direct
  SCRIPT_NAME: JabraDirect-uninstall.sh
  SCRIPT_PATH: JabraDirect-uninstall.sh
