Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.JMP-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-majorversion-script-uninstall

Input:
  NAME: JMP
  MAJOR_VERSION: "15"
  JSS_INVENTORY_NAME: "%NAME% %MAJOR_VERSION%.app"
