Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.KeePassXC-uninstall
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall
MinimumVersion: 2.0.0

Input:
  NAME: KeePassXC
  PARAMETER5_LABEL: Package Receipt
  PARAMETER5_VALUE: org.keepassxc.keepassxc
  PARAMETER6_LABEL: Additional Package Receipt
  PARAMETER6_VALUE: org.keepassx.keepassxc
