Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.Keynote-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall-no-users

Input:
  NAME: Keynote
  SELFSERVICE_DESCRIPTION: "Uninstalls %NAME%"
  PARAMETER5_LABEL: Package Receipt
  PARAMETER5_VALUE: com.apple.iWork.Keynote
  SELFSERVICE_ICON: Keynote 13.1.png
