Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.LibreOffice-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: LibreOffice
  PARAMETER5_LABEL: Package Receipt
  PARAMETER5_VALUE: org.libreoffice.langpack-de
  SELFSERVICE_ICON: LibreOffice 7.png
