Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.LogitechOptionsPlus-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall-no-users

Input:
  NAME: "LogitechOptionsPlus"
  SELFSERVICE_DESCRIPTION: "Uninstalls %NAME%"
  PARAMETER5_LABEL: Package Receipt
  PARAMETER5_VALUE: com.logi.optionsplus
  JSS_INVENTORY_NAME: "Logi Options+.app"
  TRIGGER_UNINSTALL_POLICY_RUN_COMMAND: "jamf policy -event 'LogitechOptionsPlus-uninstall'"
  SELFSERVICE_ICON: "LogitechOptionsPlus.png"
