Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.LogitechPresentation-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Logitech Presentation
  SELFSERVICE_DESCRIPTION: "Uninstalls %NAME%"
  SCRIPT_NAME: LogitechPresentation-uninstall.sh
  SCRIPT_PATH: LogitechPresentation-uninstall.sh
