Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.LogiOptions-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: LogitechOptionsPlus
  SELFSERVICE_DESCRIPTION: "Uninstalls %NAME%"
  PARAMETER5_LABEL: Package Receipt
  PARAMETER5_VALUE: com.logi.optionsplus
  TRIGGER_UNINSTALL_POLICY_RUN_COMMAND: "jamf policy -event 'LogiOptions-uninstall'"
  SELFSERVICE_ICON: "Logi Options+.png"
