Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.Mathematica-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Mathematica
  SELFSERVICE_DESCRIPTION: "Uninstalls %NAME%"
  LANGUAGE: EN
  AUTOINSTALL_GROUP_NAME: "%NAME% EN auto-install"
  INSTALLED_GROUP_NAME: "%NAME% EN installed"
  TEST_USERS_GROUP_NAME: "%NAME% EN test users"
  USERS_GROUP_NAME: "%NAME% EN users"
  TRIGGER_UNINSTALL_POLICY_NAME: "Trigger-uninstall %NAME% EN"
  UNINSTALL_POLICY_NAME: "Uninstall %NAME% EN"
  UNINSTALL_SELFSERVICE_DISPLAY_NAME: "Uninstall %NAME% EN"
  SELFSERVICE_DISPLAY_NAME: "Uninstall %NAME% EN"
