Description: |
  Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.Matlab-Floating-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-majorversion-script-noexclusion-uninstall

Input:
  NAME: MATLAB
  JSS_INVENTORY_NAME: "%NAME%_%MAJOR_VERSION%_%LICENSE%.app"
  MAJOR_VERSION: R2025a
  LICENSE: Floating
  LANGUAGE: EN
  UNINSTALL_POLICY_NAME: "Uninstall %NAME%_%MAJOR_VERSION%_%LICENSE% %LANGUAGE%"
  SCRIPT_PATH: Matlab-uninstall.zsh
  SCRIPT_NAME: Matlab-uninstall.zsh
  PARAMETER4_LABEL: Major version
  PARAMETER4_VALUE: "%MAJOR_VERSION%"
  INSTALLED_GROUP_NAME: "%NAME%_%MAJOR_VERSION%_%LICENSE% %LANGUAGE% installed"
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed.xml
  TRIGGER_UNINSTALL_POLICY_NAME: "Trigger-uninstall %NAME%_%MAJOR_VERSION%_%LICENSE% %LANGUAGE%"
  UNINSTALL_SELFSERVICE_DESCRIPTION: "Uninstalls %NAME%_%MAJOR_VERSION%_%LICENSE% %LANGUAGE%"
  UNINSTALL_SELFSERVICE_DISPLAY_NAME: "Uninstall %NAME%_%MAJOR_VERSION%_%LICENSE% %LANGUAGE%"
  UNINSTALL_TRIGGER_NAME: "%NAME%_%MAJOR_VERSION%_%LICENSE%-uninstall"
  USERS_GROUP_NAME: "%NAME%_%MAJOR_VERSION%_%LICENSE% %LANGUAGE% users"
  SELFSERVICE_ICON: Matlab.png
