Description: |
  Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.

  Requires MAJOR_VERSION to be added to the override
Identifier: com.github.eth-its-recipes.jamf.Matlab-Node-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Matlab
  JSS_INVENTORY_NAME: "%NAME%_%MAJOR_VERSION%_%LICENSE%.app"
  LICENSE: Node
  LANGUAGE: EN
  UNINSTALL_POLICY_NAME: "Uninstall %NAME%_%MAJOR_VERSION%_%LICENSE% %LANGUAGE%"
  SCRIPT_PATH: Matlab-uninstall.sh
  SCRIPT_NAME: Matlab-uninstall.sh
  PARAMETER4_TITLE: Major version
  PARAMETER4_VALUE: "%MAJOR_VERSION%"
  INSTALLED_GROUP_NAME: "%NAME%_%MAJOR_VERSION%_%LICENSE% %LANGUAGE% installed"
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed.xml
  TEST_USERS_GROUP_NAME: "%NAME%_%MAJOR_VERSION%_%LICENSE% %LANGUAGE% test users"
  TRIGGER_UNINSTALL_POLICY_NAME: "Trigger-uninstall %NAME%_%MAJOR_VERSION%_%LICENSE% %LANGUAGE%"
  UNINSTALL_SELFSERVICE_DESCRIPTION: "Uninstalls %NAME%_%MAJOR_VERSION%_%LICENSE% %LANGUAGE%"
  UNINSTALL_SELFSERVICE_DISPLAY_NAME: "Uninstall %NAME%_%MAJOR_VERSION%_%LICENSE% %LANGUAGE%"
  UNINSTALL_TRIGGER_NAME: "%NAME%_%MAJOR_VERSION%_%LICENSE%-uninstall"
  USERS_GROUP_NAME: "%NAME%_%MAJOR_VERSION%_%LICENSE% %LANGUAGE% users"
  AUTOINSTALL_GROUP_NAME: "%NAME%_%MAJOR_VERSION%_%LICENSE% %LANGUAGE% auto-install"
  UNINSTALL_POLICY_TEMPLATE: Policy-uninstall-selfservice.xml
  SELFSERVICE_ICON: Matlab.png
