Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.MAXQDA-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-majorversion-script-uninstall

Input:
  NAME: MAXQDA
  MAJOR_VERSION: "24"
  JSS_INVENTORY_NAME: "%NAME%%MAJOR_VERSION%.app"
  PARAMETER4_VALUE: "%JSS_INVENTORY_NAME%"
  PARAMETER5_LABEL: Package Receipt
  PARAMETER5_VALUE: "de.verbi.%NAME%%MAJOR_VERSION%"
  SELFSERVICE_ICON: "%NAME%%MAJOR_VERSION%.png"
