Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.MendeleyDesktop-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Mendeley Desktop
  SCRIPT_PATH: MendeleyDesktop-uninstall.sh
  SCRIPT_NAME: MendeleyDesktop-uninstall.sh
