Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.MestReNova-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: MestReNova
  SCRIPT_NAME: MestReNova-uninstall.zsh
  SCRIPT_PATH: MestReNova-uninstall.zsh
