Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftOffice-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Microsoft Office
  JSS_INVENTORY_NAME: Microsoft Word.app
  SELFSERVICE_DESCRIPTION: "Uninstalls %NAME%"
  SCRIPT_PATH: MicrosoftOffice-uninstall.sh
  SCRIPT_NAME: MicrosoftOffice-uninstall.sh
  SELFSERVICE_ICON: "Microsoft Office 365.png"
