Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftDefenderATP-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Microsoft Defender ATP
  SELFSERVICE_DESCRIPTION: "Uninstalls %NAME%"
  SCRIPT_PATH: MicrosoftDefenderATP-uninstall.sh
  SCRIPT_NAME: MicrosoftDefenderATP-uninstall.sh
