Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftTeams-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Microsoft Teams
  APPLICATION_NAME_HAS: Microsoft Teams
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-has.xml
  PROD_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed-has.xml
  SELFSERVICE_DESCRIPTION: "Uninstalls %NAME%"
  SELFSERVICE_ICON: Microsoft Teams 5.png
