Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.MicrosoftDefender-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Microsoft Defender
  SELFSERVICE_DESCRIPTION: "Uninstalls %NAME%"
  SCRIPT_PATH: MicrosoftDefender-uninstall.sh
  SCRIPT_NAME: MicrosoftDefender-uninstall.sh
