Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.MindManager-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: MindManager
  SELFSERVICE_DESCRIPTION: "Uninstalls %NAME%"
  SCRIPT_NAME: MindManager-uninstall.sh
  SCRIPT_PATH: MindManager-uninstall.sh
