Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.miniconda-arm64-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall-platform-no-users

Input:
  NAME: miniconda
  PLATFORM: arm64
  SCRIPT_PATH: miniconda-uninstall.sh
  SCRIPT_NAME: miniconda-uninstall.sh
  EXTENSION_ATTRIBUTE_NAME: "minicondaVersion"
  EXTENSION_ATTRIBUTE_SCRIPT: miniconda-EA.zsh
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: does not match regex
  EXTENSION_ATTRIBUTE_VALUE: ^None$
  PLATFORM_EXCLUSION_GROUP_NAME: "Intel Mac"
  PLATFORM_EXCLUSION: x86_64
  PLATFORM_EXCLUSION_GROUP_TEMPLATE: SmartGroup-platform.xml
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-EA-no-users.xml