Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.miniconda-arm64-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall-platform-no-users

Input:
  NAME: miniconda
  PLATFORM: arm64
  SCRIPT_PATH: miniconda-uninstall.sh
  SCRIPT_NAME: miniconda-uninstall.sh

