Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.munkitools-core-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-EA-uninstall

Input:
  NAME: ETH Pkg Uninstaller Tool
  SCRIPT_NAME: munkitools-core-uninstall.sh
  SCRIPT_PATH: munkitools-core-uninstall.sh
  SELFSERVICE_ICON: ETH.png
  EXTENSION_ATTRIBUTE_NAME: ETHPkgUninstallerVersion
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: does not match regex
  EXTENSION_ATTRIBUTE_VALUE: "^$"
