Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.munkitools-core-autouninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-autouninstall

Input:
  NAME: ETH Pkg Uninstaller Tool
  SCRIPT_NAME: munkitools-core-uninstall.sh
  SCRIPT_PATH: munkitools-core-uninstall.sh
  INSTALLED_GROUP_NAME: "%NAME% can be auto-uninstalled"
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-no-users-EA.xml
  EXTENSION_ATTRIBUTE_NAME: ETHPkgUninstallerVersion
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: does not match regex
  EXTENSION_ATTRIBUTE_VALUE: "^$"
  AUTOUNINSTALL_GROUP_TEMPLATE: SmartGroup-autouninstall-force.xml
  AUTOUNINSTALL_POLICY_TEMPLATE: Policy-uninstall-autouninstall-noexclusion.xml
