Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.NotepadPlusPlus-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall-no-users

Input:
  NAME: NotepadPlusPlus
  UNINSTALL_SELFSERVICE_DISPLAY_NAME: "Uninstall Notepad++"
  UNINSTALL_SELFSERVICE_DESCRIPTION: "Uninstalls Notepad++"
  PARAMETER5_LABEL: Package Receipt
  PARAMETER5_VALUE: org.notepadplusplus.mac
  SCRIPT_NAME: NotepadPlusPlus-uninstall.sh
  SCRIPT_PATH: NotepadPlusPlus-uninstall.sh
  JSS_INVENTORY_NAME: "Notepad++.app"