Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.Nudge-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Nudge
  SCRIPT_NAME: Nudge-uninstall.sh
  SCRIPT_PATH: Nudge-uninstall.sh
  SELFSERVICE_ICON: "Nudge.png"
