Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.OmnissaHorizonClient-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Omnissa Horizon Client
  JSS_INVENTORY_NAME_2: "VMware Horizon Client.app"
  SCRIPT_PATH: OmnissaHorizonClient-uninstall.zsh
  SCRIPT_NAME: OmnissaHorizonClient-uninstall.zsh
  SELFSERVICE_DESCRIPTION: Uninstalls Omnissa Horizon Client.
  INSTALLED_GROUP_NAME: "%NAME% installed"
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-no-users-twonames-or.xml
