Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.OpenScapeClient-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: OpenScape Client
  JSS_INVENTORY_NAME: UCDesktopApp.app
  PARAMETER5_LABEL: Package Receipt 1
  PARAMETER5_VALUE: com.unify.ucwcdesktop
  PARAMETER6_LABEL: Package Receipt 2
  PARAMETER6_VALUE: ch.ethz.id.pkg.OpenScapeClient
  SELFSERVICE_ICON: OpenScape Client.png
