Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.polybox-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: polybox
  PARAMETER5_LABEL: Package Receipt
  PARAMETER5_VALUE: ch.ethz.desktopclient
  SELFSERVICE_ICON: polybox 2.10.png
