Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.polybox-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-EA-uninstall

Input:
  NAME: polybox
  PARAMETER5_LABEL: Package Receipt
  PARAMETER5_VALUE: ch.ethz.desktopclient
  VERSION_STRING_TYPE: CFBundleVersion
  EXTENSION_ATTRIBUTE_NAME: polybox Version
  EXTENSION_ATTRIBUTE_SCRIPT: VersionStringOverride-EA.sh
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: does not match regex
  EXTENSION_ATTRIBUTE_VALUE: "^None$"
