Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.PopChar-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: PopChar
  SCRIPT_NAME: PopChar-uninstall.zsh
  SCRIPT_PATH: PopChar-uninstall.zsh
  SELFSERVICE_ICON: PopChar 8.png
