Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.Prism-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Prism
  PARAMETER5_LABEL: Package Receipt
  PARAMETER5_VALUE: com.GraphPad.Prism
  SELFSERVICE_ICON: "Prism 9.png"