Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.PyMOL-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: PyMOL
  SCRIPT_NAME: PyMOL-uninstall.sh
  SCRIPT_PATH: PyMOL-uninstall.sh
