Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.R-arm64-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall-platform-no-users

Input:
  NAME: R
  PLATFORM: arm64
  SCRIPT_PATH: R-uninstall.sh
  SCRIPT_NAME: R-uninstall.sh
