Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.SkypeForBusiness-autouninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-autouninstall

Input:
  NAME: Skype for Business
  SCRIPT_PATH: SkypeForBusiness-uninstall.sh
  SCRIPT_NAME: SkypeForBusiness-uninstall.sh
  INSTALLED_FOR_AUTOUNINSTALL_GROUP_TEMPLATE: SmartGroup-installed-for-autouninstall.xml
