Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.SophosAntiVirusEC-uninstall
MinimumVersion: 2.0.0
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Sophos Anti-Virus EC
  SCRIPT_PATH: SophosAntiVirus-uninstall.sh
  SCRIPT_NAME: SophosAntiVirus-uninstall.sh
  PKG_ID: ch.ethz.id.pkg.SophosAntiVirusEC
  EXTENSION_ATTRIBUTE_NAME: SophosGroupPath
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: does not match regex
  EXTENSION_ATTRIBUTE_SEARCH_VALUE: "^$"
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-EA.xml
  SELFSERVICE_ICON: Sophos Anti-Virus.png
