Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.SophosAntiVirus-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-EA-uninstall

Input:
  NAME: Sophos Anti-Virus
  SCRIPT_PATH: SophosAntiVirus-uninstall.sh
  SCRIPT_NAME: SophosAntiVirus-uninstall.sh
  PARAMETER4_LABEL: Tamper password
  PARAMETER4_VALUE: "None"
  PKG_ID: ch.ethz.id.pkg.SophosAntiVirus
  EXTENSION_ATTRIBUTE_SCRIPT: SophosAntiVirus-EA.sh
  EXTENSION_ATTRIBUTE_NAME: SophosGroupPath
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: does not match regex
  EXTENSION_ATTRIBUTE_SEARCH_VALUE: "^$"
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-app-EA.xml
  SELFSERVICE_ICON: Sophos Anti-Virus.png
