Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.SophosAntiVirus-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Sophos Anti-Virus
  SCRIPT_PATH: SophosAntiVirus-uninstall.sh
  SCRIPT_NAME: SophosAntiVirus-uninstall.sh
  PARAMETER4_LABEL: Tamper password
  PARAMETER4_VALUE: "None"
  PKG_ID: ch.ethz.id.pkg.SophosAntiVirus
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-no-users.xml
  SELFSERVICE_ICON: Sophos Anti-Virus.png
