Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.SophosAntiVirusEC-uninstall
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall
MinimumVersion: 2.0.0

Input:
  NAME: Sophos Anti-Virus EC
  EXTENSION_ATTRIBUTE_NAME: SophosGroupPath
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: does not match regex
  EXTENSION_ATTRIBUTE_SEARCH_VALUE: ^$
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-EA.xml
  PKG_ID: ch.ethz.id.pkg.SophosAntiVirusEC
  SCRIPT_NAME: SophosAntiVirus-uninstall.sh
  SCRIPT_PATH: SophosAntiVirus-uninstall.sh
  SELFSERVICE_ICON: Sophos Anti-Virus.png
