Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.SPSSStatistics27-Floating-uninstall
ParentRecipe: com.github.eth-its-recipes.jamf.template-majorversion-script-uninstall
MinimumVersion: 2.0.0

Input:
  NAME: SPSS Statistics
  ADDITIONAL_EXCLUSION_GROUP_NAME: SPSS Statistics %MAJOR_VERSION% Node License activated
  AUTOINSTALL_GROUP_NAME: '%NAME% %MAJOR_VERSION% %LICENSE% auto-install'
  INSTALLED_GROUP_NAME: '%NAME% %MAJOR_VERSION% %LICENSE% installed'
  LICENSE: Floating
  MAJOR_VERSION: '27'
  SCRIPT_NAME: SPSS Statistics-uninstall.sh
  SCRIPT_PATH: SPSS Statistics-uninstall.sh
  TEST_USERS_GROUP_NAME: '%NAME% %MAJOR_VERSION% %LICENSE% test users'
  TRIGGER_UNINSTALL_POLICY_NAME: Trigger-uninstall %NAME% %MAJOR_VERSION% %LICENSE%
  UNINSTALL_POLICY_NAME: Uninstall %NAME% %MAJOR_VERSION% %LICENSE%
  UNINSTALL_POLICY_TEMPLATE: Policy-uninstall-selfservice-extra-exclusion.xml
  UNINSTALL_SELFSERVICE_DESCRIPTION: Uninstalls %NAME% %MAJOR_VERSION% %LICENSE%
  UNINSTALL_SELFSERVICE_DISPLAY_NAME: Uninstall %NAME% %MAJOR_VERSION% %LICENSE%
  UNINSTALL_TRIGGER_NAME: '%NAME% %MAJOR_VERSION% %LICENSE%-uninstall'
  USERS_GROUP_NAME: '%NAME% %MAJOR_VERSION% %LICENSE% users'
