Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.StataSE17-Floating-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-majorversion-script-uninstall

Input:
  NAME: StataSE
  MAJOR_VERSION: "17"
  SCRIPT_PATH: StataSE-uninstall.sh
  SCRIPT_NAME: StataSE-uninstall.sh
  PARAMETER4_LABEL: Major version
  PARAMETER4_VALUE: "17"
