Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.SuspiciousPackage-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Suspicious Package
  SELFSERVICE_DESCRIPTION: "Uninstalls %NAME%"
  SELFSERVICE_ICON: Suspicious Package 4.png
