Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.SwiftPlaygrounds-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Swift Playgrounds
  SELFSERVICE_DESCRIPTION: "Uninstalls %NAME%"
  JSS_INVENTORY_NAME: Playgrounds.app
