Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.TeamViewer-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: TeamViewer
  SCRIPT_NAME: TeamViewer-uninstall.sh
  SCRIPT_PATH: TeamViewer-uninstall.sh
  SELFSERVICE_ICON: TeamViewer 15.png
