Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.VMwareHorizonClient-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: VMware Horizon Client
  LANGUAGE: EN
  SCRIPT_PATH: VMwareHorizonClient-uninstall.zsh
  SCRIPT_NAME: VMwareHorizonClient-uninstall.zsh
  SELFSERVICE_DESCRIPTION: Uninstalls VMware Horizon Client.
  AUTOINSTALL_GROUP_NAME: "%NAME% %LANGUAGE% auto-install"
  INSTALLED_GROUP_NAME: "%NAME% %LANGUAGE% installed"
  USERS_GROUP_NAME: "%NAME% %LANGUAGE% users"
  TRIGGER_UNINSTALL_POLICY_NAME: "Trigger-uninstall %NAME% %LANGUAGE%"
  UNINSTALL_POLICY_NAME: "Uninstall %NAME% %LANGUAGE%"
  UNINSTALL_SELFSERVICE_DISPLAY_NAME: "Uninstall %NAME% %LANGUAGE%"
  SELFSERVICE_DISPLAY_NAME: "Uninstall %NAME% %LANGUAGE%"
  SELFSERVICE_ICON: "%NAME% 5.png"
