Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.Wireshark-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall-no-users

Input:
  NAME: Wireshark
  JSS_INVENTORY_NAME: "%NAME%.app"
  PARAMETER5_LABEL: Package Receipt
  PARAMETER5_VALUE: org.wireshark.Wireshark
  SELFSERVICE_ICON: "%NAME%.png"
  SCRIPT_PATH: Wireshark-uninstall.sh
  SCRIPT_NAME: Wireshark-uninstall.sh
