Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.XcodeCLTools-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Xcode Command Line Tools
  SCRIPT_NAME: XcodeCLTools-uninstall.zsh
  SCRIPT_PATH: XcodeCLTools-uninstall.zsh
  EXTENSION_ATTRIBUTE_NAME: Xcode Command Line Tools
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: matches regex
  EXTENSION_ATTRIBUTE_VALUE: "^Installed$"
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-EA.xml
  SELFSERVICE_ICON: Terminal.png
