Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.XQuartz-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: XQuartz
  SCRIPT_PATH: XQuartz-uninstall.zsh
  SCRIPT_NAME: XQuartz-uninstall.zsh
