Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.Zoom-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Zoom Client
  PARAMETER5_LABEL: Package Receipt
  PKG_ID: us.zoom.xos
  SELF_SERVICE_ICON: zoom.us.png
  JSS_INVENTORY_NAME: zoom.us.app
