Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.ETHPrinterDrivers-Ricoh-Vol4-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-EA-nodes
MinimumVersion: "2.3"

Input:
  NAME: ETH Printer Drivers Ricoh Vol4
  DRIVER_TYPE: Vol4
  PKG_ID: com.RICOH.print.PS_Printers_Vol4_EXP.ppds.pkg
  EXTENSION_ATTRIBUTE_NAME: ETH Printer Drivers Ricoh Vol4 Version
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.ETHPrinterDriversRicohVol4
  EXTENSION_ATTRIBUTE_SCRIPT: ETHPrinterDrivers-EA.sh
  SELFSERVICE_ICON: "ETH Printers.png"
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed-EA.xml
