Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.FinalCutPro-nodes
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-OS-exclude-max-nodes

Input:
  NAME: Final Cut Pro
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.FinalCutPro
  SELFSERVICE_ICON: Final Cut Pro 10.6.png
