Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.FusionInventoryAgent-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-EA-nodes
MinimumVersion: "2.3"

Input:
  NAME: FusionInventory Agent
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.FusionInventoryAgent
  EXTENSION_ATTRIBUTE_NAME: FusionInventory Agent Version
  EXTENSION_ATTRIBUTE_SCRIPT: FusionInventoryAgent-EA.sh
  SELFSERVICE_ICON: "%NAME%.png"
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed-EA.xml
