Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.NiceUpdater2-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-EA-script-nodes
MinimumVersion: "2.3"

Input:
  NAME: macOS Managed Updates
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.NiceUpdater2
  POLICY_TEMPLATE: Policy-untested-selfservice-script-parameters.xml
  EXTENSION_ATTRIBUTE_NAME: macOS Managed Updates Tool Version
  EXTENSION_ATTRIBUTE_SCRIPT: NiceUpdater2-EA.sh
  STATUS_EXTENSION_ATTRIBUTE_NAME: macOS Managed Updates Status
  STATUS_EXTENSION_ATTRIBUTE_SCRIPT: NiceUpdater2-status-EA.sh
  SCRIPT_NAME: "%NAME%-postinstall.sh"
  SCRIPT_PATH: "NiceUpdater2-postinstall.sh"
  SCRIPT_PRIORITY: After
  PARAMETER4_LABEL: Start hr 0-23
  PARAMETER5_LABEL: Start min 0-59
  PARAMETER6_LABEL: Alert timeout sec
  PARAMETER7_LABEL: Max deferrals
  PARAMETER8_LABEL: Days wait after no updates
  PARAMETER9_LABEL: Days wait after update
  PARAMETER10_LABEL: Custom icon path
  PARAMETER11_LABEL: Parameter 11
  PARAMETER4_VALUE: "13"
  PARAMETER5_VALUE: "00"
  PARAMETER6_VALUE: "3540"
  PARAMETER7_VALUE: "7"
  PARAMETER8_VALUE: "3"
  PARAMETER9_VALUE: "3"
  PARAMETER10_VALUE: /Applications/Self Service.app
  PARAMETER11_VALUE: " "
  SELFSERVICE_ICON: Software Update 2022.png
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed-EA.xml

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfExtensionAttributeUploader
    Comment: This EA is not used in smart groups but is a convenience tool for creating an Advanced Search
    Arguments:
      ea_script_path: "%STATUS_EXTENSION_ATTRIBUTE_SCRIPT%"
      ea_name: "%STATUS_EXTENSION_ATTRIBUTE_NAME%"
      replace_ea: "True"
