Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.Pages-nodes
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-OS-exclude-max-nodes

Input:
  NAME: Pages
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.Pages
