Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.SkypeForBusiness-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: "2.3"

Input:
  NAME: Skype for Business
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.SkypeForBusiness
