Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.VMwareRemoteConsole-nodes
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes

Input:
  NAME: VMware Remote Console
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.VMwareRemoteConsole
