Description: This just uploads an EA to Jamf.
Identifier: com.github.eth-its-recipes.jamf.script.JamfProtectQuarantinedFiles-EA
MinimumVersion: "2.3"

Input:
  EXTENSION_ATTRIBUTE_URL: https://raw.githubusercontent.com/jamf/jamfprotect/main/jamf_pro_extension_attributes/jamf_protect_quarantined_files.sh
  EXTENSION_ATTRIBUTE_NAME: Jamf Protect Quarantined Files
  EXTENSION_ATTRIBUTE_SCRIPT: JamfProtectQuarantinedFiles-EA.sh
  GROUP_NAME: Jamf Protect Quarantined Files Found
  GROUP_TEMPLATE: SmartGroup-generic-EA.xml
  # Check if there are quarantined files
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: is
  EXTENSION_ATTRIBUTE_VALUE: "Yes"

Process:
  - Processor: URLDownloader
    Arguments:
      url: "%EXTENSION_ATTRIBUTE_URL%"
      filename: "%EXTENSION_ATTRIBUTE_SCRIPT%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfExtensionAttributeUploader
    Arguments:
      ea_script_path: "%pathname%"
      ea_name: "%EXTENSION_ATTRIBUTE_NAME%"
      replace_ea: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%GROUP_TEMPLATE%"
      computergroup_name: "%GROUP_NAME%"
      replace_group: "True"
