Description: Creates a set of EAs and smart groups concerned with monitoring a Mac client security baseline.
Identifier: com.github.eth-its-recipes.jamf.group.LastCheckIn-180days
MinimumVersion: "2.3"

Input: {}

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      DAYS_AGO: "180"
      computergroup_template: SmartGroup-LastCheckIn.xml
      computergroup_name: Computer not checked in %DAYS_AGO% days
      replace_group: "True"
