Description: Creates a set of EAs and smart groups concerned with monitoring a Mac client security baseline.
Identifier: com.github.eth-its-recipes.jamf.group.MDMProfileExpired
MinimumVersion: "2.3"

Input: {}

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      EXPIRY_DAYS: "1"
      computergroup_template: SmartGroup-MDMProfileExpired.xml
      computergroup_name: MDM Profile Expired
      replace_group: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      EXPIRY_DAYS: "30"
      computergroup_template: SmartGroup-MDMProfileExpired.xml
      computergroup_name: MDM Profile Expiring in 30 days
      replace_group: "True"
