Description: This just uploads an EA to Jamf.
Identifier: com.github.eth-its-recipes.jamf.script.MDMTopicID-EA
MinimumVersion: "2.3"

Input:
  EXTENSION_ATTRIBUTE_NAME: MDM APNS Topic ID
  EXTENSION_ATTRIBUTE_SCRIPT: MDMTopicID-EA.sh

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfExtensionAttributeUploader
    Arguments:
      ea_script_path: "%EXTENSION_ATTRIBUTE_SCRIPT%"
      ea_name: "%EXTENSION_ATTRIBUTE_NAME%"
      replace_ea: "True"
