Description: Creates a set of EAs and smart groups concerned with monitoring a Mac client security baseline.
Identifier: com.github.eth-its-recipes.jamf.group.ModelNotCompatibleWithSonoma
MinimumVersion: "2.3"

Input:
  COMPATIBILITY_REGEX: ^(iMac[1-9],\d|iMac1[0-8],\d|Macmini[1-7],\d|MacPro[1-6],\d|MacBook([1-9]|10),\d|MacBookAir[1-7],\d|MacBookPro[1-9],\d|MacBookPro1[0-4],\d)$

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: SmartGroup-ModelNotCompatibleWith.xml
      computergroup_name: Not compatible with macOS Sonoma
      replace_group: "True"
