Description: Creates a set of EAs and smart groups concerned with monitoring a Mac client security baseline.
Identifier: com.github.eth-its-recipes.jamf.group.ModelNotCompatibleWithVentura
MinimumVersion: "2.3"

Input:
  COMPATIBILITY_REGEX: ^(iMac1[8-9]|iMac2[0-9]|iMacPro|MacBook9|MacBook1[0-9]|MacBookAir[8-9]|MacBookAir1[0-9]|MacBookPro1[4-9]|Macmini[8-9]|Macmini1[0-9]|MacPro[7-9]|Mac1[3-9]|VirtualMac)

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: SmartGroup-ModelNotCompatibleWith.xml
      computergroup_name: Not compatible with macOS Ventura
      replace_group: "True"
