Description: Creates a set of EAs and smart groups concerned with monitoring a Mac client security baseline.
Identifier: com.github.eth-its-recipes.jamf.group.ModelNotCompatibleWithVentura
MinimumVersion: "2.3"

Input:
  COMPATIBILITY_REGEX: ^(Mac(1[3-9]|BookPro1[4-8]|BookAir([89]|10)|Pro[7-9]|Book\d{2,})|iMac(Pro\d+|(1[89]|[2-9]\d))|Macmini[89]),\d+$

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: SmartGroup-ModelNotCompatibleWith.xml
      computergroup_name: Not compatible with macOS Ventura
      replace_group: "True"
