Description: Creates a set of EAs and smart groups concerned with monitoring a Mac client security baseline.
Identifier: com.github.eth-its-recipes.jamf.group.SecurityBaseline
MinimumVersion: "2.3"

Input: {}

Process:
  # Gatekeeper
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: SmartGroup-GatekeeperOff.xml
      computergroup_name: Gatekeeper settings not compliant
      replace_group: "True"

  # SIP
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: SmartGroup-SIPOff.xml
      computergroup_name: SIP settings not compliant
      replace_group: "True"

  # XProtect
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfExtensionAttributeUploader
    Arguments:
      EXTENSION_ATTRIBUTE_NAME: XProtect status
      ea_script_path: silnite-xprotect-EA.zsh
      ea_name: "%EXTENSION_ATTRIBUTE_NAME%"
      replace_ea: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      GROUP_NAME: XProtect out of date
      EXTENSION_ATTRIBUTE_SEARCH_TYPE: is
      EXTENSION_ATTRIBUTE_VALUE: out of date
      computergroup_template: SmartGroup-generic-EA.xml
      computergroup_name: "%GROUP_NAME%"
      replace_group: "True"

  # Firewall
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: SmartGroup-FirewallOff.xml
      computergroup_name: Firewall settings not compliant
      replace_group: "True"

  # Recovery Lock
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: SmartGroup-RecoveryLockOff.xml
      computergroup_name: Recovery Lock settings not compliant
      replace_group: "True"

  # FileVault
  # - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  #   Arguments:
  #     computergroup_template: SmartGroup-FileVaultOff.xml
  #     computergroup_name: FileVault not compliant
  #     replace_group: "True"

  # Software Update Settings
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfExtensionAttributeUploader
    Arguments:
      EXTENSION_ATTRIBUTE_NAME: Software Update Settings status
      ea_script_path: SoftwareUpdateStatus-EA.zsh
      ea_name: "%EXTENSION_ATTRIBUTE_NAME%"
      replace_ea: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      GROUP_NAME: Software Update settings not compliant
      EXTENSION_ATTRIBUTE_SEARCH_TYPE: is not
      EXTENSION_ATTRIBUTE_VALUE: Compliant
      computergroup_template: SmartGroup-generic-EA-not-empty.xml
      computergroup_name: "%GROUP_NAME%"
      replace_group: "True"
