Description: Creates a set of EAs and smart groups concerned with monitoring a Mac client security baseline.
Identifier: com.github.eth-its-recipes.jamf.group.SecurityBaseline-XProtect
MinimumVersion: "2.3"

Input: {}

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfExtensionAttributeUploader
    Arguments:
      EXTENSION_ATTRIBUTE_NAME: XProtect status
      ea_script_path: silnite-xprotect-EA.zsh
      ea_name: "%EXTENSION_ATTRIBUTE_NAME%"
      replace_ea: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      GROUP_NAME: XProtect out of date
      EXTENSION_ATTRIBUTE_SEARCH_TYPE: is
      EXTENSION_ATTRIBUTE_VALUE: out of date
      computergroup_template: SmartGroup-generic-EA.xml
      computergroup_name: "%GROUP_NAME%"
      replace_group: "True"
