Description: Creates a set of EAs and smart groups concerned with monitoring a Mac client security baseline.
Identifier: com.github.eth-its-recipes.jamf.group.SSHenabled-group
MinimumVersion: "2.3"

Input: {}

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfExtensionAttributeUploader
    Arguments:
      EXTENSION_ATTRIBUTE_NAME: SSH Status
      ea_script_path: SSHStatus-EA.zsh
      ea_name: "%EXTENSION_ATTRIBUTE_NAME%"
      replace_ea: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      GROUP_NAME: SSH Enabled
      EXTENSION_ATTRIBUTE_SEARCH_TYPE: is
      EXTENSION_ATTRIBUTE_VALUE: Enabled
      computergroup_template: SmartGroup-generic-EA-not-empty.xml
      computergroup_name: "%GROUP_NAME%"
      replace_group: "True"
