Description: Downloads the latest version of ETH Printers and creates a package.
Identifier: com.github.eth-its-recipes.pkg.ETHPrinters
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.download.ETHPrinters

Input:
  NAME: ETH Printers
  EXCEPTION: ""
  LOCAL_REPO: /Volumes/AutoPkg_Local_Sources
  LIST_NAME: Printers
  VENDOR: ETH

Process:
  - Arguments:
      archive_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/unzip"
      purge_destination: true
    Processor: Unarchiver

  - Processor: PkgCopier
    Arguments:
      source_pkg: "%RECIPE_CACHE_DIR%/unzip/*.pkg"
      pkg_path: "%RECIPE_CACHE_DIR%/ETH_Printers-%version%.pkg"
