Comment: This recipe obtains the installer from an internal source. This could be provided manaully using the --PKG argument.

Description: Downloads the latest version of SPSSStatistics 27 and creates a package.
Identifier: com.github.eth-its-recipes.pkg.SPSSStatistics27
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.download.internal-sources

Input:
  LIST_NAME: IBM SPSS
  NAME: SPSSStatistics
  LIST_LANGUAGE: ML
  MAJOR_VERSION: "27"

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      purge_destination: true
      destination_path: "%RECIPE_CACHE_DIR%/Unpacked"
      flat_pkg_path: "%pathname%"

  - Processor: PkgPayloadUnpacker
    Arguments:
      purge_destination: true
      pkg_payload_path: "%RECIPE_CACHE_DIR%/Unpacked/SPSSStatistics.pkg/Payload"
      destination_path: "%RECIPE_CACHE_DIR%/Payload"

  - Processor: Versioner
    Arguments:
      input_plist_path: "%RECIPE_CACHE_DIR%/Payload/IBM SPSS Statistics %MAJOR_VERSION%/SPSS Statistics.app/Contents/Info.plist"
      plist_version_key: CFBundleShortVersionString

  - Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/SPSSStatistics-%version%.pkg"
      source_pkg: "%pathname%"
    Processor: PkgCopier

  - Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/Unpacked"
        - "%RECIPE_CACHE_DIR%/Payload"
    Processor: PathDeleter
