Comment: |
  This recipe is a template recipe for auto-uninstall policies which remove an app. It can be overridden directly if the NAME, SELF_SERVICE_DESCRIPTION, SELF_SERVICE_ICON and SCRIPT_PATH keys are overridden. 
  If using a template script, supply the SCRIPT_NAME key to give the script a unique name in Jamf. 
  For Application-uninstall.sh, provide the PKG_ID key in the override. This allows the app to be closed and the package receipt to be removed. You will also need to provide JSS_INVENTORY_NAME if this does not match NAME.
  If the policy name does not match the NAME key, e.g. due to language or license being added to the policy name, SELF_SERVICE_DISPLAY_NAME and smart group name values may also need to be overridden.
  Do not add things like language or license to the NAME key.

Description: Creates an auto-uninstall policy.
Identifier: com.github.eth-its-recipes.jamf.template-script-autouninstall-noexclusion-force
MinimumVersion: "2.3"

Input:
  JSS_INVENTORY_NAME: "%NAME%.app"
  SCRIPT_NAME: Application-uninstall.sh
  SCRIPT_PATH: Application-uninstall.sh
  SCRIPT_PRIORITY: After
  PARAMETER4_LABEL: "Application Name"
  PARAMETER5_LABEL: "Parameter 5"
  PARAMETER6_LABEL: "Parameter 6"
  PARAMETER7_LABEL: "Parameter 7"
  PARAMETER8_LABEL: "Parameter 8"
  PARAMETER9_LABEL: "Parameter 9"
  PARAMETER10_LABEL: "Parameter 10"
  PARAMETER11_LABEL: "Parameter 11"
  PARAMETER4_VALUE: "%JSS_INVENTORY_NAME%"
  PARAMETER5_VALUE: "None"
  PARAMETER6_VALUE: "None"
  PARAMETER7_VALUE: "None"
  PARAMETER8_VALUE: "None"
  PARAMETER9_VALUE: "None"
  PARAMETER10_VALUE: "None"
  PARAMETER11_VALUE: "None"
  USERS_GROUP_NAME: "%NAME% users"
  INSTALLED_GROUP_NAME: "%NAME% installed"
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-no-users.xml
  TRIGGER_UNINSTALL_POLICY_CATEGORY: Triggered Uninstallers
  TRIGGER_UNINSTALL_POLICY_NAME: "Trigger-uninstall %NAME%"
  TRIGGER_UNINSTALL_POLICY_TEMPLATE: Policy-uninstall-triggeronly-script-parameters.xml
  TRIGGER_UNINSTALL_POLICY_RUN_COMMAND: "echo 'Installation of %NAME% complete'"
  AUTOUNINSTALL_POLICY_CATEGORY: Auto-uninstallers
  AUTOUNINSTALL_POLICY_NAME: "Auto-uninstall %NAME%"
  AUTOUNINSTALL_POLICY_TEMPLATE: Policy-uninstall-autouninstall-noexclusion-force.xml
  AUTOUNINSTALL_POLICY_FREQUENCY: Once per day
  UNINSTALL_TRIGGER_NAME: "%NAME%-uninstall"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%AUTOUNINSTALL_POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "%AUTOUNINSTALL_POLICY_CATEGORY%"
      script_name: "%SCRIPT_NAME%"
      script_path: "%SCRIPT_PATH%"
      script_priority: "%SCRIPT_PRIORITY%"
      script_parameter4: "%PARAMETER4_LABEL%"
      script_parameter5: "%PARAMETER5_LABEL%"
      script_parameter6: "%PARAMETER6_LABEL%"
      script_parameter7: "%PARAMETER7_LABEL%"
      script_parameter8: "%PARAMETER8_LABEL%"
      script_parameter9: "%PARAMETER9_LABEL%"
      script_parameter10: "%PARAMETER10_LABEL%"
      script_parameter11: "%PARAMETER11_LABEL%"
      replace_script: True

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%INSTALLED_GROUP_TEMPLATE%"
      computergroup_name: "%INSTALLED_GROUP_NAME%"
      replace_group: True

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%TRIGGER_UNINSTALL_POLICY_TEMPLATE%"
      policy_name: "%TRIGGER_UNINSTALL_POLICY_NAME%"
      replace_policy: True

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%AUTOUNINSTALL_POLICY_TEMPLATE%"
      policy_name: "%AUTOUNINSTALL_POLICY_NAME%"
      replace_policy: True
