<?xml version="1.0" encoding="UTF-8"?>
<policy>
    <general>
        <name>%POLICY_NAME%</name>
        <enabled>true</enabled>
        <trigger>EVENT</trigger>
        <trigger_checkin>true</trigger_checkin>
        <trigger_enrollment_complete>true</trigger_enrollment_complete>
        <trigger_login>false</trigger_login>
        <trigger_logout>false</trigger_logout>
        <trigger_network_state_changed>false</trigger_network_state_changed>
        <trigger_startup>false</trigger_startup>
        <frequency>Once per computer</frequency>
        <category>
            <name>%POLICY_CATEGORY%</name>
        </category>
    </general>
    <scope>
        <all_computers>true</all_computers>
        <computer_groups/>
        <exclusions>
            <computers/>
            <computer_groups/>
        </exclusions>
    </scope>
    <package_configuration>
        <packages>
            <size>1</size>
            <package>
                <name>%pkg_name%</name>
                <action>Install</action>
            </package>
        </packages>
    </package_configuration>
    <scripts>
        <size>0</size>
    </scripts>
    <self_service>
        <use_for_self_service>false</use_for_self_service>
    </self_service>
    <maintenance>
        <recon>false</recon>
    </maintenance>
    <files_processes/>
</policy>
