<?xml version="1.0" encoding="UTF-8"?>
<policy>
    <general>
        <name>%SELFSERVICE_POLICY_NAME%</name>
        <enabled>true</enabled>
        <trigger>EVENT</trigger>
        <trigger_checkin>false</trigger_checkin>
        <trigger_enrollment_complete>false</trigger_enrollment_complete>
        <trigger_login>false</trigger_login>
        <trigger_logout>false</trigger_logout>
        <trigger_network_state_changed>false</trigger_network_state_changed>
        <trigger_startup>false</trigger_startup>
        <trigger_other/>
        <frequency>Ongoing</frequency>
        <category>
            <name>%SELFSERVICE_POLICY_CATEGORY%</name>
        </category>
    </general>
    <scope>
        <all_computers>false</all_computers>
        <computer_groups>
            <computer_group>
                <name>%USERS_GROUP_NAME%</name>
            </computer_group>
        </computer_groups>
        <exclusions>
            <computers/>
            <computer_groups>
                <computer_group>
                    <name>%INSTALLED_GROUP_NAME%</name>
                </computer_group>
            </computer_groups>
        </exclusions>
    </scope>
    <package_configuration>
        <packages>
            <size>0</size>
        </packages>
    </package_configuration>
    <scripts>
        <size>0</size>
    </scripts>
    <self_service>
        <use_for_self_service>true</use_for_self_service>
        <force_users_to_view_description>true</force_users_to_view_description>
        <install_button_text>%INSTALL_BUTTON_TEXT%</install_button_text>
        <reinstall_button_text>%INSTALL_BUTTON_TEXT%</reinstall_button_text>
        <self_service_display_name>%SELFSERVICE_DISPLAY_NAME%</self_service_display_name>
        <self_service_description>%SELFSERVICE_DESCRIPTION%</self_service_description>
    </self_service>
    <maintenance>
        <recon>false</recon>
    </maintenance>
    <files_processes>
        <run_command>jamf policy -event "%TRIGGER_NAME%"</run_command>
    </files_processes>
</policy>
