<?xml version="1.0" encoding="UTF-8"?>
<policy>
    <general>
        <name>%TRIGGERONLY_POLICY_NAME%</name>
        <enabled>true</enabled>
        <frequency>Ongoing</frequency>
        <category>
            <name>%TRIGGERONLY_POLICY_CATEGORY%</name>
        </category>
        <trigger_checkin>false</trigger_checkin>
        <trigger_enrollment_complete>false</trigger_enrollment_complete>
        <trigger_login>false</trigger_login>
        <trigger_logout>false</trigger_logout>
        <trigger_network_state_changed>false</trigger_network_state_changed>
        <trigger_startup>false</trigger_startup>
        <trigger_other>%TRIGGER_NAME%</trigger_other>
    </general>
    <scope>
        <all_computers>true</all_computers>
        <computer_groups/>
        <exclusions>
            <computers/>
            <computer_groups/>
        </exclusions>
    </scope>
    <package_configuration>
        <packages>
            <size>1</size>
            <package>
                <name>%pkg_name%</name>
                <action>Install</action>
            </package>
        </packages>
    </package_configuration>
    <scripts>
        <size>1</size>
        <script>
            <name>%SCRIPT_NAME%</name>
            <priority>%SCRIPT_PRIORITY%</priority>
            <parameter4>%PARAMETER4_LABEL%</parameter4>
            <parameter5>%PARAMETER5_LABEL%</parameter5>
            <parameter6>%PARAMETER6_LABEL%</parameter6>
            <parameter7>%PARAMETER7_LABEL%</parameter7>
            <parameter8/>
            <parameter9/>
            <parameter10/>
            <parameter11/>
        </script>
    </scripts>
    <self_service>
        <use_for_self_service>false</use_for_self_service>
    </self_service>
    <maintenance>
        <recon>true</recon>
    </maintenance>
    <files_processes/>
</policy>
