Description: |
  Downloads the last available installer package from a local source, and creates an installable package. This is a template recipe that can be used for all Adobe CC apps.

  Required override keys:
  - LIST_NAME
Identifier: com.github.eth-its-recipes.pkg.AdobeCreativeCloudApps
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.download.AdobeCreativeCloudApps

Input: {}

Process:
  - Arguments:
      purge_destination: True
      archive_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/unzip"
    Processor: Unarchiver

  - Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%LIST_NAME%-%version%.pkg"
      source_pkg: "%RECIPE_CACHE_DIR%/unzip/*/Build/*_Install.pkg"
    Processor: PkgCopier

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/unzip"
