Description: |
  Downloads latest Adobe Creative Cloud installer and uses it to create a package.

  Required overrides:
  - PKG_NAME
  - NAME
  - LIST_NAME
Identifier: com.github.eth-its-recipes.pkg.AdobeCreativeCloud
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.download.AdobeCreativeCloud

Input:
  NAME: Adobe Creative Cloud

Process:
  - Arguments:
      pkgdirs: {}
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
    Processor: PkgRootCreator

  - Arguments:
      pkgdirs: {}
      pkgroot: "%RECIPE_CACHE_DIR%/Scripts"
    Processor: PkgRootCreator

  - Processor: Unarchiver
    Arguments:
      archive_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      purge_destination: True

  - Processor: Copier
    Arguments:
      source_path: "%destination_path%/*/Build/*_Install.pkg/Contents/Resources"
      destination_path: "%RECIPE_CACHE_DIR%/Scripts"
      overwrite: True

  - Arguments:
      force_pkg_build: True
      pkg_request:
        chown: []
        id: com.adobe.Acrobat.NUL.pkg
        pkgname: "%PKG_NAME%-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
        pkgtype: flat
        scripts: Scripts
        version: "%version%"
    Processor: PkgCreator
