Description: |
  Downloads the last available installer package from a local source, and creates an installable package. This is a template recipe that can be used for all Adobe CC apps.

  Required override keys:
  - LIST_NAME
Identifier: com.github.eth-its-recipes.pkg.AdobeCreativeCloudApps
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.download.AdobeCreativeCloudApps

Input: {}

Process:
  - Arguments:
      purge_destination: True
      archive_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/unzip"
      USE_PYTHON_NATIVE_EXTRACTOR: True
    Processor: Unarchiver

  - Arguments:
      pkgdirs: {}
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
    Processor: PkgRootCreator

  - Arguments:
      pkgdirs: {}
      pkgroot: "%RECIPE_CACHE_DIR%/Scripts"
    Processor: PkgRootCreator

  - Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/Scripts/%LIST_NAME%_Install.pkg"
      source_pkg: "%RECIPE_CACHE_DIR%/unzip/*/Build/Install.pkg"
    Processor: PkgCopier

  - Arguments:
      file_content: |
        #!/bin/bash
        ## script to install an Adobe bundle-style package

        DIR=$(dirname "$0")

        if [[ -d "$DIR/Install.pkg" ]]; then
            echo "installing %LIST_NAME% %version%"
            installer -tgt / -pkg "$DIR/Install.pkg"
        else
            echo "ERROR: installer package not found"
        fi
      file_mode: "0755"
      file_path: "%RECIPE_CACHE_DIR%/Scripts/postinstall"
    Processor: FileCreator

  - Arguments:
      force_pkg_build: True
      pkg_request:
        chown: []
        id: com.adobe.%LIST_NAME%.pkg
        pkgname: "%NAME%-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
        pkgtype: flat
        scripts: Scripts
        version: "%version%"
    Processor: PkgCreator

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/unzip"
