Description: Downloads latest Adobe Creative Cloud installer and uses it to create a package.
Identifier: com.github.eth-its-recipes.pkg.AdobeCreativeCloud
MinimumVersion: 1.0.0
ParentRecipe: com.github.eth-its-recipes.download.AdobeCreativeCloud

Input:
  NAME: Adobe Creative Cloud

Process:
  - Processor: Unarchiver
    Arguments:
      archive_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      purge_destination: True

  - Processor: PkgCopier
    Arguments:
      source_pkg: "%RECIPE_CACHE_DIR%/unpack/CCD*/Build/*Install.pkg"
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
      overwrite: True
