Description: Downloads latest ChimeraX installer and uses it to create a package.
Identifier: com.github.eth-its-recipes.pkg.Affinity
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.download.Affinity

Input:
  NAME: Affinity
  LIST_NAME: Affinity

Process:
Process:
  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: "%pathname%"

  - Processor: AppPkgCreator
