Description: Downloads the latest version of ETH Printers and creates a package.
Identifier: com.github.eth-its-recipes.pkg.AtegraWebFileHandler
ParentRecipe: com.github.eth-its-recipes.download.AtegraWebFileHandler
MinimumVersion: "2.3"

Input:
  NAME: ATEGRA Web File Handler
  LIST_NAME: ATEGRA Web File Handler

Process:
  - Arguments:
      pkg_path: "%pathname%"
    Processor: com.github.eth-its-recipes.processors/DistributionPkgInfo

  - Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/AtegraWebFileHandler-%version%.pkg"
      source_pkg: "%pathname%"
    Processor: PkgCopier