Description: Downloads the latest version of Ategra Web File Handler.
Identifier: com.github.eth-its-recipes.pkg.AtegraWebFileHandler
ParentRecipe: com.github.eth-its-recipes.download.AtegraWebFileHandler
MinimumVersion: "2.3"

Process:
  - Processor: DistributionPkgInfo
    Arguments:
      pkg_path: "%pathname%"

  - Processor: PkgCopier
    Arguments:
      source_pkg: "%pathname%"
      pkg_path: "%RECIPE_CACHE_DIR%/AtegraWebFileHandler-%version%.pkg"
