Description: Downloads the latest version of ETH Printers and creates a package.
Identifier: com.github.eth-its-recipes.pkg.AtegraWebFileHandler
ParentRecipe: com.github.eth-its-recipes.download.AtegraWebFileHandler
MinimumVersion: "2.3"

Input:
  NAME: ATEGRA Web File Handler

Process:
  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/AtegraWebFileHandler-%version%.pkg"
      source_pkg: "%pathname%"
