Description: Downloads the latest version of Prism and creates a package.
Identifier: com.github.eth-its-recipes.pkg.CellProfiler
MinimumVersion: 1.0.0
ParentRecipe: com.github.n8felton.cellprofiler.download

Input:
  NAME: CellProfiler

Process:
  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: "%pathname%"

  - Processor: AppPkgCreator
