Description: Downloads the latest version of Prism and creates a package.
Identifier: com.github.eth-its-recipes.pkg.CellProfiler
MinimumVersion: 1.0.0
ParentRecipe: com.github.n8felton.cellprofiler.download

Input:
  NAME: CellProfiler

Process:
  - Processor: AppPkgCreator
    Arguments:
      app_path: "%RECIPE_CACHE_DIR%/%NAME%/CellProfiler.app"