Description: Downloads the latest version of ChemDraw and creates a package. This recipe works for ChemDraw 18+
Identifier: com.github.eth-its-recipes.pkg.ChemDraw
Input:
  NAME: ChemDraw
  LIST_NAME: ChemDraw Professional
  LIST_LANGUAGE: EN

MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.download.internal-sources

Process:
  - Arguments:
      pkgdirs:
        Applications: "0775"
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
    Processor: PkgRootCreator

  - Arguments:
      pkgdirs:
        Applications: "0775"
      pkgroot: "%RECIPE_CACHE_DIR%/Scripts"
    Processor: PkgRootCreator

  - Arguments:
      file_content: |
        #!/bin/bash
        ## script to tidy up versions of ChemDraw

        DIR=$(dirname "$0")

        # remove /Applications/ChemDraw\ XX.X.app if present
        major_version_app=$(find /Applications -type d -name "ChemDraw %MAJOR_VERSION%\.app" -maxdepth 1)

        if [[ -d "$major_version_app" ]]; then
            find /Applications -type d -name "ChemDraw %MAJOR_VERSION%\.*\.app" -maxdepth 1 -exec rm -rf {} \;
        else
            echo "Nothing to remove"
        fi
      file_mode: "0755"
      file_path: "%RECIPE_CACHE_DIR%/Scripts/postinstall"
    Processor: FileCreator

  - Processor: Copier
    Arguments:
      source_path: "%pathname%/ChemDraw*.app"
      destination_path: "%RECIPE_CACHE_DIR%/pkgroot/Applications/ChemDraw %MAJOR_VERSION%.app"
      overwrite: True

  - Processor: Versioner
    Arguments:
      input_plist_path: "%RECIPE_CACHE_DIR%/pkgroot/Applications/ChemDraw %MAJOR_VERSION%.app/Contents/Info.plist"

  - Arguments:
      force_pkg_build: True
      pkg_request:
        chown: []
        id: com.perkinselmer.ChemDraw%MAJOR_VERSION%.pkg
        pkgname: "%NAME%-%MAJOR_VERSION%-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
        pkgtype: flat
        scripts: Scripts
        version: "%version%"
    Processor: PkgCreator
