Description: |
  Downloads the latest version of ChimeraX and creates a package.
Identifier: com.github.eth-its-recipes.pkg.ChimeraX
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.download.ChimeraX

Input: {}

Process:
  - Arguments:
      pkgdirs: {}
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
    Processor: PkgRootCreator

  - Processor: Copier
    Arguments:
     destination_path: "%RECIPE_CACHE_DIR%/pkgroot/Applications/ChimeraX.app"
     source_path: "%pathname%/ChimeraX.app"

  - Arguments:
      pkg_request:
        chown: []
        id: ch.ethz.id.pkg.ChimeraX%MAJOR_VERSION%
        pkgname: "ChimeraX-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
        pkgtype: flat
        version: "%version%"
    Processor: PkgCreator

  - Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/pkgroot"
    Processor: PathDeleter
