Description: Downloads latest Chimera installer and uses it to create a package.
Identifier: com.github.eth-its-recipes.pkg.Chimera
MinimumVersion: 1.0.0
ParentRecipe: com.github.eth-its-recipes.download.Chimera

Input:
  NAME: Chimera
  LIST_NAME: Chimera

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs: {}
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"

  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: "%pathname%"

  - Arguments:
      pkgdirs:
        Applications: "0775"
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
    Processor: PkgRootCreator

  - Arguments:
      source_path: "%pathname%/Chimera.app"
      destination_path: "%RECIPE_CACHE_DIR%/pkgroot/Applications/Chimera.app"
    Processor: Copier

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown: []
        id: "ch.ethz.id.pkg.chimera"
        pkgname: "%NAME%-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
        pkgtype: flat
        version: "%version%"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/pkgroot"
