Description: Downloads latest ChimeraX installer and uses it to create a package.
Identifier: com.github.eth-its-recipes.pkg.ChimeraX
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.download.ChimeraX

Input:
  NAME: ChimeraX
  LIST_NAME: ChimeraX
  
Process:
  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: "%pathname%"

  - Processor: AppPkgCreator
