Description: Downloads the latest version of Chimera and creates a package.
Identifier: com.github.eth-its-recipes.pkg.Chimera
MinimumVersion: 1.0.0
ParentRecipe: com.github.eth-its-recipes.download.Chimera

Input:
  NAME: Chimera

Process:
  - Processor: Copier
    Arguments:
      source_path: "%pathname%/Chimera*.app"
      destination_path: "%RECIPE_CACHE_DIR%/Chimera.app"

  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: "%pathname%"

  - Processor: AppPkgCreator
    Arguments:
      app_path: "%RECIPE_CACHE_DIR%/Chimera.app"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/Chimera.app"
