Description: Downloads latest ChimeraX installer and uses it to create a package.
Identifier: com.github.eth-its-recipes.pkg.ChimeraX
MinimumVersion: 1.0.0
ParentRecipe: com.github.eth-its-recipes.download.ChimeraX

Input:
  NAME: ChimeraX
  LIST_NAME: ChimeraX

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs: {}
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"

  - Arguments:
      dmg_path: "%pathname_app%"
    Processor: AppDmgVersioner

  - Arguments:
      pkgdirs:
        Applications: "0775"
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
    Processor: PkgRootCreator

  - Arguments:
      source_path: "%pathname_app%/ChimeraX-%version%.app"
      destination_path: "%RECIPE_CACHE_DIR%/pkgroot/Applications/ChimeraX.app"
    Processor: Copier

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown: []
        id: "ch.ethz.id.pkg.chimerax%version%"
        pkgname: "%NAME%-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
        pkgtype: flat
        version: "%version%"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/pkgroot"
