Description: Downloads latest COMSOL Multiphysics installer and uses it to create a package.
Identifier: com.github.eth-its-recipes.pkg.Comsol
MinimumVersion: 1.0.0

Input:
  NAME: COMSOL Multiphysics
  PKG_PLATFORM_ID: arm64
  PLATFORM: arm64

Process:
  - Arguments:
      pkgdirs: {}
      pkgroot: "%RECIPE_CACHE_DIR%/Scripts"
    Processor: PkgRootCreator

  - Arguments:
      pkgdirs: {}
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
    Processor: PkgRootCreator

  - Processor: FileCreator
    Arguments:
      file_path: "%RECIPE_CACHE_DIR%/Scripts/setupconfig.ini"
      file_mode: "0644"
      file_content: |
        installdir =
        uninstall = 0
        showgui = 0
        autofinish = 0
        quiet = 0

        agree = 1
        license = %COMSOL_LICENSE_URL%
        name = %COMSOL_LICENSE_NAME%
        company = %COMSOL_LICENSE_COMPANY%
        lictype = %COMSOL_LICENSE_TYPE%

        matlabdir =
        proedir =
        creopdir =
        llexcelallusers = 0

        doc = selected
        applications = selected
        cad = 1
        licmanager = 1

        shortcuts = 0
        symlinks = 0
        fileassoc = 1
        checkupdate = 0

        setsecuritypolicy = 0
        security.comsol.allowbatch = 1
        security.comsol.allowexternalprocess = 0
        security.comsol.allowmethods = 1
        security.comsol.allowapplications = 1
        security.external.enable = 1
        security.external.propertypermission = 0
        security.external.runtimepermission = 0
        security.external.filepermission = limited
        security.external.socketpermission = 0
        security.external.netpermission = 0
        security.external.reflectpermission = 0
        security.external.securitypermission = 0

  - Processor: FileCreator
    Arguments:
      file_path: "%RECIPE_CACHE_DIR%/Scripts/postinstall"
      file_mode: "0755"
      file_content: |
        #!/bin/bash

        DIR=$(dirname "$0")

        # attach main image
        echo "Mounting COMSOL image"
        APPPATH="/Volumes/COMSOL_setup_dmg"
        mkdir -p "$APPPATH"
        hdiutil attach "%COMSOL_DMG_URL%"" -nobrowse -mountpoint "$APPPATH"

        # find the setup script
        installer=$(find "$APPPATH" -maxdepth 1 -name "COMSOL*.app" | head -n 1)
        if [[ -d "$installer" ]]; then
            echo "Installing $installer" 
            if "$installer/Contents/Resources/setup" -s "$DIR/setupconfig.ini"; then
                echo "Installation succeeded"
            else
                echo "ERROR: installation failed"
            fi
            hdiutil eject $APPPATH
        else
            echo "ERROR: Installer not found."
            hdiutil eject $APPPATH
            exit 1
        fi

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown: []
        id: "ch.ethz.id.pkg.comsol%version%%PKG_PLATFORM_ID%"
        pkgname: "%NAME%-%PLATFORM%-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
        pkgtype: flat
        scripts: Scripts
        version: "%version%"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/Scripts"
        - "%RECIPE_CACHE_DIR%/pkgroot"
