Description: Downloads latest COMSOL Multiphysics installer and uses it to create a package.
Identifier: com.github.eth-its-recipes.pkg.Comsol
MinimumVersion: 1.0.0
ParentRecipe: com.github.eth-its-recipes.download.Comsol

Input:
  NAME: COMSOL Multiphysics
  PKG_PLATFORM_ID: arm64
  PLATFORM: arm64

Process:
  - Arguments:
      pkgdirs: {"Library/Management/ETHZ/Comsol":"0755"}
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
    Processor: PkgRootCreator

  - Processor: FileCreator
    Arguments:
      file_path: "%RECIPE_CACHE_DIR%/pkgroot/Library/Management/ETHZ/Comsol/setupconfig.ini"
      file_mode: "0644"
      file_content: |
        installdir =
        uninstall = 0
        showgui = 0
        autofinish = 0
        quiet = 0

        agree = 1
        license = %COMSOL_LICENSE_URL%
        name = %COMSOL_LICENSE_NAME%
        company = %COMSOL_LICENSE_COMPANY%
        lictype = %COMSOL_LICENSE_TYPE%

        matlabdir =
        proedir =
        creopdir =
        llexcelallusers = 0

        doc = selected
        applications = selected
        cad = 1
        licmanager = 1

        shortcuts = 0
        symlinks = 0
        fileassoc = 1
        checkupdate = 0

        setsecuritypolicy = 0
        security.comsol.allowbatch = 1
        security.comsol.allowexternalprocess = 0
        security.comsol.allowmethods = 1
        security.comsol.allowapplications = 1
        security.external.enable = 1
        security.external.propertypermission = 0
        security.external.runtimepermission = 0
        security.external.filepermission = limited
        security.external.socketpermission = 0
        security.external.netpermission = 0
        security.external.reflectpermission = 0
        security.external.securitypermission = 0

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown: []
        id: "ch.ethz.id.pkg.comsol%COMSOL_VERSION%%PKG_PLATFORM_ID%"
        pkgname: "%NAME%-%PLATFORM%-%COMSOL_VERSION%"
        pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
        pkgtype: flat
        version: "%COMSOL_VERSION%"
        
  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/pkgroot"
