Description: Creates a package of the application.
Identifier: com.github.eth-its-recipes.pkg.Dropbox
ParentRecipe: com.github.autopkg.download.dropbox
MinimumVersion: "2.3"

Input:
  NAME: Dropbox

Process:
  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: "%pathname%"

  - Processor: AppPkgCreator
