Description: Downloads the latest version of Element from Riot and creates a package.
Identifier: com.github.eth-its-recipes.pkg.Element
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.download.Element

Input:
  NAME: Element

Process:
  - Processor: AppPkgCreator
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/Element-%version%.pkg"
