Comment: Created with Recipe Robot v2.5.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of Enpass and creates a package.
Identifier: com.github.eth-its-recipes.pkg.Enpass
Input:
  NAME: Enpass
MinimumVersion: '2.3'
ParentRecipe: com.github.eth-its-recipes.download.Enpass
Process:
- Arguments:
    app_path: '%RECIPE_CACHE_DIR%/%NAME%/Enpass.app'
  Processor: AppPkgCreator
