Description: Downloads the latest version of ETH Office Templates and creates a package.
Identifier: com.github.eth-its-recipes.pkg.ETHTemplatesMSOffice
ParentRecipe: com.github.eth-its-recipes.download.ETHTemplatesMSOffice
MinimumVersion: 1.0.0

Input: {}

Process:
  - Arguments:
      pkgdirs:
        Library: 0755
        Library/Application Support: 0755
        Library/Application Support/Microsoft: 0755
        Library/Application Support/Microsoft/Office365: 0755
        Library/Application Support/Microsoft/Office365/User Content.localized: 0755
        Library/Application Support/Microsoft/Office365/User Content.localized/Templates.localized: 0755
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
    Processor: PkgRootCreator

  - Processor: Unarchiver
    Arguments:
      archive_path: "%RECIPE_CACHE_DIR%/downloads/eth-wordtemplates-korrespondenz.zip"
      destination_path: "%RECIPE_CACHE_DIR%/pkgroot/Library/Application Support/Microsoft/Office365/User Content.localized/Templates.localized"
      purge_destination: true

  - Processor: Unarchiver
    Arguments:
      archive_path: "%RECIPE_CACHE_DIR%/downloads/eth-pp-template-praesentation.zip"
      destination_path: "%RECIPE_CACHE_DIR%/pkgroot/Library/Application Support/Microsoft/Office365/User Content.localized/Templates.localized"
      purge_destination: true

  - Arguments:
      force_pkg_build: true
      pkg_request:
        chown: []
        id: ch.ethz.id.pkg.ETHTemplatesMSOffice
        pkgname: "ETHTemplatesMSOffice-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
        pkgtype: flat
        version: "%version%"
    Processor: PkgCreator

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/Scripts"
        - "%RECIPE_CACHE_DIR%/pkgroot"
