Description: Downloads the latest version of ETH Office Templates and creates a package.
Identifier: com.github.eth-its-recipes.pkg.ETHOfficeTemplates
ParentRecipe: com.github.eth-its-recipes.download.ETHOfficeTemplates
MinimumVersion: "2.3"

Input: {}

Process:
  - Arguments:
      pkgdirs: {}
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
    Processor: PkgRootCreator

  - Arguments:
      pkgdirs: {}
      pkgroot: "%RECIPE_CACHE_DIR%/Scripts"
    Processor: PkgRootCreator

  - Processor: Copier
    Arguments:
      source_path: "%RECIPE_CACHE_DIR%/downloads/eth-wordtemplates-korrespondenz.zip"
      destination_path: "%RECIPE_CACHE_DIR%/Scripts/eth-wordtemplates-korrespondenz.zip"

  - Processor: Copier
    Arguments:
      source_path: "%RECIPE_CACHE_DIR%/downloads/eth-pp-template-praesentation.zip"
      destination_path: "%RECIPE_CACHE_DIR%/Scripts/eth-pp-template-praesentation.zip"

  - Arguments:
      file_content: |
        #!/bin/sh
        ## ETH_Templates_MSOffice installation
        ## Supports Office 2016, 2019 and 365

        DIR=$(dirname "$0")

        ## Remove existing versions to ensure only the new ones are presented
        [[ -d "/Library/Application Support/Microsoft/Office365/User Content.localized/Templates.localized" ]] && rm -rf "/Library/Application Support/Microsoft/Office365/User Content.localized/Templates.localized/*" ||:

        ## Install Templates for Office 2016/2019/365
        mkdir -p "/Library/Application Support/Microsoft/Office365/User Content.localized/Templates.localized"

        unzip $DIR/eth-wordtemplates-korrespondenz.zip -d "/Library/Application Support/Microsoft/Office365/User Content.localized/Templates.localized"
        echo "Word Templates for Office 365 installed"

        unzip $DIR/eth-pp-template-praesentation.zip -d "/Library/Application Support/Microsoft/Office365/User Content.localized/Templates.localized"
        echo "PowerPoint Templates for Office 365 installed"

        ## change permissions
        /bin/chmod -R 655 "/Library/Application Support/Microsoft/Office365/User Content.localized/Templates.localized/"

        ## delete the __MACOSX artifact from the zip files
        [[ -d "/Library/Application Support/Microsoft/Office365/User Content.localized/Templates.localized/__MACOSX" ]] && rm -rf "/Library/Application Support/Microsoft/Office365/User Content.localized/Templates.localized/__MACOSX" ||:
      file_mode: "0755"
      file_path: "%RECIPE_CACHE_DIR%/Scripts/postinstall"
    Processor: FileCreator

  - Arguments:
      pkg_request:
        chown: []
        id: ch.ethz.id.pkg.ETHTemplatesMSOffice
        pkgname: "ETHTemplatesMSOffice-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
        pkgtype: flat
        scripts: Scripts
        version: "%version%"
    Processor: PkgCreator

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/Scripts"
        - "%RECIPE_CACHE_DIR%/pkgroot"
