Description: Downloads the latest version of ETH Printers and creates a package.
Identifier: com.github.eth-its-recipes.pkg.ETHPrinters
ParentRecipe: com.github.eth-its-recipes.download.ETHPrinters
MinimumVersion: "2.3"

Input:
  NAME: ETH Printers
  EXCEPTION: ""
  LIST_NAME: Printers
  LOCAL_REPO: /Volumes/AutoPkg_Local_Sources
  VENDOR: ETH

Process:
  - Processor: Unarchiver
    Arguments:
      archive_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/unzip"
      purge_destination: true

  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/ETH_Printers-%version%.pkg"
      source_pkg: "%RECIPE_CACHE_DIR%/unzip/*.pkg"
