Description: Downloads the current HP printer drivers and creates an installer package.
Identifier: com.github.eth-its-recipes.pkg.ETHPrinterDrivers-HP
ParentRecipe: com.github.eth-its-recipes.download.ETHPrinterDrivers-HP
MinimumVersion: "2.3"

Input:
  DRIVER_TYPE: S

Process:
  - Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      flat_pkg_path: "%pathname%"
    Processor: FlatPkgUnpacker

  - Arguments:
      pkg_path: "%pathname%"
    Processor: com.github.eth-its-recipes.processors/DistributionPkgInfo

  - Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/HP-Drivers-%DRIVER_TYPE%-%version%.pkg"
      source_pkg: "%pathname%"
    Processor: PkgCopier
