Description: Downloads latest stable Fiji zip file and builds a package. The installer package includes a preinstall script that will check for an existing Fiji.app in /Applications and remove it if found.
Identifier: com.github.eth-its-recipes.pkg.Fiji
MinimumVersion: "2.3"
ParentRecipe: com.github.rtrouton.download.Fiji

Input:
  NAME: Fiji

Process:
  - Arguments:
      pkgdirs:
        Applications: "0775"
        Library: "0775"
        "Library/Application Support": "0775"
        "Library/Application Support/Fiji": "0775"
      pkgroot: "%RECIPE_CACHE_DIR%/%NAME%"
    Processor: PkgRootCreator

  - Arguments:
      archive_path: "%pathname%"
      destination_path: "%pkgroot%/Applications"
      purge_destination: true
    Processor: Unarchiver

  - Arguments:
      input_plist_path: "%pkgroot%/Applications/Fiji.app/Contents/Info.plist"
      output_plist_path: "%pkgroot%/Library/Application Support/Fiji/AdaptedInfo.plist"
      plist_data:
        CFBundleVersion: "%version%"
        CFBundleShortVersionString: "%version%"
    Processor: PlistEditor

  - Arguments:
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
        id: org.fiji
        options: purge_ds_store
        pkgname: "%NAME%-%version%"
        version: "%version%"
    Processor: PkgCreator

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/%NAME%"
