Description: Downloads the latest version of FreeFileSync and creates a package.
Identifier: com.github.eth-its-recipes.pkg.FreeFileSync
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.download.FreeFileSync

Input:
  NAME: FreeFileSync

Process:
  - Arguments:
      pkg_path: "%pathname%/%NAME%_%version%.pkg"
      source_pkg: "%RECIPE_CACHE_DIR%/%NAME%/%NAME%_%version%.pkg"
    Processor: PkgCopier


  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/%NAME%"