Description: Downloads latest FreeFileSync installer and uses it to create a package.
Identifier: com.github.eth-its-recipes.pkg.FreeFileSync
MinimumVersion: 1.0.0
ParentRecipe: com.github.eth-its-recipes.download.FreeFileSync

Input:
  NAME: FreeFileSync
  LIST_NAME: FreeFileSync

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs: {}
      pkgroot: "%RECIPE_CACHE_DIR%/Scripts"

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs: {}
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"


  - Processor: FileCreator
    Arguments:
      file_path: "%RECIPE_CACHE_DIR%/Scripts/postinstall"
      file_mode: "0755"
      file_content: |
        #!/bin/bash

        DIR=$(dirname "$0")

        #install Package
        installer -pkg $DIR/FreeFileSync_13.5_[Business].pkg -target /
        exit 0

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown: []
        id: "ch.ethz.id.pkg.freefilesync%version%"
        pkgname: "%NAME%-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
        pkgtype: flat
        scripts: Scripts
        version: "%version%"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/Scripts"
        - "%RECIPE_CACHE_DIR%/pkgroot"
