Description: Downloads the current release version of IBM Storage Protect and extracts the installer package.
Identifier: com.github.eth-its-recipes.pkg.IBMStorageProtect
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.download.IBMStorageProtect

Input:
  NAME: IBM Storage Protect

Process:
  - Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/IBMStorageProtect-%version%.pkg"
      source_pkg: "%pathname%/IBM Storage Protect.pkg"
    Processor: PkgCopier
