Description: Downloads the latest version of ilastik and creates a package.
Identifier: com.github.eth-its-recipes.pkg.ilastik
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.download.ilastik

Input:
  NAME: ilastik

Process:
  - Arguments:
      pkgdirs:
        Applications: "0775"
      pkgroot: "%RECIPE_CACHE_DIR%/%NAME%"
    Processor: PkgRootCreator

  - Arguments:
      archive_path: "%pathname%"
      destination_path: "%pkgroot%/Applications"
      purge_destination: true
    Processor: Unarchiver

  - Processor: AppPkgCreator
    Arguments:
      app_path: "%RECIPE_CACHE_DIR%/%NAME%

