Description: |
  Downloads the latest version of ImageStudio and creates a package.
Identifier: com.github.eth-its-recipes.pkg.ImageStudio
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.download.ImageStudio

Input: {}

Process:
  - Arguments:
      pkgdirs: {}
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
    Processor: PkgRootCreator

  - Processor: Copier
    Arguments:
     destination_path: "%RECIPE_CACHE_DIR%/pkgroot/Applications/ImageStudio.app"
     source_path: "%pathname%/ImageStudio.app"

  - Arguments:
      pkg_request:
        chown: []
        id: ch.ethz.id.pkg.ImageStudio
        pkgname: "ImageStudio-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
        pkgtype: flat
        version: "%version%"
    Processor: PkgCreator

  - Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/pkgroot"
    Processor: PathDeleter
