Description: |
  Creates a package from a pre-downloaded JMP installer which has already been installed on a client, and the SIP file converted to a JMP.per file as per the instructions in the JMP Deployment Guide.
Identifier: com.github.eth-its-recipes.pkg.JMP
ParentRecipe: com.github.eth-its-recipes.download.internal-sources
MinimumVersion: "2.3"

Input:
  NAME: JMP
  LIST_LANGUAGE: ML
  LIST_NAME: JMP
  MAJOR_VERSION: "14"

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs: {}
      pkgroot: "%RECIPE_CACHE_DIR%/Scripts"

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs: {}
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs: {}
      pkgroot: "%RECIPE_CACHE_DIR%/unpack"

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs: {}
      pkgroot: "%RECIPE_CACHE_DIR%/app_unpack"

  - Processor: Copier
    Arguments:
      source_path: "%pathname%/JMP/JMP/%MAJOR_VERSION%*/Macintosh/JMP-Install.dmg"
      destination_path: "%RECIPE_CACHE_DIR%/downloads/JMP-Install.dmg"
      overwrite: True

  - Processor: Copier
    Arguments:
      source_path: "%RECIPE_CACHE_DIR%/downloads/JMP-Install.dmg/JMP %MAJOR_VERSION%.pkg"
      destination_path: "%RECIPE_CACHE_DIR%/Scripts/JMP %MAJOR_VERSION%.pkg"
      overwrite: True

  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: "%RECIPE_CACHE_DIR%/Scripts/JMP %MAJOR_VERSION%.pkg"
      destination_path: "%RECIPE_CACHE_DIR%/unpack"

  - Processor: PkgExtractor
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/unpack/JMP_%MAJOR_VERSION%_Application.pkg"
      extract_root: "%RECIPE_CACHE_DIR%/app_unpack"

  - Processor: Versioner
    Arguments:
      input_plist_path: "%RECIPE_CACHE_DIR%/app_unpack/Applications/JMP %MAJOR_VERSION%.app/Contents/Info.plist"

  - Processor: Copier
    Arguments:
      source_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/Scripts/JMP_%MAJOR_VERSION%.dmg"
      overwrite: True

  - Processor: FileCreator
    Arguments:
      file_content: |
        #!/bin/bash
        DIR=$(dirname "$0")

        # install JMP with ETH License
        installer -target / -pkg "$DIR/JMP %MAJOR_VERSION%.pkg"

        # relocate license
        if [[ -f "$HOME/Library/Application Support/JMP/%MAJOR_VERSION%/JMP.per" ]]; then
            /bin/mv "$HOME/Library/Application Support/JMP/%MAJOR_VERSION%/JMP.per" \
            "/Library/Application Support/JMP/%MAJOR_VERSION%/JMP.per"
        elif [[ -f "/var/root/Library/Application Support/JMP/%MAJOR_VERSION%/JMP.per" ]]; then
            /bin/mkdir -p "/Library/Application Support/JMP/%MAJOR_VERSION%"
            /bin/mv "/var/root/Library/Application Support/JMP/%MAJOR_VERSION%/JMP.per" \
            "/Library/Application Support/JMP/%MAJOR_VERSION%/JMP.per"
            # change permissions
            /bin/chmod 644 "/Library/Application Support/JMP/%MAJOR_VERSION%/JMP.per"
        else
            echo "ERROR: JMP.per not found"
            exit 1
        fi
        if [[ -f "/Library/Application Support/JMP/%MAJOR_VERSION%/JMP.per" ]]; then
            # define license location
            /usr/bin/defaults write "/Library/Preferences/com.sas.jmp.plist" Setinit_%MAJOR_VERSION%_Path "/Library/Application Support/JMP/%MAJOR_VERSION%/JMP.per"
        else
            echo "ERROR: JMP.per not found in Library folder"
            exit 1
        fi
      file_mode: "0755"
      file_path: "%RECIPE_CACHE_DIR%/Scripts/postinstall"

  - Processor: PkgCreator
    Arguments:
      force_pkg_build: True
      pkg_request:
        chown: []
        id: ch.ethz.id.pkg.JMP
        pkgname: "JMP-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
        pkgtype: flat
        scripts: Scripts
        version: "%version%"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/unpack"
        - "%RECIPE_CACHE_DIR%/Scripts"
        - "%RECIPE_CACHE_DIR%/pkgroot"
        - "%RECIPE_CACHE_DIR%/downloads/JMP-Install.dmg"
