Description: Downloads and package the latest LibreOffice with an additional language pack. Set RELEASE to either "fresh" or "still"
Identifier: com.github.eth-its-recipes.pkg.LibreOfficeWithLanguagePack
MinimumVersion: "2.3"
ParentRecipe: io.github.hjuutilainen.download.LibreOffice

Input:
  LANGUAGE_CODE: de
  NAME: LibreOffice
  RELEASE: still
  TYPE: mac-x86_64

Process:
  - Arguments:
      input_var: "%pathname%"
      rename_var: pathname_app
    Processor: com.github.sebtomasi.SharedProcessors/RenameVar

  - Arguments:
      input_string: "%url%"
      pattern_replace:
        - pattern: .dmg
          repl: _langpack_%LANGUAGE_CODE%.dmg
    Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer

  - Arguments:
      filename: "%NAME%_langpack_%LANGUAGE_CODE%.dmg"
      url: "%parsed_string%"
    Processor: URLDownloader

  - Arguments:
      dmg_path: "%pathname_app%"
    Processor: AppDmgVersioner

  - Arguments:
      pkgdirs:
        Applications: "0775"
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
    Processor: PkgRootCreator

  - Arguments:
      source_path: "%pathname_app%/LibreOffice.app"
      destination_path: "%RECIPE_CACHE_DIR%/pkgroot/Applications/LibreOffice.app"
    Processor: Copier

  - Arguments:
      source_path: "%pathname%/LibreOffice Language Pack.app/Contents/Resources/tarball.tar.bz2"
      destination_path: "%RECIPE_CACHE_DIR%"
    Processor: Copier

  - Arguments:
      archive_path: "%RECIPE_CACHE_DIR%/tarball.tar.bz2"
      destination_path: "%RECIPE_CACHE_DIR%/pkgroot/Applications/LibreOffice.app"
    Processor: Unarchiver

  - Arguments:
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
        id: org.libreoffice.langpack-%LANGUAGE_CODE%
        options: purge_ds_store
        pkgdir: "%RECIPE_CACHE_DIR%"
      pkgname: "LibreOffice_%LANGUAGE_CODE%-%version%"
    Processor: PkgCreator

  - Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/pkgroot"
        - "%RECIPE_CACHE_DIR%/tarball.tar.bz2"
    Processor: PathDeleter
