Description: Downloads the current release version of polybox and extracts the installer package.
Identifier: com.github.eth-its-recipes.pkg.MacEvaluationUtility
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.download.MacEvaluationUtility

Input:
  NAME: Mac Evaluation Utility

Process:
  - Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/MacEvaluationUtility-%version%.pkg"
      source_pkg: "%pathname%/Mac Evaluation Utility*.pkg"
    Processor: PkgCopier
