Description: Downloads the current release version of MailToOutlook and extracts the installer package.
Identifier: com.github.eth-its-recipes.pkg.MailToOutlook
MinimumVersion: 0.4.0
ParentRecipe: com.github.eth-its-recipes.download.MailToOutlook

Input: {}

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/unpack"

  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: "%RECIPE_CACHE_DIR%/unpack/MailToOutlook.pkg/Payload"
      destination_path: "%RECIPE_CACHE_DIR%/payload"

  - Processor: PkgCopier
    Arguments:
      source_pkg: "%pathname%"
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%.pkg"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/unpack"
        - "%RECIPE_CACHE_DIR%/payload"