Description: Downloads the current version of Mail To Outlook package.
Identifier: com.github.eth-its-recipes.pkg.MailToOutlook
ParentRecipe: com.github.eth-its-recipes.download.MailToOutlook
MinimumVersion: "2.3"

Input:
  NAME: Microsoft Office Factory Reset

Process:
  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/MailToOutlook-%version%.pkg"
      source_pkg: "%pathname%"