Description: Downloads the current release version of MailToOutlook and extracts the installer package.
Identifier: com.github.eth-its-recipes.pkg.MailToOutlook
MinimumVersion: 0.4.0
ParentRecipe: com.github.eth-its-recipes.download.MailToOutlook

Input: {}

Process:
  - Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      flat_pkg_path: "%pathname%"
    Processor: FlatPkgUnpacker

  - Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/payload"
      pkg_payload_path: "%RECIPE_CACHE_DIR%/unpack/MailToOutlook.pkg/Payload"
    Processor: PkgPayloadUnpacker


  - Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%download_url%"
      source_pkg: "%pathname%"
    Processor: PkgCopier

  - Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/unpack"
        - "%RECIPE_CACHE_DIR%/payload"
    Processor: PathDeleter
