Description: Downloads the latest version of Mathematica and creates a package.
Identifier: com.github.eth-its-recipes.pkg.Mathematica
MinimumVersion: 1.0.0
ParentRecipe: com.github.eth-its-recipes.download.internal-sources

Input:
  LIST_LANGUAGE: EN
  LIST_NAME: Mathematica Node
  NAME: Mathematica
  MAJOR_VERSION: 13

  Process:
  - Processor: PkgCreator
    Arguments:
      pkgname: "Mathematica.pkg"
      postinstall_script: |
        #!/bin/bash
        mv "/Applications/{{ NAME }}.app" "/Applications/{{ NAME }} {{ MAJOR_VERSION }}.app"