Description: Downloads the latest version of Mathematica and creates a package.
Identifier: com.github.eth-its-recipes.pkg.Mathematica
MinimumVersion: 1.0.0
ParentRecipe: com.github.eth-its-recipes.download.internal-sources

Input:
  LIST_LANGUAGE: EN
  LIST_NAME: Mathematica Node
  NAME: Mathematica
  MAJOR_VERSION: 13

Process:
  - Processor: DmgMounter
    Arguments:
      dmg_path: "%pathname%"

  - Processor: FileFinder
    Arguments:
      pattern: "*.app"
      found_filename: app_path

  - Processor: FileMover
    Arguments:
      source_path: "%app_path%"
      destination_path: "%RECIPE_CACHE_DIR%/Mathematica %MAJOR_VERSION%.app"

  - Processor: PkgCreator
    Arguments:
      pkgroot: "%RECIPE_CACHE_DIR%/Mathematica %MAJOR_VERSION%.app"
      pkgname: "Mathematica %MAJOR_VERSION%"
      version: "%MAJOR_VERSION%"
