Description: Downloads the latest version of Mathematica and creates a package.
Identifier: com.github.eth-its-recipes.pkg.Mathematica
MinimumVersion: 1.0.0
ParentRecipe: com.github.eth-its-recipes.download.internal-sources

Input:
  LIST_LANGUAGE: EN
  LIST_NAME: Mathematica Node
  NAME: Mathematica

Process:
  - Arguments:
      overwrite: false
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
    Processor: AppPkgCreator
