Description: Downloads the latest version of Mathematica and creates a package.
Identifier: com.github.eth-its-recipes.pkg.Mathematica
MinimumVersion: 1.0.0
ParentRecipe: com.github.eth-its-recipes.download.internal-sources

Input:
  LIST_LANGUAGE: EN
  LIST_NAME: Mathematica Node
  NAME: Mathematica
  MAJOR_VERSION: 13


Process:
  - Processor: PkgCreator
    Arguments:
      pkgname: "%NAME% %MAJOR_VERSION%.pkg"
      pkgroot: "/Applications"
      payload: 
        - path: "/Applications/%NAME% %MAJOR_VERSION%.app"
          type: dir
      postinstall_script: |
        #!/bin/bash
        APP_NAME="%NAME%"
        APP_PATH="/Applications/$APP_NAME.app"
        NEW_APP_NAME="$APP_NAME $MAJOR_VERSION"
        NEW_APP_PATH="/Applications/$NEW_APP_NAME.app"
        if [ -d "$APP_PATH" ]; then
            mv "$APP_PATH" "$NEW_APP_PATH"
        else
            echo "The application $APP_NAME was not found!"
            exit 1
        fi
        exit 0