Description: Downloads latest COMSOL Multiphysics installer and uses it to create a package.
Identifier: com.github.eth-its-recipes.pkg.MicrosoftCompanyPortal
MinimumVersion: 1.0.0
ParentRecipe: com.github.jlehikoinen.download.CompanyPortal

Input:
  NAME: MicrosoftCompanyPortal

Process:

  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: $pathname
      destination_path: "%RECIPE_CACHE_DIR%/pkg_unpack"
      purge_destination: false

  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: "%RECIPE_CACHE_DIR%/pkg_unpack/CompanyPortal-Component.pkg/Payload"
      destination_path: "%RECIPE_CACHE_DIR%"
      purge_destination: false

  - Processor: Versioner
    Arguments:
      input_plist_path: "%RECIPE_CACHE_DIR%/Applications/Company Portal.app/Contents/Info.plist"
      plist_version_key: CFBundleShortVersionString

  - Processor: FileMover
    Arguments:
      source: "%pathname%"
      target: "%RECIPE_CACHE_DIR%/MicrosoftCompanyPortal-%version%.pkg"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/pkg_unpack"
        - "%RECIPE_CACHE_DIR%/Applications/Company Portal.app"

