Description: Downloads the latest version of MOE and creates a package.
Identifier: com.github.eth-its-recipes.pkg.MOE
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.download.MOE

Input:
  LIST_EXCEPTION: ""
  LOCAL_REPO: /Volumes/AutoPkg_Local_Sources
  LIST_NAME: ChemComp_MOE
  VENDOR: Chemical_Computing_Group

Process:
  - Arguments:
      pkgdirs: {}
      pkgroot: "%RECIPE_CACHE_DIR%/Scripts"
    Processor: PkgRootCreator

  - Arguments:
      pkgdirs: {}
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
    Processor: PkgRootCreator

  - Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/Scripts/%latest_file%.dmg"
      source_path: "%RECIPE_CACHE_DIR%/downloads/%latest_file%.dmg"
    Processor: Copier

  - Arguments:
      file_content: |
        #!/bin/bash
        ## script to install MOE

        DIR=$(dirname "$0")

        # remove quarantine flag from moe dmg
        xattr -d com.apple.quarantine "$DIR/%latest_file%.dmg"

        # attach dmg image
        APPPATH="/Volumes/MOE_installer"
        mkdir -p $APPPATH
        echo "Mounting to $APPPATH"
        hdiutil attach $DIR/%latest_file%.dmg -nobrowse -mountpoint $APPPATH

        folder_path=$(find $APPPATH -name "moe*" -maxdepth 1)
        folder_name="moe_%MAJOR_VERSION%"
        echo "Copying $folder_path to /Applications/$folder_name"
        cp -r "$folder_path" "/Applications/$folder_name"

        # detach dmg image
        hdiutil eject $APPPATH

        # set up moe.app to point to the correct binary
        # (this section adapted from /Applications/$folder_name/bin/configure_macos)
        echo "Running configure_macos script"
        /Applications/$folder_name/bin/configure_macos
      file_mode: "0755"
      file_path: "%RECIPE_CACHE_DIR%/Scripts/postinstall"
    Processor: FileCreator

  - Arguments:
      force_pkg_build: true
      pkg_request:
        chown: []
        id: ch.ethz.id.pkg.ChemCompMOE%version%
        pkgname: "%NAME%-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
        pkgtype: flat
        scripts: Scripts
        version: "%version%"
    Processor: PkgCreator

  - Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/pkgroot"
        - "%RECIPE_CACHE_DIR%/Scripts"
    Processor: PathDeleter
