Description: Downloads the latest version of NotepadPlusPlus from Github and creates a package.
Identifier: com.github.eth-its-recipes.pkg.NotepadPlusPlus
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.download.NotepadPlusPlus

Input:
  NAME: NotepadPlusPlus

Process:
  - Processor: AppPkgCreator
