Description: Downloads the latest version of Parallels Desktop and creates a package.
Identifier: com.github.eth-its-recipes.pkg.ParallelsDesktop
MinimumVersion: 0.6.1
ParentRecipe: com.github.eth-its-recipes.download.internal-sources

Input:
  LIST_LANGUAGE: ML
  LIST_NAME: Parallels Desktop for Mac
  NAME: Parallels Desktop
  LIST_MAJOR_VERSION: "16"

Process:
  - Arguments:
      filename: pd-autodeploy.zip
      url: http://download.parallels.com/desktop/tools/pd-autodeploy.zip
    Processor: URLDownloader

  - Arguments:
      archive_path: "%RECIPE_CACHE_DIR%/downloads/pd-autodeploy.zip"
      destination_path: "%RECIPE_CACHE_DIR%/unzip"
      purge_destination: true
    Processor: Unarchiver

  - Arguments:
      pattern: "%RECIPE_CACHE_DIR%/unzip/Parallels Desktop Business Edition mass deployment package*"
    Processor: FileFinder

  - Arguments:
      input_plist_path: "%found_filename%/Parallels Desktop Autodeploy.pkg/Contents/Info.plist"
      plist_version_key: CFBundleGetInfoString
    Processor: Versioner

  - Processor: com.github.homebysix.VersionSplitter/VersionSplitter
    Arguments:
      split_on: ","

  - Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/Parallels_Desktop.pkg"
      overwrite: true
      source_path: "%found_filename%/Parallels Desktop Autodeploy.pkg"
    Processor: Copier

  - Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/Parallels_Desktop.pkg/Parallels Desktop DMG/Parallels Desktop.dmg"
      overwrite: true
      source_path: "%RECIPE_CACHE_DIR%/downloads/%latest_file%"
    Processor: Copier

  - Arguments:
      CONFIG_FILE_PATH: "%RECIPE_CACHE_DIR%/Parallels_Desktop.pkg/License Key and Configuration/deploy.cfg"
      INFO_PLIST_PATH: "%RECIPE_CACHE_DIR%/Parallels_Desktop.pkg/Contents/Info.plist"
      version: "%version%"
    Processor: com.github.eth-its-recipes.processors/ParallelsDesktopPackager

  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/ParellelsDesktop-%version%.pkg"
      source_pkg: "%RECIPE_CACHE_DIR%/Parallels_Desktop.pkg"

  - Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/unzip"
        - "%RECIPE_CACHE_DIR%/Parallels_Desktop.pkg"
    Processor: PathDeleter
