Description: Downloads the latest version of PopChar and creates a package.
Identifier: com.github.eth-its-recipes.pkg.PopChar
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.download.internal-sources

Input:
  LIST_LANGUAGE: ML
  LIST_NAME: PopChar X
  NAME: PopChar

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: "0775"
        Applications/PopChar: "0775"
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"

  - Processor: Copier
    Arguments:
      destination_path: "%pkgroot%/Applications/PopChar/PopChar.app"
      source_path: "%pathname%/PopChar.app"

  - Processor: PlistReader
    Arguments:
      info_path: "%pkgroot%/Applications/PopChar/PopChar.app/Contents/Info.plist"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown: []
        id: com.macility.popchar3
        pkgname: "PopChar-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
        pkgtype: flat
        version: "%version%"
