Description: Downloads the latest version of Prism and creates a package.
Identifier: com.github.eth-its-recipes.pkg.Prism
MinimumVersion: 1.0.0
ParentRecipe: com.github.rtrouton.download.Prism

Input:
  NAME: Prism

Process:
  - Processor: Copier
    Arguments:
      source_path: "%pathname%/Prism*.app"
      destination_path: "%RECIPE_CACHE_DIR%/Prism.app"

  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: "%pathname%"

  - Processor: AppPkgCreator
    Arguments:
      app_path: "%RECIPE_CACHE_DIR%/Prism.app"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/Prism.app"
