Description: Downloads latest ChimeraX installer and uses it to create a package.
Identifier: com.github.eth-its-recipes.pkg.PyCharm
MinimumVersion: "2.3"
ParentRecipe: com.github.bnpl.autopkg.download.pycharm

Input:
  NAME: PyCharm
  ARCH_TYPE: macM1

Process:
  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: "%pathname%"

  - Processor: AppPkgCreator
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%app_name%-%PLATFORM%-%version%.pkg"