Description: Downloads the latest PyMOL license file and creates a package.
Identifier: com.github.eth-its-recipes.pkg.PyMOLLicense
ParentRecipe: com.github.eth-its-recipes.download.PyMOLLicense
MinimumVersion: "2.3"

Input:
  NAME: PyMOL License
  EXCEPTION: ""
  LOCAL_REPO: /Volumes/AutoPkg_Local_Sources
  LIST_NAME: PyMOL_License
  VENDOR: ETH

Process:
  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/PyMOL_License-%version%.pkg"
      source_pkg: "%pathname%"
