Comment: |
  This recipe obtains the installer from an internal source. This could be provided manaully using the --PKG argument. 

  Requires inputs for MAJOR_VERSION and LIST_MAJOR_VERSION.
Description: Downloads the latest version of SPSSStatistics and creates a package.
Identifier: com.github.eth-its-recipes.pkg.SPSSStatistics
ParentRecipe: com.github.eth-its-recipes.download.internal-sources
MinimumVersion: "2.3"

Input:
  NAME: SPSSStatistics
  LIST_LANGUAGE: ML
  LIST_NAME: IBM SPSS

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/Unpacked"
      flat_pkg_path: "%pathname%"
      purge_destination: true

  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/Payload"
      pkg_payload_path: "%RECIPE_CACHE_DIR%/Unpacked/SPSSStatistics.pkg/Payload"
      purge_destination: true

  - Processor: Versioner
    Arguments:
      input_plist_path: "%RECIPE_CACHE_DIR%/Payload/IBM SPSS Statistics %MAJOR_VERSION%/SPSS Statistics.app/Contents/Info.plist"
      plist_version_key: CFBundleShortVersionString

  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/SPSSStatistics-%version%.pkg"
      source_pkg: "%pathname%"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/Unpacked"
        - "%RECIPE_CACHE_DIR%/Payload"
