Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.pkg.SupportAppCustomisation
MinimumVersion: "2.3"

Input:
  NAME: Support App Customisation
  CUSTOM_ICON_URL: https://github.com/eth-its/autopkg-mac-recipes-yaml/raw/main/Self_Service_Icons/ETH.png
  CUSTOM_ICON_URL2: https://github.com/eth-its/autopkg-mac-recipes-yaml/raw/main/Self_Service_Icons/eth-dome-black.png
  CUSTOM_ICON_URL3: https://github.com/eth-its/autopkg-mac-recipes-yaml/raw/main/Self_Service_Icons/eth-dome-white.png
  version: "2.0"

Process:
  - Processor: PkgRootCreator
    Comment: Set the main pkg_path variable to main_pkg_path so that we can use it later
    Arguments:
      pkgdirs:
        Library: "0775"
        Library/Management: "0775"
        Library/Management/ETHZ: "0775"
        Library/Management/ETHZ/SupportApp: "0775"
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"

  - Processor: URLDownloader
    Arguments:
      url: "%CUSTOM_ICON_URL%"
      download_dir: "%RECIPE_CACHE_DIR%/pkgroot/Library/Management/ETHZ/SupportApp"

  - Processor: URLDownloader
    Arguments:
      url: "%CUSTOM_ICON_URL2%"
      download_dir: "%RECIPE_CACHE_DIR%/pkgroot/Library/Management/ETHZ/SupportApp"

  - Processor: URLDownloader
    Arguments:
      url: "%CUSTOM_ICON_URL3%"
      download_dir: "%RECIPE_CACHE_DIR%/pkgroot/Library/Management/ETHZ/SupportApp"

  - Processor: PkgCreator
    force_pkg_build: True
    Arguments:
      pkg_request:
        chown: []
        id: ch.ethz.id.SupportAppCustomisation.pkg
        pkgname: "ETHZ-SupportAppCustomisation-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
        pkgtype: flat
        version: "%version%"
