Description: Placeholder pkg recipe - just moves the pkg to create the pkg_path variable.
Identifier: com.github.eth-its-recipes.pkg.swiftDialog
ParentRecipe: com.github.andredb90.download.swiftDialog
MinimumVersion: "2.3"

Input:
  NAME: swiftDialog

Process:
  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/swiftDialog-%version%.pkg"
      source_pkg: "%pathname%"