Description: Uses io.github.hjuutilainen.download.TeamViewer recipe to download latest TeamViewer
Identifier: com.github.eth-its-recipes.pkg.TeamViewer
ParentRecipe: io.github.hjuutilainen.download.TeamViewer
MinimumVersion: "2.3"

Input:
  NAME: TeamViewer

Process:
  - Processor: FlatPkgUnpacker
    Comment: TeamViewerApp.pkg needs to be unpacked from within 'Install TeamViewer.pkg' to get the version
    Arguments:
      flat_pkg_path: "%pathname%/Install TeamViewer.app/Contents/Resources/Install TeamViewer.pkg"
      destination_path: "%RECIPE_CACHE_DIR%/unpack"

  - Processor: com.github.eth-its-recipes.processors/PkgPayloadUnpacker2
    Arguments:
      pkg_payload_path: "%RECIPE_CACHE_DIR%/unpack/TeamViewerApp.pkg/Payload"
      destination_path: "%RECIPE_CACHE_DIR%/payload"

  - Processor: Versioner
    Arguments:
      input_plist_path: "%RECIPE_CACHE_DIR%/payload/TeamViewer.app/Contents/Info.plist"
      plist_version_key: CFBundleShortVersionString

  - Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/switchdrive-%version%.pkg"
      source_pkg: "%pathname%"
    Processor: PkgCopier

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/unpack"
        - "%RECIPE_CACHE_DIR%/payload"
