Description: |
  Downloads the Intel version of Texmaker and creates a package.
Identifier: com.github.eth-its-recipes.pkg.Texmaker5
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.download.Texmaker5

Input: {}

Process:
  - Arguments:
      pkgdirs: {}
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
    Processor: PkgRootCreator

  - Processor: Copier
    Arguments:
     destination_path: "%RECIPE_CACHE_DIR%/pkgroot/Applications/texmaker.app"
     source_path: "%pathname%/texmaker.app"

  - Arguments:
      pkg_request:
        chown: []
        id: ch.ethz.id.pkg.texmaker5
        pkgname: "texmaker-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
        pkgtype: flat
        version: "%version%"
    Processor: PkgCreator

  - Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/pkgroot"
    Processor: PathDeleter
