Description: Downloads the latest version of Prism and creates a package.
Identifier: com.github.eth-its-recipes.pkg.VisualStudioCode
MinimumVersion: 1.0.0
ParentRecipe: com.github.jc0b.download.VisualStudioCode

Input:
  NAME: "Visual Studio Code"
  ARCH: "universal"

Process:
  - Processor: Copier
    Arguments:
      source_path: "%RECIPE_CACHE_DIR%/downloads/%NAME%-%ARCH%.dmg/%NAME%.app"
      destination_path: "%RECIPE_CACHE_DIR%/%NAME%.app"

  - Processor: Versioner
    Arguments:
      input_plist_path: "%RECIPE_CACHE_DIR%/%NAME%.app/Contents/Info.plist"
      plist_version_key: CFBundleShortVersionString

  - Processor: AppPkgCreator
    Arguments:
      app_path: "%RECIPE_CACHE_DIR%/%NAME%.app"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/%NAME%.app"
