Description: Downloads the latest version of Wireshark and creates a package.
Identifier: com.github.eth-its-recipes.pkg.Wireshark
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.download.Wireshark

Input:
  NAME: Wireshark

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: '0775'
      pkgroot: '%RECIPE_CACHE_DIR%/payload'

  - Processor: Copier
    Arguments:
      source_path: '%pathname%/Wireshark.app'
      destination_path: '%pkgroot%/Applications/Wireshark.app'

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Profiles: "0755"
        Profiles/vpn: "0755"
      pkgroot: "%RECIPE_CACHE_DIR%/scripts"

  - Processor: FileCreator
    Arguments:
      file_content: |
        #!/bin/bash

        /bin/echo "Installing Wireshark components..."
        extras="/Applications/Wireshark.app/Contents/Resources/Extras"
        packages=(
            "Install ChmodBPF.pkg"
            "Add Wireshark to the system path.pkg"
        )

        for package in "${packages[@]}"; do
            echo "Installing: $extras/$package"
            installer -pkg "$extras/$package" -target /
        done

        exit 0
      file_mode: "0755"
      file_path: "%RECIPE_CACHE_DIR%/scripts/postinstall"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
        id: '%bundleid%'
        pkgdir: '%RECIPE_CACHE_DIR%'
        pkgname: '%NAME%-%version%'
        scripts: scripts

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/payload'
        - '%RECIPE_CACHE_DIR%/scripts'