Description: |
  Creates a Once per week policy to update any Adobe CC SDL apps by running Adobe RUM.

  Requires the 8 "Adobe XYZ installed" groups and "Adobe Creative Cloud auto-update" to already exist.
Identifier: com.github.eth-its-recipes.jamf.script.AdobeRUM
MinimumVersion: "2.3"

Input:
  NAME: Adobe Remote Update Manager
  POLICY_CATEGORY: Administration
  POLICY_TEMPLATE: Policy-prod-script-AdobeRUM.xml
  POLICY_NAME: "%NAME%"
  SCRIPT_NAME: AdobeRUM.sh
  SCRIPT_PRIORITY: After

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "%POLICY_CATEGORY%"
      script_path: "%SCRIPT_NAME%"
      script_priority: "%SCRIPT_PRIORITY%"
      replace_script: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      replace_policy: "True"
