Comments: |
  Requires the following keys to be overridden:
  - AFFINITY_DESIGNER_PRODUCT_KEY
  - AFFINITY_PUBLISHER_PRODUCT_KEY
  - AFFINITY_PHOTO_PRODUCT_KEY
  - AFFINITY_LICENSE_ACCOUNT
  - AFFINITY_LICENSE_SIGNATURE
  - AFFINITY_LICENSE_USER_COUNT

Description: Creates a trigger-only policy to install the Affinity license by running the postinstall script.
Identifier: com.github.eth-its-recipes.jamf.script.AffinityLicense
MinimumVersion: "2.3"

Input:
  NAME: Affinity License
  SCRIPT_CATEGORY: Creativity
  TRIGGER_POLICY_CATEGORY: Triggered Installers
  TRIGGER_POLICY_TEMPLATE: Policy-script-triggeronly-parameters-nonotification.xml
  TRIGGER_POLICY_NAME: "%NAME%"
  TRIGGER_NAME: Run-AffinityLicense
  SCRIPT_NAME: AffinityLicense-install.zsh
  SCRIPT_PRIORITY: After
  TRIGGER_POLICY_RUN_COMMAND: "echo 'Installation of %NAME% complete'"
  PARAMETER4_LABEL: Designer product key
  PARAMETER5_LABEL: Publisher product key
  PARAMETER6_LABEL: Photo product key
  PARAMETER7_LABEL: Licensed account
  PARAMETER8_LABEL: Signature
  PARAMETER9_LABEL: User count
  PARAMETER10_LABEL: Parameter 10
  PARAMETER11_LABEL: Parameter 11
  PARAMETER4_VALUE: "%AFFINITY_DESIGNER_PRODUCT_KEY%"
  PARAMETER5_VALUE: "%AFFINITY_PUBLISHER_PRODUCT_KEY%"
  PARAMETER6_VALUE: "%AFFINITY_PHOTO_PRODUCT_KEY%"
  PARAMETER7_VALUE: "%AFFINITY_LICENSE_ACCOUNT%"
  PARAMETER8_VALUE: "%AFFINITY_LICENSE_SIGNATURE%"
  PARAMETER9_VALUE: "%AFFINITY_LICENSE_USER_COUNT%"
  PARAMETER10_VALUE: "None"
  PARAMETER11_VALUE: "None"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%SCRIPT_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%TRIGGER_POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "%SCRIPT_CATEGORY%"
      script_path: "%SCRIPT_NAME%"
      script_priority: "%SCRIPT_PRIORITY%"
      script_parameter4: "%PARAMETER4_LABEL%"
      script_parameter5: "%PARAMETER5_LABEL%"
      script_parameter6: "%PARAMETER6_LABEL%"
      script_parameter7: "%PARAMETER7_LABEL%"
      script_parameter8: "%PARAMETER8_LABEL%"
      script_parameter9: "%PARAMETER9_LABEL%"
      script_parameter10: "%PARAMETER10_LABEL%"
      script_parameter11: "%PARAMETER11_LABEL%"
      replace_script: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%TRIGGER_POLICY_TEMPLATE%"
      policy_name: "%TRIGGER_POLICY_NAME%"
