Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.CreateNewUser-script
MinimumVersion: "2.3"

Input:
  NAME: Create New User
  USERS_GROUP_NAME: "%NAME% users"
  USERS_GROUP_TEMPLATE: SmartGroup-script-selfservice.xml
  TESTING_GROUP_NAME: Testing
  POLICY_CATEGORY: Tools & Accessories
  POLICY_TEMPLATE: Policy-prod-selfservice-install.xml
  POLICY_NAME: "%NAME%"
  SCRIPT_NAME: CreateNewUser.sh
  SCRIPT_PRIORITY: After
  SELFSERVICE_DISPLAY_NAME: Create New User
  SELFSERVICE_DESCRIPTION: Creates a new user using on-screen dialogues windows. Your administrator may have preset some of the settings.
  SELFSERVICE_ICON: System Preferences.png
  INSTALL_BUTTON_TEXT: Create User
  REINSTALL_BUTTON_TEXT: Create User
  FORCE_DESCRIPTION: "true"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "%POLICY_CATEGORY%"
      script_path: "%SCRIPT_NAME%"
      script_priority: "%SCRIPT_PRIORITY%"
      replace_script: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%USERS_GROUP_TEMPLATE%"
      computergroup_name: "%USERS_GROUP_NAME%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      icon: "%SELFSERVICE_ICON%"
      replace_policy: "True"
