Description: Creates a trigger-only policy to disable Electron updates by running the postinstall script.
Identifier: com.github.eth-its-recipes.jamf.script.DisableElectronAppUpdates
MinimumVersion: "2.3"

Input:
  NAME: Disable Electron App Update Notifications
  SCRIPT_CATEGORY: Tools & Accessories
  TRIGGER_POLICY_CATEGORY: Triggered Installers
  TRIGGER_POLICY_TEMPLATE: Policy-script-triggeronly-nonotification.xml
  TRIGGER_POLICY_NAME: "%NAME%"
  TRIGGER_NAME: DisableElectronAppUpdates
  SCRIPT_NAME: DisableElectronAppUpdates.sh
  SCRIPT_PRIORITY: After
  TRIGGER_POLICY_RUN_COMMAND: "echo 'Installation of %NAME% complete'"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%SCRIPT_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%TRIGGER_POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "%SCRIPT_CATEGORY%"
      script_path: "%SCRIPT_NAME%"
      script_priority: "%SCRIPT_PRIORITY%"
      script_parameter4: "%PARAMETER4_LABEL%"
      replace_script: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%TRIGGER_POLICY_TEMPLATE%"
      policy_name: "%TRIGGER_POLICY_NAME%"
