Description: This just uploads an EA to Jamf.
Identifier: com.github.eth-its-recipes.jamf.script.JamfProtectStatus-EA
MinimumVersion: "2.3"

Input:
  EXTENSION_ATTRIBUTE_URL: https://raw.githubusercontent.com/jamf/jamfprotect/main/jamf_pro_extension_attributes/jamf_protect_application_status.sh
  EXTENSION_ATTRIBUTE_NAME: Jamf Protect Status
  EXTENSION_ATTRIBUTE_SCRIPT: JamfProtectStatus-EA.sh

Process:
  - Processor: URLDownloader
    Arguments:
      url: "%EXTENSION_ATTRIBUTE_URL%"
      filename: "%EXTENSION_ATTRIBUTE_SCRIPT%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfExtensionAttributeUploader
    Arguments:
      ea_script_path: "%pathname%"
      ea_name: "%EXTENSION_ATTRIBUTE_NAME%"
      replace_ea: "True"
