Description: This just uploads an EA to Jamf.
Identifier: com.github.eth-its-recipes.jamf.script.ModelName-EA
MinimumVersion: "2.3"

Input:
  EXTENSION_ATTRIBUTE_NAME: Model Name
  EXTENSION_ATTRIBUTE_SCRIPT: ModelName-EA.zsh
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: is
  EXTENSION_ATTRIBUTE_VALUE: None

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfExtensionAttributeUploader
    Arguments:
      ea_script_path: "%EXTENSION_ATTRIBUTE_SCRIPT%"
      ea_name: "%EXTENSION_ATTRIBUTE_NAME%"
      replace_ea: "True"
