Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.grahampugh.recipes.jamf.EnableLocationServices-script
MinimumVersion: "2.3"

Input:
  NAME: Enable Location Services
  GROUP_NAME: "%NAME% users"
  GROUP_TEMPLATE: SmartGroup-script-selfservice.xml
  TESTING_GROUP_NAME: Testing
  POLICY_CATEGORY: Tools & Accessories
  POLICY_TEMPLATE: Policy-script-selfservice.xml
  POLICY_NAME: "%NAME%"
  SCRIPT_NAME: EnableLocationServices.sh
  SCRIPT_PRIORITY: After
  SELFSERVICE_DISPLAY_NAME: Enable Location Services
  SELFSERVICE_DESCRIPTION: Enables Location Services so that the Time Zone adjusts correctly for location.
  SELFSERVICE_ICON: System Preferences.png
  INSTALL_BUTTON_TEXT: Enable
  REINSTALL_BUTTON_TEXT: Enable
  FORCE_DESCRIPTION: false

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "%POLICY_CATEGORY%"
      script_path: "%SCRIPT_NAME%"
      script_priority: "%SCRIPT_PRIORITY%"
      replace_script: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%GROUP_TEMPLATE%"
      computergroup_name: "%GROUP_NAME%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      icon: "%SELFSERVICE_ICON%"
      replace_policy: "True"
