Description: Creates a trigger-only policy.
Identifier: com.github.eth-its-recipes.jamf.script.FinderServerFavourites
MinimumVersion: "2.3"

Input:
  NAME: Manage Favourite Servers
  SCRIPT_CATEGORY: Tools & Accessories
  RECURRING_GROUP_NAME: "%NAME% users"
  RECURRING_GROUP_TEMPLATE: SmartGroup-script-selfservice.xml
  TESTING_GROUP_NAME: "Testing - %NAME%"
  TESTING_GROUP_TEMPLATE: StaticGroup-testing.xml
  RECURRING_POLICY_CATEGORY: Tools & Accessories
  RECURRING_POLICY_FREQUENCY: Once per computer
  RECURRING_POLICY_TEMPLATE: Policy-script-recurring-parameters.xml
  RECURRING_POLICY_NAME: Manage Favourite Servers
  SCRIPT_NAME: FinderServerFavourites.sh
  SCRIPT_PRIORITY: After
  PARAMETER4_LABEL: add / remove
  PARAMETER5_LABEL: Server 1
  PARAMETER6_LABEL: Server 2
  PARAMETER7_LABEL: Server 3
  PARAMETER8_LABEL: Server 4
  PARAMETER9_LABEL: Server 5
  PARAMETER10_LABEL: Server 6
  PARAMETER11_LABEL: Server 7
  PARAMETER4_VALUE: "add"
  PARAMETER5_VALUE: ""
  PARAMETER6_VALUE: ""
  PARAMETER7_VALUE: ""
  PARAMETER8_VALUE: ""
  PARAMETER9_VALUE: ""
  PARAMETER10_VALUE: ""
  PARAMETER11_VALUE: ""

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%SCRIPT_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%RECURRING_POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "%SCRIPT_CATEGORY%"
      script_path: "%SCRIPT_NAME%"
      script_priority: "%SCRIPT_PRIORITY%"
      script_parameter4: "%PARAMETER4_LABEL%"
      script_parameter5: "%PARAMETER5_LABEL%"
      script_parameter6: "%PARAMETER6_LABEL%"
      script_parameter7: "%PARAMETER7_LABEL%"
      script_parameter8: "%PARAMETER8_LABEL%"
      script_parameter9: "%PARAMETER9_LABEL%"
      script_parameter10: "%PARAMETER10_LABEL%"
      script_parameter11: "%PARAMETER11_LABEL%"
      replace_script: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%TESTING_GROUP_TEMPLATE%"
      computergroup_name: "%TESTING_GROUP_NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      USERS_GROUP_NAME: "%RECURRING_GROUP_NAME%"
      computergroup_template: "%RECURRING_GROUP_TEMPLATE%"
      computergroup_name: "%USERS_GROUP_NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%RECURRING_POLICY_TEMPLATE%"
      policy_name: "%RECURRING_POLICY_NAME%"
      replace_policy: "True"
