Description: Creates a trigger-only policy.
Identifier: com.github.eth-its-recipes.jamf.script.FinderServerFavourites
MinimumVersion: "2.3"

Input:
  NAME: FinderServerFavourites
  SCRIPT_CATEGORY: Administration
  TRIGGER_POLICY_CATEGORY: Triggered Installers
  TRIGGER_POLICY_TEMPLATE: Policy-script-triggeronly-parameters-nonotification.xml
  TRIGGER_POLICY_NAME: "Install %NAME%"
  TRIGGER_NAME: Run-FinderServerFavourites
  SCRIPT_NAME: FinderServerFavourites.sh
  SCRIPT_PRIORITY: After
  TRIGGER_POLICY_RUN_COMMAND: "echo 'Installation of %NAME% complete'"
  PARAMETER4_LABEL: add / remove
  PARAMETER5_LABEL: Server 1
  PARAMETER6_LABEL: Server 2
  PARAMETER7_LABEL: Server 3
  PARAMETER8_LABEL: Server 4
  PARAMETER9_LABEL: Server 5
  PARAMETER10_LABEL: Server 6
  PARAMETER11_LABEL: Server 7
  PARAMETER4_VALUE: "add"
  PARAMETER5_VALUE: ""
  PARAMETER6_VALUE: ""
  PARAMETER7_VALUE: ""
  PARAMETER8_VALUE: ""
  PARAMETER9_VALUE: ""
  PARAMETER10_VALUE: ""
  PARAMETER11_VALUE: ""

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%SCRIPT_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%TRIGGER_POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "%SCRIPT_CATEGORY%"
      script_path: "%SCRIPT_NAME%"
      script_priority: "%SCRIPT_PRIORITY%"
      script_parameter4: "%PARAMETER4_LABEL%"
      script_parameter5: "%PARAMETER5_LABEL%"
      script_parameter6: "%PARAMETER6_LABEL%"
      script_parameter7: "%PARAMETER7_LABEL%"
      script_parameter8: "%PARAMETER8_LABEL%"
      script_parameter9: "%PARAMETER9_LABEL%"
      script_parameter10: "%PARAMETER10_LABEL%"
      script_parameter11: "%PARAMETER11_LABEL%"
      replace_script: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%TRIGGER_POLICY_TEMPLATE%"
      policy_name: "%TRIGGER_POLICY_NAME%"
      replace_policy: "True"
