Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.grahampugh.recipes.jamf.Homebrew-script
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.download.Homebrew

Input:
  NAME: Install Homebrew
  TEST_USERS_GROUP_NAME: "%NAME% test users"
  TEST_USERS_GROUP_TEMPLATE: SmartGroup-test-users.xml
  TESTING_GROUP_NAME: Untested
  POLICY_CATEGORY: Development & Computing
  POLICY_TEMPLATE: Policy-untested-selfservice-script-only.xml
  POLICY_NAME: "%NAME%"
  SCRIPT_NAME: "%filename%"
  SCRIPT_PRIORITY: After
  SELFSERVICE_DISPLAY_NAME: Install Homebrew
  SELFSERVICE_DESCRIPTION: Install homebrew for the logged in user without requiring them to be an Administrator.
  SELFSERVICE_ICON: Homebrew.png
  INSTALL_BUTTON_TEXT: Enable Touch ID
  REINSTALL_BUTTON_TEXT: Enable Touch ID
  replace_policy: "True"
  replace_script: "True"
  replace_group: "False"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "%POLICY_CATEGORY%"
      script_path: "%SCRIPT_NAME%"
      script_priority: "%SCRIPT_PRIORITY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%GROUP_TEMPLATE%"
      computergroup_name: "%GROUP_NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      icon: "%SELFSERVICE_ICON%"
