Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.macos-download-ventura-script
MinimumVersion: "2.3"

Input:
  NAME: Download macOS Ventura Installer
  POLICY_NAME: "%NAME%"
  SELFSERVICE_DISPLAY_NAME: "%NAME%"
  USERS_GROUP_NAME: "%NAME% users"
  USERS_GROUP_TEMPLATE: SmartGroup-script-selfservice.xml
  TESTING_GROUP_NAME: Testing
  INELIGIBLE_GROUP_NAME: "%NAME% ineligible"
  INELIGIBLE_GROUP_TEMPLATE: SmartGroup-macOS-download-ineligible.xml
  MIN_OS_VERSION: "10.12.4"
  MAX_OS_VERSION: "13.99"
  MODEL_IDENTIFIER_REGEX: ^(iMac(1[8-9]|[2-9]\d)|^MacPro[7-9]|iMacPro|Macmini([8-9]|\d\d)|MacBookAir([8-9]|\d\d)|MacBook(\d\d)|MacBookPro(1[4-9])|Mac1[3-9]|VirtualMac)
  SCRIPT_NAME: "macOS-download-ventura.zsh"
  SCRIPT_PRIORITY: After
  POLICY_CATEGORY: Tools & Accessories
  POLICY_TEMPLATE: Policy-script-selfservice-exclusion-ineligible-notification.xml
  SELFSERVICE_DESCRIPTION: |
    Downloads 'Install macOS Ventura.app' to the Applications folder, which can then be run manaully to reinstall macOS. If there are any existing macOS installers present in the Applications folder, this will replace them.
  SELFSERVICE_ICON: Install macOS Ventura.png
  INSTALL_BUTTON_TEXT: Download
  REINSTALL_BUTTON_TEXT: Download Again
  FORCE_DESCRIPTION: "false"
  MESSAGE_START: The macOS Monterey installer application will now be downloaded.
  MESSAGE_FINISH: The macOS Monterey installer has been downloaded to the Applications folder.

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "%POLICY_CATEGORY%"
      script_path: "%SCRIPT_NAME%"
      script_priority: "%SCRIPT_PRIORITY%"
      replace_script: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%USERS_GROUP_TEMPLATE%"
      computergroup_name: "%USERS_GROUP_NAME%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%INELIGIBLE_GROUP_NAME%"
      computergroup_template: "%INELIGIBLE_GROUP_TEMPLATE%"
      replace_group: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      icon: "%SELFSERVICE_ICON%"
      replace_policy: "True"
