Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.macos-download-bigsur-script
MinimumVersion: "2.3"

Input:
  NAME: Download macOS Big Sur Installer
  POLICY_NAME: "%NAME%"
  SELFSERVICE_DISPLAY_NAME: "%NAME%"
  USERS_GROUP_NAME: "%NAME% users"
  USERS_GROUP_TEMPLATE: SmartGroup-script-selfservice.xml
  TESTING_GROUP_NAME: Testing
  INELIGIBLE_GROUP_NAME: "%NAME% ineligible"
  INELIGIBLE_GROUP_TEMPLATE: SmartGroup-macOS-download-ineligible.xml
  MIN_OS_VERSION: "10.12.4"
  MAX_OS_VERSION: "11.99"
  MODEL_IDENTIFIER_REGEX: ^(iMac14,4|iMac1[5-9]|iMac2[0-1]|iMacPro|MacBook[8-9]|MacBook1[0-9]|MacBookAir[6-9]|MacBookAir1[0-9]|MacBookPro1[1-7]|Macmini[7-9]|MacPro[6-9])
  SCRIPT_NAME: "macOS-download-bigsur.zsh"
  SCRIPT_PRIORITY: After
  POLICY_CATEGORY: Tools & Accessories
  POLICY_TEMPLATE: Policy-script-selfservice-exclusion-ineligible.xml
  SELFSERVICE_DESCRIPTION: |
    Downloads 'Install macOS Big Sur.app' to the Applications folder, which can then be run manaully to reinstall macOS. If there are any existing macOS installers present in the Applications folder, this will replace them.
  SELFSERVICE_ICON: Install macOS Big Sur.png
  INSTALL_BUTTON_TEXT: Download
  REINSTALL_BUTTON_TEXT: Download Again
  FORCE_DESCRIPTION: "false"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%USERS_GROUP_TEMPLATE%"
      computergroup_name: "%USERS_GROUP_NAME%"
      replace_group: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%INELIGIBLE_GROUP_NAME%"
      computergroup_template: "%INELIGIBLE_GROUP_TEMPLATE%"
      replace_group: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      icon: "%SELFSERVICE_ICON%"
      replace_policy: "True"
