Description: Creates a Once per computer policy to update the Prism license by running the postinstall script.
Identifier: com.github.eth-its-recipes.jamf.script.PrismLicenseUpdate
MinimumVersion: "2.3"

Input:
  NAME: Prism License Update
  SCRIPT_CATEGORY: Science & Math
  SCRIPT_PRIORITY: After
  EXPIRY_YEAR: "2022"
  POLICY_CATEGORY: Administration
  POLICY_TEMPLATE: Policy-prod-once-per-computer-script.xml
  POLICY_NAME: "Issue new Prism license - expiry %EXPIRY_YEAR%"
  INSTALLED_GROUP_NAME: Prism EN installed
  SCRIPT_NAME: Prism-postinstall.sh

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%SCRIPT_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "%SCRIPT_CATEGORY%"
      script_path: "%SCRIPT_NAME%"
      script_priority: "%SCRIPT_PRIORITY%"
      replace_script: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      replace_policy: "True"
