Description: |
  Creates a Once per day policy to run silnite. Also creates the smart group that determines if XProtect is up-to-date

  Requires the "silnite installed" group to already exist.
Identifier: com.github.eth-its-recipes.jamf.script.silentnite-run
MinimumVersion: "2.3"

Input:
  NAME: silnite
  RECURRING_POLICY_CATEGORY: Administration
  RECURRING_POLICY_TEMPLATE: Policy-script-recurring.xml
  RECURRING_POLICY_NAME: "Run %NAME%"
  RECURRING_POLICY_FREQUENCY: Once every week
  RECURRING_GROUP_NAME: silnite installed
  SCRIPT_NAME: silnite-run.zsh
  SCRIPT_PRIORITY: After
  GROUP_NAME: XProtect out of date
  GROUP_TEMPLATE: SmartGroup-generic-EA.xml
  EXTENSION_ATTRIBUTE_NAME: XProtect status
  EXTENSION_ATTRIBUTE_SCRIPT: silnite-xprotect-EA.zsh
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: is not
  EXTENSION_ATTRIBUTE_VALUE: up to date

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%RECURRING_POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfExtensionAttributeUploader
    Arguments:
      ea_script_path: "%EXTENSION_ATTRIBUTE_SCRIPT%"
      ea_name: "%EXTENSION_ATTRIBUTE_NAME%"
      replace_ea: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "%RECURRING_POLICY_CATEGORY%"
      script_path: "%SCRIPT_NAME%"
      script_priority: "%SCRIPT_PRIORITY%"
      replace_script: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%GROUP_TEMPLATE%"
      computergroup_name: "%GROUP_NAME%"
      replace_group: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%RECURRING_POLICY_TEMPLATE%"
      policy_name: "%RECURRING_POLICY_NAME%"
      replace_policy: "True"
