Description: This just uploads an EA and a smart group to Jamf.
Identifier: com.github.eth-its-recipes.jamf.script.VolumeOwners
MinimumVersion: "2.3"

Input:
  EXTENSION_ATTRIBUTE_NAME: Volume Owners
  EXTENSION_ATTRIBUTE_SCRIPT: VolumeOwners-EA.zsh
  GROUP_NAME: No Volume Owners
  GROUP_TEMPLATE: SmartGroup-generic-EA.xml
  EXTENSION_ATTRIBUTE_SEARCH_TYPE: is
  EXTENSION_ATTRIBUTE_VALUE: None

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfExtensionAttributeUploader
    Arguments:
      ea_script_path: "%EXTENSION_ATTRIBUTE_SCRIPT%"
      ea_name: "%EXTENSION_ATTRIBUTE_NAME%"
      replace_ea: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%GROUP_TEMPLATE%"
      computergroup_name: "%GROUP_NAME%"
      replace_group: "True"
