Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.SkypeForBusiness-autouninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-autouninstall-noexclusion

Input:
  NAME: Skype for Business
  PARAMETER5_LABEL: Package Receipt
  PARAMETER5_VALUE: com.microsoft.SkypeForBusiness
