Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.texmaker-uninstall
MinimumVersion: "2.3"
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: texmaker
  SELFSERVICE_DESCRIPTION: "Uninstalls %NAME%"
  PARAMETER5_LABEL: Package Receipt
  PARAMETER5_VALUE: net.xm1math.texmaker
  SELFSERVICE_ICON: texmaker 5.png
